{
   "publications":[
	{
         "name":"Cell-level Spatio-Temporal Model for Bacillus Calmette--Guerin Based Immunotherapy Treatment Protocol of Superficial Bladder Cancer",
         "description":"Bladder cancer is one of the most widespread types of cancer. Multiple treatments for non-invasive, superficial bladder cancer have been proposed over the last several decades with a weekly Bacillus Calmette–Guérin immunotherapy-based therapy protocol, which is considered the gold standard today. Nonetheless, due to the complexity of the interactions between the immune system, healthy cells, and cancer cells in the bladder’s microenvironment, clinical outcomes vary significantly among patients. Mathematical models are shown to be effective in predicting the treatment outcome based on the patient’s clinical condition at the beginning of the treatment. Even so, these models still have large errors for long-term treatments and patients that they do not fit. In this work, we utilize modern mathematical tools and propose a novel cell-level spatio-temporal mathematical model that takes into consideration the cell–cell and cell–environment interactions occurring in a realistic bladder’s geometric configuration in order to reduce these errors. We implement the model using the agent-based simulation approach, showing the impacts of different cancer tumor sizes and locations at the beginning of the treatment on the clinical outcomes for today’s gold-standard treatment protocol. In addition, we propose a genetic-algorithm-based approach to finding a successful and time-optimal treatment protocol for a given patient’s initial condition. Our results show that the current standard treatment protocol can be modified to produce cancer-free equilibrium for deeper cancer cells in the urothelium if the cancer cells’ spatial distribution is known, resulting in a greater success rate.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/cells-11-02372.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Cell-Level Spatio-Temporal Model for a Bacillus Calmette–Guérin-Based Immunotherapy Treatment Protocol of Superficial Bladder Cancer. Cells. 2022."}],
		 "authors": "Teddy Lazebnik",
         "year": 2022,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Cells",
         "publicationStatus":"Published"
      },
	{
         "name":"Providing Safe Space for Honest Mistakes in the Public Sector Is the Most Important Predictor for Work Engagement after Strategic Clarity",
         "description":"Multiple studies highlight the link between engagement at work and performance, influencing organizations to put more effort into improving employee engagement levels. In this study, we begin to examine the influence of multiple psychological parameters on employees’ work engagement (WE) within the public sector. The idea is to break the concept of WE down into eight individually measurable parameters that will allow for a better understanding and development of stronger interventions. Based on this analysis, we reproduce the outcome that strategic clarity is the most connected property to WE. More importantly, we introduce a new concept, honest mistakes, and show that having a safe space for making mistakes and learning from it is the second most important property of WE. This result is of interest, as allowing mistakes, even if they were made innocently, is considered taboo in the public sector. These outcomes are based on the reports of n=7682 public sector employees from Brazil. In particular, the analysis shows that these outcomes hold for both professional and management positions across the health, administrative, justice, police, social work, and education offices. ",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/sustainability-14-07051.pdf"},
					  {"info": "cite", "type": 3, "link": "Gargantini, T., Daly, M., Sherlock, J., Lazebnik, T., Providing Safe Space for Honest Mistakes in the Public Sector Is the Most Important Predictor for Work Engagement after Strategic Clarity. Sustainability. 2022."}],
		 "authors": "Thais Gargantini, Michael Daly, Joseph Sherlock, Teddy Lazebnik",
         "year": 2022,
         "topic":"Social Science",
         "type":"Paper",
         "publisher":"Sustainability",
         "publicationStatus":"Published"
      },
	{
         "name":"Predicting acute kidney injury following open partial nephrectomy treatment using SAT-pruned explainable machine learning model",
         "description":"Background: One of the most prevalent complications of Partial Nephrectomy (PN) is Acute Kidney Injury (AKI), which could have a negative impact on subsequent renal function and occurs in up to 24.3% of patients undergoing PN. The aim of this study was to predict the occurrence of AKI following PN using preoperative parameters by applying machine learning algorithms. Methods We included all adult patients (n = 723) who underwent open PN in our department since 1995 and on whom we have data on the pre-operative renal function. We developed a random forest (RF) model with Boolean satisfaction-based pruned decision trees for binary classification (AKI or non-AKI). Hyper-parameter grid search was performed to optimize the model's performance. Fivefold cross-validation was applied to evaluate the model. We implemented a RF model with greedy feature selection to binary classify AKI and non-AKI cases based on pre-operative data. Results The best model obtained a 0.69 precision and 0.69 recall in classifying the AKI and non-AKI groups on average (k = 5). In addition, the model's probability to correctly classify a new prediction is 0.75. The proposed model is available as an online calculator. Conclusions Our model predicts the occurrence of AKI following open PN with (75%) accuracy. We plan to externally validate this model and modify it to minimally-invasive PN.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/aki_paper.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bahouth, Z., Bunimovich-Mendrazitsky, S., Halachmi, S., Predicting acute kidney injury following open partial nephrectomy treatment using SAT-pruned explainable machine learning model. BMC Medical Informatics and Decision Making. 2022."}],
		 "authors": "Teddy Lazebnik, Zaher Bahouth, Svetlana Bunimovich-Mendrazitsky, Sarel Halachmi",
         "year": 2022,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"BMC Medical Informatics and Decision Making",
         "publicationStatus":"Published"
      },
	{
         "name":"Generic approach for mathematical model of multi-strain pandemics",
         "description":"Multi-strain pandemics have emerged as a major concern. We introduce a new model for assessing the connection between multi-strain pandemics and mortality rate, basic reproduction number, and maximum infected individuals. The proposed model provides a general mathematical approach for representing multi-strain pandemics, generalizing for an arbitrary number of strains. We show that the proposed model fits well with epidemiological historical world health data over a long time period. From a theoretical point of view, we show that the increasing number of strains increases logarithmically the maximum number of infected individuals and the mean mortality rate. Moreover, the mean basic reproduction number is statistically identical to the single, most aggressive pandemic strain for multi-strain pandemics.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/multi_strain_model.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bunimovich-Mendrazitsky, S., Generic approach for mathematical model of multi-strain pandemics. Plos One. 2022."}],
		 "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky",
         "year": 2022,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"PLOS ONE",
         "publicationStatus":"Published"
      },
	  {
         "name":"A distinction of three online learning pedagogic paradigms",
         "description":"Online (web-based) courses emerged at the beginning of the twenty-first century. While this new pedagogic paradigm (PP) holds a promise of better learning and training, it comes with challenges as traditional PPs are not suited to the new settings which highly differ from the physical classroom methods. We studied three online PPs (Synchronous, Asynchronous, and Asynchronous with an audience) and their influence on the students learning process and achievements during an academic mathematics course that was conducted online. 168 students took an exam and answered a questionnaire regarding their learning preferences, experience, and habits after experiencing one of these PPs. We found that students who studied according to the asynchronous with an audience PP achieved a higher score in the exam, regardless of their initial level than students who learned by either the synchronous or asynchronous PPs. In addition, we developed a personalized model based on machine learning methods that match an online PP for each student to maximize the student’s score in the exam. In the case of an academic mathematical course, the online PP had a major influence on the students’ scores in the exam. We found that students with high grades in previous courses preferred synchronous learning, which indicates the importance of picking the right online PP for each student. Our model provides a novel tool for the pedagogic community to personalize online learning by recommending the PP that could be most suitable for each student.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/remote_learning_paper.pdf"},
					  {"info": "cite", "type": 3, "link": "Natan, S., Lazebnik, T., Lerner, E., A distinction of three online learning pedagogic paradigms. SN Social Science. 2022."}],
		 "authors": "Sarit Natan, Teddy Lazebnik, Elisa Lerner",
         "year": 2022,
         "topic":"Remote Learning",
         "type":"Paper",
         "publisher":"SN Social Science",
         "publicationStatus":"Published"
      },
      {
         "name":"A Systematic Review of the Behavioural Changes and Physiological Adjustments of Elasmobranchs and Teleost’s to Ocean Acidification with a Focus on Sharks",
         "description":"In recent years, much attention has been focused on the impact of climate change, particularly via ocean acidification (OA), on marine organisms. Studying the impact of OA on long-living organisms, such as sharks, is especially challenging. When the ocean waters absorb anthropogenic carbon dioxide (CO2), slow-growing shark species with long generation times may be subjected to stress, leading to a decrease in functionality. Our goal was to examine the behavioral and physiological responses of sharks to OA and the possible impacts on their fitness and resilience. We conducted a systematic review in line with PRISMA-Analyses, of previously reported scientific experiments. We found that most studies used CO2 partial pressures (pCO2) that reflect representative concentration pathways for the year 2100 (e.g., pH ~7.8, pCO2 ~1000 μatm). Since there is a considerable knowledge gap on the effect of OA on sharks, we utilized existing data on bony fish to synthesize the available knowledge. Given the similarities between the behaviors and physiology of these two superclasses’ to changes in CO2 and pH levels, there is merit in including the available information on bony fish as well. Several studies indicated a decrease in shark fitness in relation to increased OA and CO2 levels. However, the decrease was species-specific and influenced by the intensity of the change in atmospheric CO2 concentration and other anthropogenic and environmental factors (e.g., fishing, temperature). Most studies involved only limited exposure to future environmental conditions and were conducted on benthic shark species studied in the laboratory rather than on apex predator species. While knowledge gaps exist, and more research is required, we conclude that anthropogenic factors are likely contributing to shark species’ vulnerability worldwide. However, the impact of OA on the long-term stability of shark populations is not unequivocal.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/fish.pdf"},
					  {"info": "cite", "type": 3, "link": "Zemah-Shamir et al. A Systematic Review of the Behavioural Changes and Physiological Adjustments of Elasmobranchs and Teleost’s to Ocean Acidification with a Focus on Sharks. Fishes. 2022."}],
		 "authors": "Ziv Zemah-Shamir, Shiri Zemah-Shamir, Aviad Scheinin, Dan Tchernov, Teddy Lazebnik, and Gideon Gal",
         "year": 2022,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Fishes",
         "publicationStatus":"Published"
      },
      {
         "name":"Advanced Muti-Mutation with Intervention Policies Pandemic Model",
         "description":"A pandemic is a threat to humanity with potentially millions of deaths worldwide. Epidemiological models can be used to better understand pandemic dynamics and assist policymakers in optimizing their Intervention Policies (IPs). Most existing epidemiological models assume, sometimes incorrectly, that a pandemic is caused by a single pathogen, ignoring pathogen mutations over time that result in different pathogen variants with different characteristics. In addition, the existing models do not incorporate the effect of IPs like vaccinations and lockdowns during the fitting phase. In this work, we introduce a new multi-mutation model called Suspected-Infected-Vaccinated-Recovered-reInfected (SIVRI). This model extends the SIRS model with adaptation to incorporate available knowledge related to the different pathogen mutations together with multiple IPs. In order to find the model parameters we propose a new fitting procedure that supports the complex social, epidemiological, and clinical dynamics that occur during a pandemic. We examine the suggested SIVRI model in comparison to the SIRS and XGboost models on the COVID-19 pandemic in Israel that includes four COVID-19 mutations, and the vaccination and lockdown IPs. We show that the proposed model can fit accurately to the historical data and outperform the existing models in predictions of basic reproduction number, mortality rate, and severely infected individuals rate.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/ieee_paper.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Blumrosen, G. Advanced Muti-Mutation with Intervention Policies Pandemic Model. IEEE Access. 2022."}],
		 "authors": "Teddy Lazebnik, Gaddi Blumrosen",
         "year": 2022,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"IEEE Access",
         "publicationStatus":"Published"
      },
      {
         "name":"Computer aided functional style identifcation and correction in modern Russian texts",
         "description":"Functional style (FS) identification is a classification task in linguistics that categorizes unrestricted texts into several categories of linguistic norms. FS is widely used to attain a satisfying outcome in style processing. As such, we train a deep learning attention neural network model on modern-Russian texts, divide them into four FS categories. The model obtained an accuracy of 0.72. In particular, 81.08% and 85.71% accuracy in classifying the artistic and academic FS. The proposed model is able to automate the FS identification process and aids both domain experts and non-domain experts to perform FS correction by highlighting style anomalies concerning a desired style for the text. In particular, we show a 34% and 31% average improvement in the duration of performing the style correction task. Moreover, domain experts and non-domain experts obtain 3% and 9% more accurate results, respectively.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/liza_paper.pdf"},
					  {"info": "cite", "type": 3, "link": "Savchenko, E., Lazebnik, T., Computer aided functional style identifcation and correction in modern russian texts. Journal of Data, Information and Management. 2022."}],
		 "authors": "Elizaveta Savchenko, Teddy Lazebnik",
         "year": 2022,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Journal of Data, Information and Management",
         "publicationStatus":"Published"
      },
      {
         "name":"Comparison of pandemic intervention policies in several building types using heterogeneous population model",
         "description":"In a world where pandemics are a matter of time and increasing urbanization of the world’s population, governments should be prepared with pandemic intervention policies (IPs) to minimize the crisis direct and indirect adverse effects while keeping normal life as much as possible. Successful pandemic IPs have to take into consideration the heterogeneous behavior of individuals in different types of buildings and social contexts. In this study, we propose a spatio-temporal, heterogeneous population model and in silico simulation to evaluate pandemic IPs in four types of buildings - home, office, school, and mall. We show that indeed each building type has a unique pandemic spread and therefore a different optimal IP. Moreover, we show that temporal-based IPs (such as mask wearing) have a similar influence on the pandemic spread in all four building types while spatial-based IPs (such as social distance) highly differ.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/indoor_pandemic.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Alexi, A., Comparison of pandemic intervention policies in several building types using heterogeneous population model. Communications in Nonlinear Science and Numerical Simulation. 2021."}],
		 "authors": "Teddy Lazebnik, Ariel Alexi",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"Communications in Nonlinear Science and Numerical Simulation",
         "publicationStatus":"Published"
      },
      {
         "name":"Improved Geometric Configuration for the Bladder Cancer BCG-Based Immunotherapy Treatment Model",
         "description":"We present an extension to the model proposed by Lazebnik et al. (2021) by improving the approximation of the bladder’s geometry from sphere-ring to ellipsoid-ring [2]. We show the differences between the models on the clinical results and their influence on the optimal treatment protocol.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/ISMCO_2021.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bunimovich-Mendrazitsky, S., Improved Geometric Configuration for the Bladder Cancer BCG-Based Immunotherapy Treatment Model. International Symposium on Mathematical and Computational Oncology. 2021, pp. 63-67."}],
		 "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Conference",
         "publisher":"International Symposium on Mathematical and Computational Oncology",
         "publicationStatus":"Published"
      },
      {
         "name":"Pandemic Management by a Spatio-temporal Mathematical Model",
         "description":"Many researchers have tried to predict the impact of the COVID-19 outbreak on morbidity, in order to help policy-makers find optimal isolation policies. However, despite the development and use of many models and sophisticated tools, these forecasting attempts have largely failed. We present a model that considers the severity of the disease and the heterogeneity of contacts between the population in complex space-time dynamics. Using mathematical and computational methods, the applied tool was developed to analyze and manage the COVID-19 pandemic (from an epidemiological point of view), with a particular focus on population heterogeneity in terms of age, susceptibility, and symptom severity. We show improved strategies to prevent an epidemic outbreak. We evaluated the model in three countries, obtaining an average mean square error of 0.067 over a full month of the basic reproduction number (R0). The goal of this study is to create a theoretical framework for crisis management that integrates accumulated epidemiological considerations. An applied result is an open-source program for predicting the outcome of an isolation strategy for future researchers and developers who can use and extend our model.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/Pandemic_Management.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Shami, L., Bunimovich-Mendrazitsky, S., Pandemic Management by a Spatio-temporal Mathematical Model. International Journal of Nonlinear Sciences and Numerical Simulation. 2021."}],
		 "authors": "Teddy Lazebnik, Labib Shami, Svetlana Bunimovich-Mendrazitsky",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"IJNSNS",
         "publicationStatus":"Published"
      },
      {
         "name":"PDE based geometry model for BCG immunotherapy of bladder cancer",
         "description":"Optimal BCG-based immunotherapy treatment protocol for bladder cancer mathematical model that taking into considuration approximation of the geometrical configuration of the human bladder using PDE modeling Optimal BCG-based immunotherapy treatment protocol for bladder cancer mathematical model that taking into considuration approximation of the geometrical configuration of the human bladder using PDE modeling",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/pde_biosystem_paper.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Aaroni, N., Bunimovich-Mendrazitsky, S., PDE based geometry model for BCG immunotherapy of bladder cancer. BioSystems. 2020."}],
		 "authors": "Teddy Lazebnik, Niva Aaroni, and Svetlana Bunimovich-Mendrazitsky",
         "year": 2020,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"biosystems",
         "publicationStatus":"Published"
      },
      {
         "name":"A Stable Algorithm For Numerical Matrix Exponent",
         "description":"A novel numerical stable algorithm for the computing of any complex squre matrix's exponent with analytical proof for bounded error.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/matrix_exponent.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Yanetz, S., A stable algorithm for numerical matrix exponent. Functional Differential Equations. 2020."}],
		 "authors": "Teddy Lazebnik and Shlomo Yanetz",
         "year": 2016,
         "topic":"Numerical Analysis",
         "type":"Paper",
         "publisher":"Functional Differential Equations",
         "publicationStatus":"Published"
      },
      {
         "name":"Treatment of Bladder Cancer Using BCG Immunotherapy: PDE Modeling",
         "description":"Optimal BCG-based immunotherapy treatment protocol for bladder cancer mathematical model that taking into considuration approximation of the geometrical configuration of the human bladder using PDE modelingOptimal BCG-based immunotherapy treatment protocol for bladder cancer mathematical model that taking into considuration approximation of the geometrical configuration of the human bladder using PDE modeling.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/Treatment_of_Bladder_Cancer_Using_BCG_Immunotherapy.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Yanetz, S., Bunimovich-Mendrazitsky, S., Aaroni, N., Treatment of Bladder Cancer Using BCG Immunotherapy: PDE Modeling. Functional Differential Equations. 2019."}],
		 "authors": "Teddy Lazebnik, Shlomo Yanetz, Svetlana Bunimovich-Mendrazitsky, and Niva Aaroni",
         "year": 2019,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Functional Differential Equations",
         "publicationStatus":"Published"
      },
      {
         "name":"PDE Modeling of Bladder Cancer Treatment Using BCG Immunotherapy",
         "description":"Optimal BCG-based immunotherapy treatment protocol for bladder cancer mathematical model that taking into considuration approximation of the geometrical configuration of the human bladder using PDE modelingOptimal BCG-based immunotherapy treatment protocol for bladder cancer mathematical model that taking into considuration approximation of the geometrical configuration of the human bladder using PDE modeling.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/Treatment_of_Bladder_Cancer_Using_BCG_Immunotherapy.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Yanetz, S., Bunimovich-Mendrazitsky, S., Treatment of Bladder Cancer Using BCG Immunotherapy: PDE Modeling. Functional Differential Equations. 2019."}],
		 "authors": "Teddy Lazebnik, Shlomo Yanetz, and Svetlana Bunimovich-Mendrazitsky",
         "year": 2019,
         "topic":"Biomathematics",
         "type":"Conference",
         "publisher":"Functional Differential Equations conference",
         "publicationStatus":"Published"
      },
      {
         "name":"Mathematical Model for the BCG-based Treatment of Type 1Diabetes",
         "description":"We introduces a model of immunotherapy treatment, namely the Bacillus Calmette-Guerin (BCG) vac-cine, of type 1  diabetes (T1D).",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/abstract_for_DSABNS_2022_conference.pdf"},
					  {"info": "cite", "type": 3, "link": ""}],
		 "authors": "Teddy Lazebnik and Svetlana Bunimovich-Mendrazitsky",
         "year": 2022,
         "topic":"Biomathematics",
         "type":"Abstract",
         "publisher":"Dynamical Systems Applied To Biology And Natural Science",
         "publicationStatus":"Published"
      },
      {
         "name":"Epidemiological-Economical Pandemic Management By A Spatio-Temporal Mathematical Model",
         "description":"We present a model that considers the severity of the disease and the heterogeneity of contacts between the population in complex space-time dynamics.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/abstract_for_DSABNS_2021_conference.pdf"},
					  {"info": "cite", "type": 3, "link": ""}],
		 "authors": "Teddy Lazebnik, Labib Shami, and Svetlana Bunimovich-Mendrazitsky",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Abstract",
         "publisher":"Dynamical Systems Applied To Biology And Natural Science",
         "publicationStatus":"Published"
      },
      {
         "name":"Spatio-Temporal influence of Non-Pharmaceutical interventions policies on pandemic dynamics and the economy: the case of COVID-19",
         "description":"We have developed an extended mathematical graph-based spatial-temporal SIR model, allowing a multidimensional analysis of the impact of non-pharmaceutical interventions on the pandemic spread, while assessing the economic losses caused by it. By incorporating into the model dynamics that are a consequence of the interrelationship between the pandemic and the economic crisis, such as job separation not as a result of workers’ morbidity, analysis were enriched. Controlling the spread of the pandemic and preventing outbreaks have been investigated using two NPIs: the duration of working and school days and lockdown to varying degrees among the adult and children populations. Based on the proposed model and data from the Israeli economy, allowing 7.5 working hours alongside 4.5 school hours would maximise output and prevent an outbreak, while minimising the death toll (0.48% of the population). Alternatively, an 89% lockdown among children and a 63% lockdown among adults will minimise the death toll (0.21%) while maximising output and preventing outbreaks.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/covid_second_paper.pdf"},
					  {"info": "cite", "type": 3, "link": ""}],
		 "authors": "Teddy Lazebnik, Labib Shami, and Svetlana Bunimovich-Mendrazitsky",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"Economic Research",
         "publicationStatus":"Published"
      },
      {
         "name":"Rivendell: Project-Based Academic Search Engine",
         "description":"Meta academic search engine using project-based search with explicit user tagging to improve search results.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/nano_confirance.pptx"},
					  {"info": "cite", "type": 3, "link": ""}],
		 "authors": "Teddy Lazebnik, Hana Weitman, and Gal A. Kaminka",
         "year": 2018,
         "topic":"Information Systems",
         "type":"Abstract",
         "publisher":"Bar-Ilan Nanotechnology and Advanced Materials",
         "publicationStatus":"Published"
      },
      {
         "name":"Optimal Intervention Policies for the COVID-19 Pandemic Emerge from Socioeconomic-Heterogeneous Dynamics",
         "description":"The COVID-19 pandemic is a rolling crisis that required policymakers around the world to take action to manage the pandemic spread. During the period where vaccination was not available, the pandemic spread management lied in Non-Pharmaceutical Interventions (NPIs). A large number of mathematical models have been proposed to predict the pandemic spread and analyze the influence of various NPIs on multiple scenarios, getting more accurate and sophisticated over time. In this work, we review the latest mathematical models for pandemic spread NPIs and their main shortages. Specifically, the usage of modeling a homogeneous population rather than a heterogeneous one.",
         "fileLinks":[{"info": "download", "type": 1, "link": "https://www.hilarispublisher.com/open-access/optimal-intervention-policies-for-the-covid19-pandemic-emerge-from-socioeconomicheterogeneous-dynamics.pdf"},
					  {"info": "cite", "type": 3, "link": ""}],
		 "authors": "Teddy Lazebnik",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Abstract",
         "publisher":"Journal of Physical Mathematics",
         "publicationStatus":"Published"
      },
      {
         "name":"The signature features of COVID-19 pandemic in a hybrid mathematical model - implications for optimal work-school lockdown policy",
         "description":"The new COVID-19 pandemic has challenged policymakers on key issues. Most countries have adopted “lockdown” policies to reduce the spatial spread of COVID-19, but they have damaged the economic and moral fabric of society. Mathematical modeling in non-pharmaceutical intervention policy management has proven to be a major weapon in this fight due to the lack of an effective COVID-19 vaccine. We present a new \textit{hybrid} model for COVID-19 dynamics using both an age-structured mathematical model based on the SIRD model and spatio-temporal model in silico, analyzing the data of COVID-19 in Israel. Using the \textit{hybrid} model, we have introduced a method for estimating the reproduction number of an epidemic in real-time from the data of daily notification of cases. The results of the proposed model are confirmed by the Israeli Lockdown experience with a mean square error of 0.205 over two weeks. The use of mathematical models promises to reduce the uncertainty in the choice of “Lockdown” policies. Our unique use of contact details from 2 classes (children and adults), the interaction of populations depending on the time of day, and several physical locations, allowed a new look at the differential dynamics of the spread and control of infection.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/covid_first.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bunimovich-Mendrazitsky, S., The signature features of COVID-19 pandemic in a hybrid mathematical model - implications for optimal work-school lockdown policy. Advanced Theory and Simulations. 2021"}],
		 "authors": "Teddy Lazebnik and Svetlana Bunimovich-Mendrazitsky",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"Advanced Theory and Simulations",
         "publicationStatus":"Published"
      },
      {
         "name":"Novel Method to Analytically Obtain the Asymptotic Stable Equilibria States of Extended SIR-Type Epidemiological Models",
         "description":"We present a new analytical method to find the asymptotic stable equilibria states based on the Markov chain technique. We reveal this method on the Susceptible-Infectious-Recovered (SIR)-type epidemiological model that we developed for viral diseases with long-term immunity memory. This is a large-scale model containing 15 nonlinear ordinary differential equations (ODEs), and classical methods have failed to analytically obtain its equilibria. The proposed method is used to conduct a comprehensive analysis by a stochastic representation of the dynamics of the model, followed by finding all asymptotic stable equilibrium states of the model for any values of parameters and initial conditions thanks to the symmetry of the population size over time.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/symmetry_sir_paper.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bunimovich-Mendrazitsky, S., Shaikhet, L., Novel Method to Analytically Obtain the Asymptotic Stable Equilibria States of Extended SIR-Type Epidemiological Models. Symmetry. 2021."}],
		 "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky, and Leonid Shaikhet",
         "year": 2021,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Symmetry",
         "publicationStatus":"Published"
      }
	  ]
}
