{
   "publications":[
	{
         "name":"A time-series clustering analysis of postinduction blood pressure trajectories",
         "description":"Induction of general anesthesia is often associated with significant hemodynamic changes, particularly in blood pressure (BP). These early postinduction fluctuations can vary widely among patients and contribute to perioperative complications. Current clinical approaches to managing postinduction BP changes are largely reactive and may not fully account for individual variability. This study aimed to identify distinct patterns of mean arterial pressure (MAP) response during the first 10 min following induction of general anesthesia, using a time-series clustering approach. We conducted a retrospective cohort study of 17,645 adult patients undergoing non-cardiac, non-obstetric inpatient surgery under general anesthesia at a tertiary medical center. BP was measured at 1 min intervals using either invasive arterial lines (8.3% of cases) or standard non-invasive oscillometric cuffs. An unsupervised X-means clustering algorithm with dynamic time warping was applied to identify recurring MAP trajectory patterns. Patient demographics, comorbidities, anesthetic drug doses, and other perioperative characteristics were compared across clusters. Five distinct MAP trajectories were identified: Initial Decline—Plateau (31.8%), Gradual Moderate Decline (18.4%), Initial Decline—Recovery (7.5%), Gradual Severe Decline (29.6%), and Initial Decline—Low Plateau (12.7%). These patterns differed significantly in baseline MAP, comorbidity profiles and antihypertensive use, while differences in anesthetic agent doses were statistically but not clinically meaningful. Distinct postinduction BP trajectories were identified using a time-series clustering approach. These findings provide a framework for future validation in datasets with richer clinical context.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/glebov.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Glebov, M., Katsin, M., Berkenstadt, H., Orkin, D., Portnoy, Y., Schuchami, A., Lazebnik, T., A time-series clustering analysis of postinduction blood pressure trajectories. Scientific Reports. 2026."}],
		 "authors": "Maxim Glebov, Maksim Katsin, Haim Berkenstadt, Dina Orkin, Yotam Portnoy, Adi Schuchami, Teddy Lazebnik",
         "year": 2026,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Scientific Reports",
         "publicationStatus":"Published"
      },
	{
         "name":"An empirically-parameterized spatio-temporal extended-SIR model for combined dilution and vaccination mitigation for rabies outbreaks in wild jackals",
         "description":"The transmission of zoonotic diseases between animals and humans poses an increasing threat. Rabies is a prominent example with various instances globally. The abundance of anthropogenic resources leads to dense populations meso-predators close to human establishments. These facultative synanthropic species such as golden jackals (Canis aureus, hereafter jackals) facilitate the spread of rabies. To mitigate rabies outbreaks and prevent human infections, the Israeli authorities target the jackal, which is the main rabies vector in many regions, through a wide spread dissemination of oral vaccines, as well as opportunistic dilution to reduce population density in known jackals’ activity centers. Because dilution is not selective towards sick or un-vaccinated individuals, these two complementary epizootic intervention policies (EIPs, vaccination and dilution) can interfere with each other but their interactive effectiveness remains understudied, limiting their simultaneous application. In this study, we aim to address this knowledge gap by modeling the combined effect of these EIPs on rabies epizootic spread dynamics. Towards this end, we introduce a novel spatio-temporal extended-SIR (susceptible–infected–recovered) model with a graph-based spatial framework. After formulating the model, we implement it in the case study of the jackal population in northern Israel, by using spatial and movement tracking data (bio-telemetry). Realizing the model as an agent-based simulation approach allows us to explore various biologically-realistic scenarios, and assess the impact of different EIPs configurations. Our model suggests that under biologically-realistic underlying assumptions and scenarios, the effectiveness of both EIPs is not influenced much by the jackal population size but is sensitive to their dispersal between adjacent activity centers. Furthermore, we show both theoretically and empirically, that interference between the two EIPs can lead to mal-practice. Counter intuitively, there are cases in which the practice of both EIPs together actually leads to an increas in the spread of the epizootic (or endemic), due to elevated vector movement and removal of vaccinated individuals. Our findings emphasize the importance of accurately capturing the local jackal movement dynamics to obtain and predict the desired outcome from an applied EIP configuration, and the value of extended-SIR models in predicting the efficiency of realistic EIP scenarios",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/jackals_pandemic.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Samuel, Y., Tichon, J., Lapid, R., King, R., Nissimyan, T., Spiegel, O., An empirically-parameterized spatio-temporal extended-SIR model for combined dilution and vaccination mitigation for rabies outbreaks in wild jackals. Ecological Modelling. 2026."}],
		 "authors": "Teddy Lazebnik, Yehuda Samuel, Jonathan Tichon, Roi Lapid, Roni King, Tomer Nissimyan, Orr Spiegel",
         "year": 2026,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Ecological Modelling",
         "publicationStatus":"Published"
      },
	{
         "name":"Knowledge integration for physics-informed symbolic regression using pre-trained large language models",
         "description":"Symbolic regression (SR) has emerged as a powerful tool for automated scientific discovery, enabling the derivation of governing equations from experimental data. A growing body of work illustrates the promise of integrating domain knowledge into the SR to improve the discovered equation’s generality and usefulness. Physics-informed SR (PiSR) addresses this by incorporating domain knowledge, but current methods often re- quire specialized formulations and manual feature engineering, limiting their adaptability only to domain experts. In this study, we leverage pre-trained Large Language Models (LLMs) to facilitate knowledge integration in PiSR. By harnessing the contextual understanding of LLMs trained on vast scientific literature, we aim to automate the incorporation of domain knowledge, reducing the need for manual intervention and making the process more accessible to a broader range of scientific problems. Namely, the LLM is integrated into the SR’s loss function, adding a term of the LLM’s evaluation of the SR’s produced equation. We extensively evaluate our method using three SR algorithms (DEAP, gplearn, and PySR) and three pre-trained LLMs (Falcon, Mistral, and LLama 2) across three physical dynamics (dropping ball, simple harmonic motion, and electromagnetic wave). The results demonstrate that LLM integration consistently improves the reconstruction of physical dynamics from data, enhancing the robustness of SR models to noise and complexity. We further explore the impact of prompt engineering, finding that more informative prompts significantly improve performance.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/llm_sr.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Taskin, B., Xie, W., Lazebnik, T., Knowledge integration for physics-informed symbolic regression using pre-trained large language models. Scientific Reports. 2026."}],
		 "authors": "Bilge Taskin, Wenxiong Xie, Teddy Lazebnik",
         "year": 2026,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Scientific Reports",
         "publicationStatus":"Published"
      },
	{
         "name":"Close encounters of the cat kind: The influence of context and sex on facial signaling proximity in domesticated cats (Felis silvestris catus)",
         "description":"Animals, such as domesticated cats, establish and maintain various types of social bonds through frequent and affectionate interactions, which can include behaviors like allogrooming, allorubbing, and co-sleeping. In our previous study, we found that these behaviors are facilitated by rapid facial mimicry, a process that allows individuals to connect with one another both physically and psychologically. When measuring social bonds among animals, researchers have often relied on spatial proximity measurements, and recently, there has been a movement toward using AI-based approaches to improve accuracy in these assessments. However, such approaches have not yet been applied to the study of domestic cat affiliative behavior and social bonding, despite their large degree of social flexibility. In our current study, we use AI-based computer vision systems to investigate the relationship between social context (affiliative vs. non-affiliative), sex composition (female-female, mixed-sex, male-male), and spatial proximity during intraspecific cat facial signaling interactions. Based on our understanding of social bonding in domesticated cats, we developed two testable predictions: (P1) that cats will be closer during affiliative facial signaling interactions than during non-affiliative ones; and (P2) that adult sex composition affects communicative proximity, with female–female dyads showing the closest proximity, followed by female–male/male–female, and finally male–male dyads. Our results supported P2 but not P1. Interestingly, cats showed significantly greater spatial proximity during non-affiliative facial signaling interactions than during affiliative ones. Our study reveals the utility of AI-based approaches in the study of cat behavior, while also presenting a more complex and nuanced social profile of cats.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/cat_distance.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Florkiewicz, B. N., Kanevsky, E., Zamansky, A., Lazebnik, T., Close encounters of the cat kind: The influence of context and sex on facial signaling proximity in domesticated cats (Felis silvestris catus). Journal of Veterinary Behavior. 2026."}],
		 "authors": "Brittany N. Florkiewicz, Eddie Kanevsky, Anna Zamansky, Teddy Lazebnik",
         "year": 2026,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Journal of Veterinary Behavior",
         "publicationStatus":"Published"
      },
	{
         "name":"Transforming norm-based to graph-based spatial representation for spatio-temporal epidemiological models",
         "description":"Pandemics, with their profound societal and economic impacts, pose significant threats to global health, mortality rates, economic stability, and political landscapes. In response to these challenges, numerous studies have employed spatio-temporal models to enhance our understanding and management of these complex phenomena. These spatio-temporal models can be roughly divided into two main spatial categories: norm-based and graph-based. Norm-based models are usually more accurate and easier to model, but are more computationally intensive and require more data to fit. On the other hand, graph-based models are less accurate and harder to model, but are less computationally intensive and require fewer data to fit. As such, ideally, one would like to use a graph-based model while preserving the representation accuracy obtained by the norm-based model. In this study, we explore the ability to transform from norm-based to graph-based spatial representation for these models. We first show that no analytical mapping between the two exists, requiring one to use numerical approximation methods instead. We introduce a novel framework for this task, together with twelve possible implementations using a wide range of heuristic optimization approaches. Our findings show that by leveraging agent-based simulations and heuristic algorithms for the graph node’s location and population’s spatial walk dynamics approximation, one can use graph-based spatial representation without losing much of the model’s accuracy and expressiveness. We investigate our framework for three real-world cases, achieving 93% accuracy preservation, on average, while obtaining 86% relative computational time reduction. Moreover, an analysis of synthetic cases shows the proposed framework is relatively robust for changes in both spatial and temporal properties.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/norm_to_graph.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Transforming norm-based to graph-based spatial representation for spatio-temporal epidemiological models. Engineering Applications of Artificial Intelligence. 2025."}],
		 "authors": "Teddy Lazebnik",
         "year": 2026,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Engineering Applications of Artificial Intelligence",
         "publicationStatus":"Published"
      },
	{
         "name":"Introducing “Inside” out of distribution",
         "description":"Detecting and understanding out-of-distribution (OOD) samples is crucial in machine learning (ML) to ensure reliable modelperformance. Current OOD studies primarily focus on extrapolatory (outside) OOD, neglecting potential cases of interpolatory(inside) OOD. In this study, we introduce a novel perspective on OOD by suggesting that it can be divided into inside andoutside cases. We examine the inside–outside OOD profiles of datasets and their impact on ML model performance, usingnormalized root mean squared error (RMSE) and F1 score as the performance metrics on synthetically generated datasets withboth inside and outside OOD. Our analysis demonstrates that different inside–outside OOD profiles lead to unique effects onML model performance, with outside OOD generally causing greater performance degradation, on average. These findingshighlight the importance of distinguishing between inside and outside OOD for developing effective counter-OOD methods.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/inside_ood.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Introducing “Inside” out of distribution. International Journal of Data Science and Analytics. 2025."}],
		 "authors": "Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"International Journal of Data Science and Analytics",
         "publicationStatus":"Published"
      },
	{
         "name":"Do Institutions Make Street-Level Bureaucrats Prosocial? Agent-Based Evidence Shows That New Public Management Does Not",
         "description":"Does street-level bureaucrats' (SLBs) willingness to sacrifice their own self-interests to meet the needs of their clients vary depending on their contexts? To date, it has been very challenging to empirically examine how SLBs who have different orientations toward social values might act in different institutional and administrative contexts. To overcome this obstacle, in this study, we develop an agent-based simulation of the interactions between SLBs and their citizen–clients. We use our simulations with SLBs in traditional public administration, new public management (NPM), and post-NPM contexts. Our results reveal that the SLBs' personal characteristics are less important than the institutional and administrative context with regard to their interactions with their clients. In NPM environments, SLBs are much less prosocial than in traditional public administration settings. In a post-NPM setting, they are more prosocial than in the NPM environment. In addition, we demonstrate how various elements, including the ratio between SLBs and their citizen–clients play an important role in this regard. Regardless of the institutional or administrative context, adding more SLBs to public administration increases their prosocial orientations. However, this link is not linear.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/abs_slb.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Cohen, N., Lazebnik, T., Do Institutions Make Street-Level Bureaucrats Prosocial? Agent-Based Evidence Shows That New Public Management Does Not. European Policy Analysis. 2025."}],
		 "authors": "Nissim Cohen, Teddy Lazebnik",
         "year": 2025,
         "topic":"socio-economic",
         "type":"Paper",
         "publisher":" European Policy Analysis",
         "publicationStatus":"Published"
      },
	{
         "name":"Tighten the lasso: a convex hull volume-based anomaly detection method",
         "description":"Detecting out-of-distribution (OOD) data is a critical task for maintaining model reliability and robustness. In this study, we propose a novel anomaly detection algorithm that leverages the convex hull (CH) property of a dataset by exploiting the observation that OOD samples marginally increase the CH’s volume compared to in-distribution samples. Thus, we establish a decision boundary between OOD and in-distribution data by iteratively computing the CH’s volume as samples are removed, stopping when such removal does not significantly alter the CH’s volume. The proposed algorithm is evaluated against seven widely used anomaly detection methods across ten datasets, demonstrating performance comparable to state-of-the-art (SOTA) techniques. Furthermore, we introduce a computationally efficient criterion for identifying datasets where the proposed method outperforms existing SOTA approaches.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/hcad.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Itai, U., Bar Ilan, A., Lazebnik, T., Tighten the lasso: a convex hull volume-based anomaly detection method.  International Journal of Data Science and Analytics. 2025."}],
		 "authors": "Uri Itai, Asael Bar Ilan, Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"International Journal of Data Science and Analytics",
         "publicationStatus":"Published"
      },
	{
         "name":"Faces of time: a historical overview of rapid innovations in coding animal facial signals",
         "description":"Since Charles Darwin's influential work on The Expression of the Emotions in Man and Animals, there have been significant advancements in how animal behaviorists identify and describe the facial signals of animals, including humans. Most of these advancements are largely attributed to technological innovations in how data are recorded in addition to the establishment of computer programs that aid with behavioral coding and analysis. Consequently, various manual and automated approaches can be adopted, each with its own benefits and drawbacks. The goal of this overview is twofold. First, we provide an overview of the past and present techniques for coding animal facial signals. Second, we compare and contrast each method, offering multiple examples of how each technique has been used and can be applied in the study of animal facial signaling today. Our examples include studies that address empirical questions related to animal behavior, as well as studies aimed at generating applications for animal welfare. Instead of favoring or criticizing one approach over another, our aim is to foster appreciation for the advancements in animal facial signal coding and to inspire future innovations in this field.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/faces_of_time.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Florkiewicz, B., Faces of time: a historical overview of rapid innovations in coding animal facial signals. Frontiers in Veterinary Science. 2025."}],
		 "authors": "Teddy Lazebnik, Brittany Florkiewicz",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Frontiers in Veterinary Science",
         "publicationStatus":"Published"
      },
	{
         "name":"Comparing partial differential equations and agent-based simulations in spatio-temporal modeling of cancer growth and shape",
         "description":"Spatio-temporal partial differential equations (PDEs) models of cancer make several ad-hoc assumptions about the dynamics on the unknown boundary of the tumor in order to solve the PDE system of equations and, at the same time, determine also the boundary of the tumor. In this paper, we developed a different computation approach using the agent-based simulation (ABS) modeling method. We consider a simple cancer model, and use, in the ABS model, the same parameters that express the rates of interactions among cells and proteins, as in the PDE model, but we make no ad-hoc assumptions on the dynamics of the unknown tumor boundary. However, ABS is a stochastic process, hence, in order to get a good approximation of the tumor boundary, we need to repeat the simulations many times, and then take the average. We show, in the spherical case, that the tumor volume computed by the ABS is in increasingly good agreement with the PDE volume as the number of ABS repetitions is increased. We next use the ABS model to compute several non-symmetric shapes that are commonly seen in non-invasive and invasive cancers.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/teddy_avner_new_math.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Friedman, A., Comparing partial differential equations and agent-based simulations in spatio-temporal modeling of cancer growth and shape. Journal of Computational and Applied Mathematics. 2025."}],
		 "authors": "Teddy Lazebnik, Avner Friedman",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Journal of Computational and Applied Mathematics",
         "publicationStatus":"Published"
      },
	{
         "name":"Explainable Surgical Procedures Recommender System Leveraging Large Language Models",
         "description":"Significant advancements have recently been made in the fields of recommender systems and natural language processing, particularly with large language models (LLMs). In most cases, recommender systems have been used to suggest items and enhance personalization for users, while LLMs have been applied to textual tasks such as text completion, translation, and summarization. In this study, we demonstrate that integrating recommender system models with recent LLMs can effectively suggest appropriate surgical procedures for patients. We employ several LLMs to process clinical text in a morphologically rich language, serving three crucial roles: information representation, information enrichment, and explaining the surgical procedure suggestions made by the recommender system. Our method was evaluated using real-world clinical data, considering patients’ demographic attributes and health conditions. To assess the explainability of our method, we conducted an extensive experiment involving several clinicians. The results achieved by our method indicate that using recommender systems and LLMs can lead to high performance and improved explanations. Our study has the potential to enhance the personalization of healthcare and could be adopted by health services to assist healthcare professionals in recommending appropriate surgical procedures.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/clinical_surgery_llm.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Solomon, A., Glebov, M., Lazebnik, T., Explainable Surgical Procedures Recommender System Leveraging Large Language Models. ACM Transactions on Recommender Systems. 2025."}],
		 "authors": "Adir Solomon, Maxim Glebov, Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"ACM Transactions on Recommender Systems",
         "publicationStatus":"Published"
      },
	{
         "name":"Non-Invasive Computer Vision-Based Fruit Fly Larvae Differentiation: Ceratitis capitata and Bactrocera zonata",
         "description":"The Mediterranean fruit fly (Ceratitis capitata) and the peach fruit fly (Bactrocera zonata) are two of the most economically significant agricultural pests affecting fruit production worldwide. Both are considered quarantine pests in several countries, which oblige the use of restrictive measures to assure safe trade with countries where these flies are present. As the quarantine status of these two pests is not similar in every country, discriminating measures among these two fruit flies' larvae in the exported fruits is critical for safe trade. Traditional DNA-based detection methods, though accurate, are costly and time-consuming, while manual morphological identification is practically impossible. In this study, we propose a novel non-invasive method utilising computer vision for rapid differentiation between larvae of these two species based on a short video recording of a single larva freely moving on a Petri dish. Our results reveal good separation between the two species with 90% accuracy using videos as short as 15s long.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/larvae.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Kanevsky, E., Lazebnik, T., Kaspi, R., Gazit, Y., Halon, E., Fried, D., Zamansky, A., Pines, G., Non-Invasive Computer Vision-Based Fruit Fly Larvae Differentiation: Ceratitis capitata and Bactrocera zonata. Journal of Applied Entomology. 2025."}],
		 "authors": "Eddie Kanevsky, Teddy Lazebnik, Roy Kaspi, Yoav Gazit, Eyal Halon, Dror Fried, Anna Zamansky, Gur Pines",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Journal of Applied Entomology",
         "publicationStatus":"Published"
      },
	{
         "name":"A comprehensive benchmark of machine and deep learning models on structured data for regression and classification",
         "description":"The analysis of tabular datasets is highly prevalent both in scientific research and real-world applications of Machine Learning (ML). Unlike many other ML tasks, Deep Learning (DL) models often do not outperform traditional methods in this area. Previous comparative benchmarks have shown that DL performance is frequently equivalent to or even inferior to models such as Gradient Boosting Machines (GBMs). In this study, we introduce a comprehensive benchmark aimed at better characterizing the types of datasets where DL models excel. Although several important benchmarks for tabular datasets already exist, our contribution lies in the variety and depth of our comparison: we evaluate 111 datasets with 20 different models, including both regression and classification tasks. These datasets vary in scale and include both those with and without categorical variables. Importantly, our benchmark contains a sufficient number of datasets where DL models perform best, allowing for a thorough analysis of the conditions under which DL models excel. Building on the results of this benchmark, we train a model that predicts scenarios where DL models significantly outperform alternative methods, considering only datasets where the performance difference between the two groups is statistically significant. This filtering yields 36 datasets out of the original 111. On this subset, our model achieves 92 % accuracy. We present insights derived from this characterization and compare these findings to previous benchmarks.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/compare_ml.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Shmuel, A., Glickman, O., Lazebnik, T., A comprehensive benchmark of machine and deep learning models on structured data for regression and classification. Neurocomputing. 2025."}],
		 "authors": "Assaf Shmuel, Oren Glickman, Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Neurocomputing",
         "publicationStatus":"Published"
      },
	{
         "name":"Mind Your Manners: The Dynamics of Politeness in Human-AI vs. Human-Human Interactions",
         "description":"The rapid integration of artificial intelligence (AI) into communication systems has significantly altered how users interact with digital tools and collaborate with AI agents. This study investigates the dynamics of politeness in human-AI interactions through a controlled experiment with 1,684 participants, each completing sequential text-based tasks with a conversational AI system. Participants were randomly assigned to one of several conditions that varied in the AI's visual identity (no icon, robot icon, or human face), allowing us to examine the role of perceived anthropomorphism through a minimal visual cue. Politeness was measured using linguistic markers and analyzed using statistical models that account for task sequence and individual differences. Our findings show that politeness toward AI declines over time, with a temporary increase at the start of a second task. Compared to human-human interactions in a benchmark dataset, politeness in human-AI interactions eroded more quickly. Younger participants were less polite overall, and although frequent AI users also appeared less polite descriptively, adjusted models showed a small positive association with daily AI use. Anthropomorphic visual cues, especially human-like avatars, led to more sustained polite behavior. These results offer insight into how users adapt social norms in AI-mediated collaboration and suggest design strategies for fostering respectful and effective human-AI communication.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/mind_your_manners.pdf"},
		 					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Zalmanson, L., Mokryn, O., Mind Your Manners: The Dynamics of Politeness in Human-AI vs. Human-Human Interactions. Proceedings of the ACM on Human-Computer Interaction. 2025."}],
		 "authors": "Teddy Lazebnik, Lior Zalmanson, Osnat Mokryn",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Proceedings of the ACM on Human-Computer Interaction",
         "publicationStatus":"Published"
      },
	{
         "name":"Does the tail show when the nose knows? Artificial intelligence outperforms human experts at predicting detection dogs finding their target through tail kinematics",
         "description":"Detection dogs are utilized for searching and alerting to various substances due to their olfactory abilities. Dog trainers report being able to ‘predict’ such identification based on subtle behavioural changes, such as tail movement. This study investigated tail kinematic patterns of dogs during a detection task, using computer vision to detect tail movement. Eight dogs searched for a target odour on a search wall, alerting to its presence by standing still. Dogs’ detection accuracy against a distractor odour was 100% with trained concentration, while during threshold assessment, it progressively reached 50%. In the target odour area, dogs exhibited a higher left-sided tail-wagging amplitude. An artificial intelligence (AI) model showed a 77% accuracy score in the classification, and, in line with the dogs’ performance, progressively decreased at lower odour concentrations. Additionally, we compared the performance of an AI classification model to that of 190 detection dog handlers in determining when a dog was in the vicinity of a target odour. The AI model outperformed dog professionals, correctly classifying 66% against 46% of videos. These findings indicate the potential of AI-enhanced techniques to reveal new insights into dogs’ behavioural repertoire during odour discrimination.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/dog_tail.pdf"},
		 {"info": "cite", "type": 3, "link": "Martvel, G., Pedretti, G., Lazebnik, T., Zamansky, A., Ouchi, Y., Monteiro, T., Farhat, N., Shimshoni, I., Grinstein, D., Michaeli, Y., Valsecchi, P., Hall, N., Marshall-Pescini, S., Does the tail show when the nose knows? Artificial intelligence outperforms human experts at predicting detection dogs finding their target through tail kinematics. Royal Society Open science. 2025."}],
		 "authors": "George Martvel, Giulia Pedretti, Teddy Lazebnik, Anna Zamansky, Yuri Ouchi, Tiago Monteiro, Nareed Farhat, Ilan Shimshoni, Dan Grinstein, Yuval Michaeli, Paola Valsecchi, Nathaniel Hall and Sarah Marshall-Pescini",					  
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Royal Society Open science",
         "publicationStatus":"Published"
      },
	{
         "name":"Explainable Surgical Procedures Recommender System Leveraging Large Language Models",
         "description":"Significant advancements have recently been made in the fields of recommender systems and natural language processing, particularly with large language models (LLMs). In most cases, recommender systems have been used to suggest items and enhance personalization for users, while LLMs have been applied to textual tasks such as text completion, translation, and summarization. In this study, we demonstrate that integrating recommender system models with recent LLMs can effectively suggest appropriate surgical procedures for patients. We employ several LLMs to process clinical text in a morphologically rich language, serving three crucial roles: information representation, information enrichment, and explaining the surgical procedure suggestions made by the recommender system. Our method was evaluated using real-world clinical data, considering patients’ demographic attributes and health conditions. To assess the explainability of our method, we conducted an extensive experiment involving several clinicians. The results achieved by our method indicate that using recommender systems and LLMs can lead to high performance and improved explanations. Our study has the potential to enhance the personalization of healthcare and could be adopted by health services to assist healthcare professionals in recommending appropriate surgical procedures.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/llm_clinical.pdf"},
					  {"info": "cite", "type": 3, "link": "Solomon, A., Glebov, M., Lazebnik, T., Explainable Surgical Procedures Recommender System Leveraging Large Language Models. ACM Transactions on Recommender Systems. 2025."}],
		 "authors": "Adir Solomon, Maxim Glebov, Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"ACM Transactions on Recommender Systems",
         "publicationStatus":"Published"
      },
	{
         "name":"A comprehensive benchmark of machine and deep learning models on structured data for regression and classification",
         "description":"The analysis of tabular datasets is highly prevalent both in scientific research and real-world applications of Machine Learning (ML). Unlike many other ML tasks, Deep Learning (DL) models often do not outperform traditional methods in this area. Previous comparative benchmarks have shown that DL performance is frequently equivalent to or even inferior to models such as Gradient Boosting Machines (GBMs). In this study, we introduce a comprehensive benchmark aimed at better characterizing the types of datasets where DL models excel. Although several important benchmarks for tabular datasets already exist, our contribution lies in the variety and depth of our comparison: we evaluate 111 datasets with 20 different models, including both regression and classification tasks. These datasets vary in scale and include both those with and without categorical variables. Importantly, our benchmark contains a sufficient number of datasets where DL models perform best, allowing for a thorough analysis of the conditions under which DL models excel. Building on the results of this benchmark, we train a model that predicts scenarios where DL models significantly outperform alternative methods, considering only datasets where the performance difference between the two groups is statistically significant. This filtering yields 36 datasets out of the original 111. On this subset, our model achieves 92 % accuracy. We present insights derived from this characterization and compare these findings to previous benchmarks.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/ml_table_benchmark.pdf"},
					  {"info": "cite", "type": 3, "link": "Shmuel, A., Glickman, O., Lazebnik, T., A comprehensive benchmark of machine and deep learning models on structured data for regression and classification. Neurocomputing. 2025."}],
		 "authors": "Assaf Shmuel, Oren Glickman, Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Neurocomputing",
         "publicationStatus":"Published"
      },
	{
         "name":"Non-Invasive Computer Vision-Based Fruit Fly Larvae Differentiation: Ceratitis capitata and Bactrocera zonata",
         "description":"The Mediterranean fruit fly (Ceratitis capitata) and the peach fruit fly (Bactrocera zonata) are two of the most economically sig-nificant agricultural pests affecting fruit production worldwide. Both are considered quarantine pests in several countries, whichoblige the use of restrictive measures to assure safe trade with countries where these flies are present. As the quarantine statusof these two pests is not similar in every country, discriminating measures among these two fruit flies' larvae in the exportedfruits is critical for safe trade. Traditional DNA-based detection methods, though accurate, are costly and time-consuming, whilemanual morphological identification is practically impossible. In this study, we propose a novel non-invasive method utilisingcomputer vision for rapid differentiation between larvae of these two species based on a short video recording of a single larvafreely moving on a Petri dish. Our results reveal good separation between the two species with 90% accuracy using videos asshort as 15 s long.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/sam.pdf"},
					  {"info": "cite", "type": 3, "link": "Kanevsky, E., Lazebnik, T., Kaspi, R., Gazit, Y., Halon, E., Fried, D., Zamansky, A., Pines, G., Non-Invasive Computer Vision-Based Fruit Fly Larvae Differentiation: Ceratitis capitata and Bactrocera zonata. Journal of Applied Entomology. 2025."}],
		 "authors": "Eddie Kanevsky, Teddy Lazebnik, Roy Kaspi, Yoav Gazit, Eyal Halon, Dror Fried, Anna Zamansky, Gur Pines",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Journal of Applied Entomology",
         "publicationStatus":"Published"
      },
	{
         "name":"A Machine Learning-Based Guide for Repeated Laboratory Testing in Pediatric Emergency Departments",
         "description":"Background/Objectives: Laboratory tests conducted in community settings are occasionally repeated within hours of presentation to pediatric emergency departments (PEDs). Reducing unnecessary repetitions can ease child discomfort and alleviate the healthcare burden without compromising the diagnostic process or quality of care. The aim of this study was to develop a decision tree (DT) model to guide physicians in minimizing unnecessary repeat blood tests in PEDs. The minimal decision tree (MDT) algorithm was selected for its interpretability and capacity to generate optimally pruned classification trees. Methods: Children aged 3 months to 18 years with community-based complete blood count (CBC), electrolyte (ELE), and C-reactive protein (CRP) measurements obtained between 2016 and 2023 were included. Repeat tests performed in the pediatric emergency department within 12 h were evaluated by comparing paired measurements, with tests considered justified when values transitioned from normal to abnormal ranges or changed by ≥20%. Additionally, sensitivity analyses were conducted for absolute change thresholds of 10% and 30% and for repeat intervals of 6, 18, and 24 h. Results: Among 7813 children visits in this study, 6044, 1941, and 2771 underwent repeated CBC, ELE, and CRP tests, respectively. The mean ages of patients undergoing CRP, ELE, and CBC testing were 6.33 ± 5.38, 7.91 ± 5.71, and 5.08 ± 5.28 years, respectively. The majority were of middle socio-economic class, with 66.61–71.24% living in urban areas. Pain was the predominant presented complaint (83.69–85.99%), and in most cases (83.69–85.99%), the examination was conducted by a pediatrician. The DT model was developed and evaluated on training and validation cohorts, and it demonstrated high accuracy in predicting the need for repeat CBC and ELE tests but not CRP. Performance of the DT model significantly exceeded that of the logistic regression model. Conclusions: The data-driven guide derived from the DT model provides clinicians with a practical, interpretable tool to minimize unnecessary repeat laboratory testing, thereby enhancing patient care and optimizing healthcare resource utilization.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/repeat_test.pdf"},
					  {"info": "cite", "type": 3, "link": "Shuchami, A., Lazebnik, T., Ashkenazi, S., Herman Cohen, A., Reichenberg, Y., Shkalim Zemer, V., A Machine Learning-Based Guide for Repeated Laboratory Testing in Pediatric Emergency Departments. Diagnostics. 2025."}],
		 "authors": "Adi Shuchami, Teddy Lazebnik, Shai Ashkenazi, Avner Herman Cohen, Yael Reichenberg, Vered Shkalim Zemer",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Diagnostics",
         "publicationStatus":"Published"
      },
	{
         "name":"Fire weather indices tailored to regional patterns outperform global models",
         "description":"Fire weather indices (FWIs) are widely used to assess wildfire risk, but are typically designed for specific regions and not adapted globally. Here, we present a systematic effort to generate country-specific FWIs that capture regional fire-weather patterns. We evaluate three widely used indices across countries, finding that the Canadian FWI performs best overall (ROC AUC of 0.69). Tailoring the index to each country with a Genetic Algorithm significantly improves its accuracy, raising the ROC AUC from 0.69 to 0.79. To further improve accuracy while maintaining interpretability, we develop a single Decision Tree model per country, achieving an ROC AUC of 0.86. Attempts to develop a single global Decision Tree yielded substantially lower accuracy, highlighting the limitations of universal models and the importance of capturing regional characteristics such as weather patterns, vegetation types, and topography for accurately predicting wildfire risk. Adapting FWIs regionally is crucial under accelerating climate change conditions.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/fires_global.pdf"},
					  {"info": "cite", "type": 3, "link": "Shmuel, A., Lazebnik, T., Heifetz, E., Glickman, O., Price, C., Fire weather indices tailored to regional patterns outperform global models. npj natural hazards. 2025."}],
		 "authors": "Assaf Shmuel, Teddy Lazebnik, Eyal Heifetz, Oren Glickman, Colin Price",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"NPJ natural hazards",
         "publicationStatus":"Published"
      },
	{
         "name":"Interpretable transformation and analysis of timelines through learning via surprisability",
         "description":"The analysis of high-dimensional timeline data and the identification of outliers and anomalies are critical across diverse domains, including sensor readings, biological and medical data, historical records, and global statistics. However, conventional analysis techniques often struggle with challenges such as high dimensionality, complex distributions, and sparsity. These limitations hinder the ability to extract meaningful insights from complex temporal datasets, making it difficult to identify trending features, outliers, and anomalies effectively. Inspired by surprisability—a cognitive science concept describing how humans instinctively focus on unexpected deviations—we propose Learning via Surprisability (LvS), a novel approach for transforming high-dimensional timeline data. LvS quantifies and prioritizes anomalies in time-series data by formalizing deviations from the expected behavior. LvS bridges cognitive theories of attention with computational methods, enabling the detection of anomalies and shifts in a way that preserves critical context, offering a new lens for interpreting complex datasets. We demonstrate the usefulness of LvS on three high-dimensional timeline use cases: a time series of sensor data, a global dataset of mortality causes over multiple years, and a textual corpus containing over two centuries of the State of the Union Addresses by U.S. presidents. Our results show that LvS transformation enables efficient and interpretable identification of outliers, anomalies, and the most variable features along the timeline.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/lvs.pdf"},
					  {"info": "cite", "type": 3, "link": "Mokryn, O., Lazebnik, T., Ben-Shoshan, H., Interpretable transformation and analysis of timelines through learning via surprisability. Choas. 2025."}],
		 "authors": "Osnat Mokryn, Teddy Lazebnik, Hagit Ben-Shoshan",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Choas",
         "publicationStatus":"Published"
      },
	{
         "name":"Publishing instincts: An exploration-exploitation framework for studying academic publishing behavior and 'Home Venues'",
         "description":"Scholarly communication is vital to scientific advancement, enabling the exchange of ideas and knowledge. When selecting publication venues, scholars consider various factors, such as journal relevance, reputation, outreach, and editorial standards and practices. However, some of these factors are inconspicuous or inconsistent across venues and individual publications. This study proposes that scholars' decision-making process can be conceptualized and explored through the biologically inspired exploration-exploitation (EE) framework, which posits that scholars balance between familiar and under-explored publication venues. Building on the EE framework, we introduce a grounded definition for “Home Venues” (HVs) – an informal concept used to describe the set of venues where a scholar consistently publishes – and investigate their emergence and key characteristics. Our analysis reveals that the publication patterns of roughly three-quarters of computer science scholars align with the expectations of the EE framework. For these scholars, HVs typically emerge and stabilize after approximately 15-20 publications. Additionally, scholars with higher h-indexes, greater number of publications, or higher academic age tend to have higher-ranking journals as their HVs.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/publishing_instincts.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Aviv-Reuven, S., Rosenfeld, A., Publishing instincts: An exploration-exploitation framework for studying academic publishing behavior and 'Home Venues'. Journal of Informetrics. 2025."}],
		 "authors": "Teddy Lazebnik, Aviv-Reuven, Ariel Rosenfeld",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Journal of Informetrics",
         "publicationStatus":"Published"
      },
	{
         "name":"Trust and street-level bureaucrats’ readiness for emergencies",
         "description":"Is street-level bureaucrats’ (SLBs) trust in their organisation, managers, and peers related to their perceptions of the emergency readiness of their organisation? Using a national survey among a representative sample of 2,733 police officers in Brazil, we found a significant correlation between SLBs’ perceptions regarding their organisations’ readiness for emergencies and their trust in their peers, managers, and the institutions to which they belong. Our findings, therefore, highlight the important role of trust in SLBs’ perceptions of readiness for emergencies. We show that, while there is a linear correlation between the two factors, a non-linear correlation provides a better explanation of the connection, revealing a complex sociological dynamic between trust and perceptions of readiness. We also discuss the implications of our findings and suggest an agenda for future research.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/lvs.pdf"},
					  {"info": "cite", "type": 3, "link": "Cohen, N., Davidovitz, M., Lotta, G., Lazebnik, T., Trust and street-level bureaucrats’ readiness for emergencies. International Public Management Journal. 2025."}],
		 "authors": "Nissim Cohen, Maayan Davidovitz, Gabriela Lotta, Teddy Lazebnik",
         "year": 2025,
         "topic":"socio-economic",
         "type":"Paper",
         "publisher":"International Public Management Journal",
         "publicationStatus":"Published"
      },
	{
         "name":"A blood test-based machine learning model for predicting lung cancer risk",
         "description":"Background: The goal of early detection is individual cancer prediction. For lung cancer (LC), age and smoking history are the primary criteria for annual low-dose CT screening, leaving other populations at risk of being overlooked. Machine learning (ML) is a promising method to identify complex patterns in the data that can reveal personalized disease predictors. Methods: An ML-based model was used on blood test data collected before the diagnosis of LC, and sociodemographic factors such as age and gender among LC patients and controls were incorporated to predict the risk for future LC diagnosis. Results: In addition to age and gender, we identified 22 blood tests that contributed to the model. For the entire study population, the ML model predicted LC with an accuracy of 71.2%, a sensitivity of 63%, and a positive predictive value of 67.2%. Higher accuracy was found among women than men (71.8 vs. 70.8) and among never smokers than smokers (73.6 vs. 70.1%). Age was the most significant contributor (13.6%), followed by red blood cell distribution (5.1%), creatinine (5%), gender (3.6%), and mean corpuscular hemoglobin (3.3%). A majority of the blood tests made a highly variable contribution to the complex ML model; however, some tests, such as red cell distribution width, mean corpuscular hemoglobin, prothrombin time, hematocrit, urea, and calcium, contributed slightly more to a dichotomous prediction. Conclusion: Blood tests can be used in the proposed ML model to predict LC. More studies are needed in basic science fields to identify possible explanations between specific blood results and LC prediction.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/lung_cancer_2.pdf"},
					  {"info": "cite", "type": 3, "link": "Schwartz, L., Matania, N., Levi, M., Lazebnik, T., Kushnir, S., Yosef, N., Hoogi, A., Shlomi, D., A blood test-based machine learning model for predicting lung cancer risk. Frontiers in Medicine. 2025."}],
		 "authors": "Lihi Schwartz, Naor Matania, Matanel Levi, Teddy Lazebnik, Shiri Kushnir, Noga Yosef, Assaf Hoogi, Dekel Shlomi",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Frontiers in Medicine",
         "publicationStatus":"Published"
      },
	{
         "name":"The Academic Midas Touch: A citation-based indicator of research excellence",
         "description":"Purpose: This paper introduces a novel perspective on academic excellence, focusing on a researcher’s consistent ability to produce highly-cited publications, and demonstrates its utility in distinguishing high- achieving scientists compared to traditional scientometric indicators. Design/methodology/approach: We formulate this new perspective using a simple yet effective indicator termed the 'Academic Midas Touch' (AMT). We then empirically analyze how AMT aligns with or diverges from popular scientometrics such as the H-index, i10-index, and citation counts. We further evaluate AMT’s effectiveness in identifying award-winning scientists, using these awards as a proxy for recognized academic excellence. Findings: Our empirical analysis reveals that the AMT offers a distinct measure of academic excellence that does not fully correlate with commonly used scientometrics. Furthermore, AMT favorably compares to these traditional metrics in its ability to accurately identify award-winning scientists. Research limitations: The AMT emphasizes short-term citation accumulation, thus it may overlook long-term dynamics such as 'sleeping beauties'. Additionally, mindful parameter tuning and contextual interpretation within a specific discipline or a meaningful cohort of peers are necessary. Finally, the AMT does not seek to fully capture the multidimensional complexities of research excellence such as collaborations, mentoring, and societal impact. Practical implications: The findings suggest that AMT can serve as a valuable complementary tool for evaluating researchers, particularly in contexts such as excellence recognition, award nominations, grant applications, and faculty promotions, providing an under-explored view of a researcher’s consistent ability to produce highly-influential publications. Originality/value: This work introduces a unique conceptualization and measurement of academic excellence, shifting the focus from cumulative impact to the consistent propensity for producing highly-cited publications. The resulting AMT indicator provides a fresh perspective that complements existing scientometrics, offering a more nuanced understanding and recognition of research excellence.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/gold_touch.pdf"},
					  {"info": "cite", "type": 3, "link": "Rosenfeld, A., Alexi, A., Mushiev, L., Lazebnik, T., The Academic Midas Touch: A citation-based indicator of research excellence. Journal of Data and Information Science. 2025."}],
		 "authors": "Ariel Rosenfeld, Ariel Alexi, Liel Mushiev, Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Journal of Data and Information Science",
         "publicationStatus":"Published"
      },
	{
         "name":"Evaluating supply chain resilience during pandemic using agent-based simulation",
         "description":"Recent pandemics have highlighted vulnerabilities in our global economic systems, especially supply chains. A possible future pandemic raises a dilemma for business owners between short-term profitability and long-term supply chain resilience preparedness. In this study, we propose a novel agent-based simulation model that integrates epidemiological dynamics using a Susceptible–Exposed–Infected–Recovered–Dead (SEIRD) model, a supply and demand economic model, and a spatial representation of supply chain networks to evaluate supply chain resilience preparedness strategies during pandemics. Using this model, we explore a range of supply chain resilience preparedness strategies under pandemic scenarios using in silico experiments. Our analysis shows that the exact supply chain resilience preparedness strategy is hard to obtain for each firm and is relatively sensitive to the exact profile of the pandemic and economic state at the beginning of the pandemic. As such, we used a machine learning model that uses agent-based simulation to estimate a near-optimal supply chain resilience preparedness strategy for a firm.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/supply_chain_pandemic.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Evaluating supply chain resilience during pandemic using agent-based simulation. Physica A: Statistical Mechanics and its Applications. 2025."}],
		 "authors": "Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine learning",
         "type":"Paper",
         "publisher":"Physica A: Statistical Mechanics and its Applications",
         "publicationStatus":"Published"
      },
	{
         "name":"Spatio-Temporal SIR Model of Pandemic Spread During Warfare with Optimal Dual-use Health Care System Administration using Deep Reinforcement Learning",
         "description":"Objectives: Large-scale crises, including wars and pandemics, have repeatedly shaped human history, and their simultaneous occurrence presents profound challenges to societies. Understanding the dynamics of epidemic spread during warfare is essential for developing effective containment strategies in complex conflict zones. While research has explored epidemic models in various settings, the impact of warfare on epidemic dynamics remains underexplored. Methods: We proposed a novel mathematical model that integrates the epidemiological SIR (susceptible-infected-recovered) model with the war dynamics Lanchester model to explore the dual influence of war and pandemic on a population’s mortality. Moreover, we consider a dual-use military and civil health care system that aims to reduce the overall mortality rate, which can use different administration policies such as prioritizing soldiers over civilians. Using an agent-based simulation to generate in silico data, we trained a deep reinforcement learning model based on the deep Q-network algorithm for health care administration policy and conducted an intensive investigation on its performance.Results: Our results show that a pandemic during war conduces chaotic dynamics where the health care system should either prioritize war-injured soldiers or pandemic-infected civilians based on the immediate amount of mortality from each option, ignoring long-term objectives. Conclusions:  Our findings highlight the importance of integrating conflict-related factors into epidemic modeling to enhance preparedness and response strategies in conflict-affected areas.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/pandemic_war.pdf"},
					  {"info": "cite", "type": 3, "link": "Shuchami, A., Lazebnik, T., Spatio-Temporal SIR Model of Pandemic Spread During Warfare with Optimal Dual-use Health Care System Administration using Deep Reinforcement Learning. Disaster Medicine and Public Health Preparedness. 2025."}],
		 "authors": "Adi Shuchami, Teddy Lazebnik",
         "year": 2025,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Disaster Medicine and Public Health Preparedness",
         "publicationStatus":"Published"
      },
	{
         "name":"How lonely or influential is the Lone Wolf? An analysis of individual scholars’ solo-authorship dynamics",
         "description":"Collaboration has become a defining feature of modern science. Nevertheless, solo-authorship has not disappeared entirely. In this study, we investigate solo-authorship dynamics at the individual scholar level, a perspective often overlooked in favor of publication-level analyses, focusing on the propensity of scholars to solo-publish over their careers and this propensity’s potential relation to their academic influence. Using a dataset of 7238 scholars from Biology, Computer Science, Psychology, and Philosophy, we analyze the temporal solo-authorship patterns through heatmap analysis, time series clustering, and statistical testing. By formally defining and analyzing the notion of the academic “Lone Wolf” - a scholar who persistently solo-publishes at a high rate - we show that a global definition of a Lone Wolf may seem unreasonable. Nevertheless, we identify three characteristic solo-authorship trajectories across the four disciplines that share several commonalities and highly their differences. Our findings do not suggest any significant relation between scholars’ solo- authorship dynamics and their influence metrics.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/wolf_scholar.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Rosenfeld, A., How lonely or influential is the Lone Wolf? An analysis of individual scholars’ solo-authorship dynamics. Scientometrics. 2025."}],
		 "authors": "Teddy Lazebnik, Ariel Rosenfeld",
         "year": 2025,
         "topic":"Scientometrics",
         "type":"Paper",
         "publisher":"Scientometrics",
         "publicationStatus":"Published"
      },
	{
         "name":"Developing a machine learning based prediction model for postinduction hypotension",
         "description":"Arterial hypotension is a common and often unintended event during surgery under general anesthesia, associated with increased postoperative complications, such as kidney injury, myocardial injury, and stroke. Postinduction hypotension (PIH) is influenced by patient-specific factors, chronic medication use, and anesthetic induction regimens. Traditional predictive models struggle with this complexity, making machine learning (ML) a promising alternative due to its ability to handle complex datasets and identify hidden patterns. This study aimed to develop and validate an ML-based model for predicting PIH and identifying key clinical predictors. A retrospective cohort study of 20,309 adult patients undergoing non-obstetric surgery under general anesthesia with intravenous induction was conducted. The primary outcome was the occurrence of PIH, defined as mean arterial pressure (MAP) < 55 mmHg within 10 min post-induction. Data were split into training and validation sets using k-fold cross-validation. The model’s predictive performance was evaluated using the area under the receiver operating characteristic curve (AUC), and feature importance was assessed using SHapley Additive exPlanations (SHAP) values. PIH occurred in 4,948 patients (24.4%). Key predictors included preinduction systolic and mean arterial pressures, propofol dose, and beta-blocker use. The ML model achieved an AUC of 0.732 in predicting PIH. The ML-based model demonstrated significant predictive capability for PIH, identifying key clinical predictors. This model holds the potential for improving preoperative planning and patient risk stratification. However, further validation through prospective studies is necessary to confirm these findings.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/pih.pdf"},
					  {"info": "cite", "type": 3, "link": "Katsin, M., Glebov, M., Berkenstadt, H., Orkin, D., Portnoy, Y., Shuchami, A., Yaniv-Rosenfeld, A., Lazebnik, T.,Developing a machine learning‑based prediction model for postinduction hypotension. Journal of Clinical Monitoring and Computing. 2025."}],
		 "authors": "Maksim Katsin, Maxim Glebov, Haim Berkenstadt, Dina Orkin, Yotam Portnoy, Adi Shuchami, Amit Yaniv-Rosenfeld, Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Journal of Clinical Monitoring and Computing",
         "publicationStatus":"Published"
      },
	{
         "name":"Combinatorics and complexity of chimpanzee (Pan troglodytes) facial signals",
         "description":"There have been shifts toward more systematic and standardized methods for studying non-human primate facial signals, thanks to advancements like animalFACS. Additionally, there have been calls to better integrate the study of both facial and gestural communication in terms of theory and methodology. However, few studies have taken this important integrative step. By doing so, researchers could gain greater insight into how the physical flexibility of facial signals affects social flexibility. Our study combines both approaches to examine the relationship between the flexibility of physical form and the social function of chimpanzee facial 'gestures'. We used chimpFACS along with established gestural ethograms that provide insights into four key gesture properties and their associated variables documented in chimpanzee gestures. We specifically investigated how the combinatorics (i.e., the different combinations of facial muscle movements) and complexity (measured by the number of discrete facial muscle movements) of chimpanzee facial signals varied based on: (1) how many gesture variables they exhibit; (2) the presence of a specific goal; and (3) the context in which they were produced. Our findings indicate that facial signals produced with vocalizations exhibit fewer gesture variables, rarely align with specific goals, and exhibit reduced contextual flexibility. Furthermore, facial signals that include additional visual movements (such as those of the head) and other visual signals (like manual gestures) exhibit more gestural variables, are frequently aligned with specific goals, and exhibit greater contextual flexibility. Finally, we discovered that facial signals become more morphologically complex when they exhibit a greater number of gesture variables. Our findings indicate that facial 'gesturing' significantly enhanced the facial signaling repertoire of chimpanzees, offering insights into the evolution of complex communication systems like human language.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/monkey_ai.pdf"},
					  {"info": "cite", "type": 3, "link": "Florkiewicz, B. N., Lazebnik, T., Combinatorics and complexity of chimpanzee (Pan troglodytes) facial signals. Animal Cognition. 2025."}],
		 "authors": "Brittany N. Florkiewicz and Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Animal Cognition",
         "publicationStatus":"Published"
      },
	{
         "name":"Got much, got nothing: analyzing the impact of increased special interest groups’ influence on utility",
         "description":"This study investigates the economic dynamics associated with interest groups receiving allowances and influencing public policy, particularly focusing on the ultra-Orthodox community in Israel. The research aims to model the socio-economic implications of increasing transfer payments to interest group members who abstain from labor market participation. Using an innovative differential equation model, the study evaluates the long-term impact on utility for both the broader working population and interest group members. Key findings indicate that while increased allowances enhance private consumption for interest group members, they paradoxically reduce the overall provision of public goods due to a decline in working contributors. This depletion negatively impacts utility and eventually diminishes benefits for the interest group members. The model underscores a tipping point where, beyond a critical level of allowance, public good provision and utility are compromised. The study combines theoretical analysis with sensitivity tests to assess the effects of allowance levels, tax burden, utility, and population growth rates. Results demonstrate that sustained increases in allowances can accelerate the transition of working individuals to non-working status, ultimately destabilizing both public good provision and the utility balance across populations.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/got_much_got_nothing.pdf"},
					  {"info": "cite", "type": 3, "link": "Shami, L., Lazebnik, T., Got much, got nothing: analyzing the impact of increased special interest groups’ influence on utility. Eurasian Economic Review. 2025."}],
		 "authors": "Labib Shami and Teddy Lazebnik",
         "year": 2025,
         "topic":"Social",
         "type":"Paper",
         "publisher":"Eurasian Economic Review",
         "publicationStatus":"Published"
      },
	{
         "name":"Pulling the carpet below the learner’s feet: Genetic algorithm to learn ensemble machine learning model during concept drift",
         "description":"Data-driven models, in general, and machine learning (ML) models, in particular, have gained popularity over recent years with an increased usage of such models across the scientific and engineering domains. When using ML models in realistic and dynamic environments, users often need to handle the challenge of concept drift (CD). In this study, we explore the application of genetic algorithms (GAs) to address the challenges posed by CD in such settings. Formally, we propose a novel two-level ensemble ML model, which combines a global ML model with a CD detector, operating as an aggregator for a population of ML pipeline models, each one with an adjusted CD detector by itself responsible for re-training its ML model. In addition, we show that one can further improve the proposed model by utilizing off-the-shelf automatic ML (AutoML) methods. Through extensive synthetic dataset analysis, we show that the proposed model statistically significantly outperforms an ML pipeline with a CD algorithm, particularly in scenarios with unknown CD characteristics or a mixture of moving and shifting CDs. Moreover, we show a sub-linear decline in the proposed method’s performance with respect to a higher drifting rate and robustness to the underlying AutoML method utilized.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/ga_cd.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Pulling the carpet below the learner’s feet: Genetic algorithm to learn ensemble machine learning model during concept drift. Engineering Applications of Artificial Intelligence. 2025."}],
		 "authors": "Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Engineering Applications of Artificial Intelligence",
         "publicationStatus":"Published"
      },
	{
         "name":"A computational model for individual scholars' writing style dynamics",
         "description":"A manuscript’s writing style is central to determining its readership, influence, and impact. Past research has shown that, in many cases, scholars present a unique writing style that is manifested in their manuscripts. In this work, we report a comprehensive investigation into how scholars’ writing styles evolve throughout their careers focusing on their academic relations with their advisors and peers. Our results show that scholars’ writing styles tend to stabilize early on in their careers – roughly around their 13th publication. Around the same time, schol- ars’ departures from their advisors’ writing styles seem to converge as well. Last, collaborations involving fewer scholars, scholars from the same gender, or from the same field of study seem to bring about a great change in their co-authors’ writing styles with younger scholars being especially influenceable. The proposed method can help to investigate the dynamic behavior of academic writing style.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/ws.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., A. Rosenfeld, A computational model for individual scholars' writing style dynamics. Journal of writing research. 2025."}],
		 "authors": "Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Journal of writing research",
         "publicationStatus":"Published"
      },
	{
         "name":"Predicting Social Rankings in Captive Chimpanzees (Pan troglodytes) Through Communicative Interactions-Based Data-Driven Model",
         "description":"Primates demonstrate variability regarding the degree to which they display status hierarchies, which are influenced by a multitude of demographic and ecological factors. Additionally, primates must manage their interactions within these social hierarchies through the use of diverse communicative signals, including facial signals and manual gestures. Often times, these variables are assessed independently; however, it is probable that they collectively influence social rankings among primates. Our study investigates the application and accuracy of data‐driven techniques, based on the genetic algorithm approach, in capturing social rankings among a group of captive chimpanzees, focusing on the analysis of communicative and demographic factors. We utilize observational data collected from a group of 18 chimpanzees residing at the Los Angeles Zoo from 2017 to 2019, derived from three previous studies carried out by the first author (BF). Our data‐driven model exhibited a high degree of accuracy in capturing established social hierarchies in 2017, in addition to identifying notable fluctuations in rankings during periods of social instability from 2018 to 2019, especially in the aftermath of the passing of the highest‐ranking female in the troop. Feature importance analysis revealed that social bond strength, measured via the dyadic composite sociality index (DCSI), was the most significant predictor of rank, highlighting the importance of social bonding in shaping status hierarchies. These models provide valuable insights for future research on primate behavior and social structures, as well as assist in making informed decisions for zoo management.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/FlorkiewiczLazebnik2025.pdf"},
					  {"info": "cite", "type": 3, "link": "Florkiewicz, M., Lazebnik, T., Predicting Social Rankings in Captive Chimpanzees (Pan troglodytes) Through Communicative Interactions-Based Data-Driven Model. Integrative Zoology. 2025."}],
		 "authors": "Brittany Florkiewicz, Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Integrative Zoology",
         "publicationStatus":"Published"
      },
	{
         "name":"Predicting postoperative nausea and vomiting using machine learning: a model development and validation study",
         "description":"Background Postoperative nausea and vomiting (PONV) is a frequently observed complication in patients undergoing surgery under general anesthesia. Moreover, it is a frequent cause of distress and dissatisfaction in the early postoperative period. Currently, the classical scores used for predicting PONV have not yielded satisfactory results. Therefore, prognostic models for the prediction of early and delayed PONV were developed in this study to achieve satisfactory predictive performance. Methods The retrospective data of inpatient adult patients admitted to the post‑anesthesia care unit after undergoing surgical procedures under general anesthesia at the Sheba Medical Center, Israel, between September 1, 2018, and September 1, 2023, were used in this study. An ensemble model of machine‑learning algorithms trained on the data of 35,003 patients was developed. The k‑fold cross‑validation method was used followed by splitting the data to train and test sets that optimally preserve the sociodemographic features of the patients. Results Among the 35,003 patients, early and delayed PONV were observed in 1,340 (3.82%) and 6,582 (18.80%) patients, respectively. The proposed PONV prediction models correctly predicted early and delayed PONV in 83.6% and 74.8% of cases, respectively, outperforming the second‑best PONV prediction score (Koivuranta score) by 13.0% and 10.4%, respectively. Feature importance analysis revealed that the performance of the proposed prediction tools aligned with previous clinical knowledge, indicating their utility. Conclusions The machine learning‑based models developed in this study enabled improved PONV prediction, thereby facilitating personalized care and improved patient outcomes.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/ponv.pdf"},
					  {"info": "cite", "type": 3, "link": "Glebov, M., Lazebnik, T., Katsin, M., Orkin, B., Berkenstadt, H., Bunimovich-Mendrazitsky, S., Predicting postoperative nausea and vomiting using machine learning: a model development and validation study. BMC Anesthesiology. 2025."}],
		 "authors": "Maxim Glebov, Teddy Lazebnik, Maksim Katsin, Boris Orkin, Haim Berkenstadt, Svetlana Bunimovich Mendrazitsky",
         "year": 2025,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"BMC Anesthesiology",
         "publicationStatus":"Published"
      },
	{
         "name":"Global lightning-ignited wildfires prediction and climate change projections based on explainable machine learning models",
         "description":"Wildfires pose a significant natural disaster risk to populations and contribute to accelerated climate change. As wildfires are also affected by climate change, extreme wildfires are becoming increasingly frequent. Although they occur less frequently globally than those sparked by human activities, lightning-ignited wildfires play a substantial role in carbon emissions and account for the majority of burned areas in certain regions. While existing computational models, especially those based on machine learning, aim to predict lightning-ignited wildfires, they are typically tailored to specific regions with unique characteristics, limiting their global applicability. In this study, we present machine learning models designed to characterize and predict lightning-ignited wildfires on a global scale. Our approach involves classifying lightning-ignited versus anthropogenic wildfires, and estimating with high accuracy the probability of lightning to ignite a fire based on a wide spectrum of factors such as meteorological conditions and vegetation. Utilizing these models, we analyze seasonal and spatial trends in lightning-ignited wildfires shedding light on the impact of climate change on this phenomenon. We analyze the influence of various features on the models using eXplainable Artificial Intelligence (XAI) frameworks. Our findings highlight significant global differences between anthropogenic and lightning-ignited wildfires. Moreover, we demonstrate that, even over a short time span of less than a decade, climate changes have steadily increased the global risk of lightning-ignited wildfires. This distinction underscores the imperative need for dedicated predictive models and fire weather indices tailored specifically to each type of wildfire.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/s41598-025-92171-w.pdf"},
					  {"info": "cite", "type": 3, "link": "A. Shmuel, T. Lazebnik, O. Glickman, E. Heifetz, C. Price, Global lightning-ignited wildfires prediction and climate change projections based on explainable machine learning models. Scientific Reports. 2025."}],
		 "authors": "Assaf Shmuel, Teddy Lazebnik, Oren Glickman, Eyal Heifetz, Colin Price ",
         "year": 2025,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Scientific Reports",
         "publicationStatus":"Published"
      },
	{
         "name":"Spatio-temporal model of combining ADT and chemotherapy with senolytic treatment in metastatic prostate cancer",
         "description":"Prostate cancer cells depend on androgen for their survival. A standard treatment of metastatic prostate cancer (mPC) is androgen deprivation treatment (ADT). However, after a period of remission, some cancer cells changed into androgen-independent cells, and then treatment proceeds with a combination of ADT and chemotherapy. Senescent cells are cells that stop dividing but sustain viability. Senescence cancer cells are common in cancer, and they affect cancer treatment negatively by secreting inflammatory cytokines and pro-cancer VEGF. In this paper, we include the effect of senescence in a model of mPC. We consider combinations of ADT, chemotherapy, and senolytic drug, which eliminate senescent cells, in a spatio-temporal partial differential equations model, and demonstrate that simulations of the model are in agreement with experimental results. We evaluate the synergy between different doses of chemotherapy and senolytic drugs, at different fixed doses of ADT. We also consider optimal scheduling of the drugs, and the hypothesis that, in optimal schedule, a senolytic drug is to be administered immediately following the chemotherapy drug.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/avner_2.pdf"},
					  {"info": "cite", "type": 3, "link": "T. Lazebnik, A. Friedman, Spatio-temporal model of combining ADT and chemotherapy with senolytic treatment in metastatic prostate cancer. Journal of Theoretical Biology. 2025."}],
		 "authors": "Teddy Lazebnik, Avner Friedman",
         "year": 2025,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Journal of Theoretical Biology",
         "publicationStatus":"Published"
      },
	{
         "name":"Novel Objective Tool to Assess Tremor Reveals Unilateral Focused Ultrasound Improves Tremor Bilaterally",
         "description":"Tremor in essential tremor and in tremor-dominant Parkinson’s disease is assessed by subjective observations in patients undergoing focused ultrasound thalamotomy, a minimally invasive procedure intended to alleviate tremor in these patients. To develop an objective tool for tremor analysis to be used before and after focused ultrasound thalamotomy treatment in the treated hand (contralateral to ablation) and non-treated (ipsilateral to ablation). Using image processing and signal processing that utilized images of a Archimedes spiral drawing, we created a tool to analyze tremor. First, we showed that the proposed tool reproduces known clinical dynamics on the treated hand, and then we used it to evaluate the clinical dynamics on the non-treated hand. Using the tool we developed, we were able to demonstrate a significant reduction in tremor following focused ultrasound thalamotomy among 132 essential tremor and 26 tremor-dominant Parkinson’s disease patients in the treated hand using drawings of Archimedes spirals up to 1 year following the procedure. Thus, we reproduced known clinical data and therefore validated the proposed tool. In addition, we were able to demonstrate a significant improvement in the non-treated hand as well as a significant deterioration in the efficacy of focused ultrasound thalamotomy over time. Our objective method, which incorporated image processing and signal processing, provided a quantitative measure of tremor reduction following focused ultrasound thalamotomy. It demonstrated significant improvement in tremors in the treated and non-treated hands following focused ultrasound thalamotomy as well as deterioration in the efficacy of treatment over time. If replicated in other studies, this method may complement current subjective assessments.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/rambam_neurology.pdf"},
					  {"info": "cite", "type": 3, "link": "V. Aharonson, T. Lazebnik, A. Sinai, M. Nassar, I. Senderova, M. Constantinescu, L. Lev Tov, I. Schlesinger, Novel Objective Tool to Assess Tremor Reveals Unilateral Focused Ultrasound Improves Tremor Bilaterally. Neurology and Therapy . 2025."}],
		 "authors": "Vered Aharonson, Teddy Lazebnik, Alon Sinai, Maria Nassar, Inna Senderova, Marius Constantinescu, Lior Lev Tov, Ilana Schlesinger",
         "year": 2025,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Neurology and Therapy",
         "publicationStatus":"Published"
      },
	{
         "name":"Spatio-Temporal Model of Combining Chemotherapy with Senolytic Treatment in Lung Cancer",
         "description":"Senescent cells are cells that stop dividing but sustain viability. Cellular senescence is the hallmark of aging, but senescence also appears in cancer, triggered by cells stress, tumor suppression of gene activation, and oncogene activity. In lung cancer, senescent cancer cells secrete VEGF, which initiates a process of angiogenesis, enabling the cancer to grow and proliferate. Chemotherapy kills cancer cells, but some cancer cells become senescent. Hence, a senolytic drug, a drug that eliminates senescent cells, should significantly improve the efficacy of chemotherapy. In this paper, we developed a mathematical spatio-temporal model of combination chemotherapy with senolytic drug in treatment of lung cancer. Model’s simulations of tumor volume growth are shown to agree with mouse experiments in the case where cyclophosphamide is combined with the senolytic drug fisetin. It is then shown how the model can be used to assess the benefits of treatments with different combinations and different schedules of the two drugs in order to achieve optimal tumor volume reduction.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/avner_1.pdf"},
					  {"info": "cite", "type": 3, "link": "T. Lazebnik, A. Friedman, Spatio-Temporal Model of Combining Chemotherapy with Senolytic Treatment in Lung Cancer. Mathematical Biosciences. 2025."}],
		 "authors": "Teddy Lazebnik, Avner Friedman",
         "year": 2025,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Mathematical Biosciences",
         "publicationStatus":"Published"
      }, 
	{
         "name":"Machine and deep learning performance in out-of-distribution regressions",
         "description":"Machine learning (ML) and deep learning (DL) models are gaining popularity due to their effectiveness in many computational tasks. These models are based on an intuitive, but frequently unsatisfied, assumption that the data used to train these models is well-representing the task at hand. This gives rise to the out-of-distribution (OOD) challenge which can cause an unexpected drop in the data-driven model's performance. In this study, we evaluate the performance of various ML and DL models in in-distribution (ID) versus OOD prediction. While the degradation in OOD performance is well acknowledged, to the best of our knowledge, this is one of the first studies to quantify it for various models on a large benchmark n = 15 real-world regression datasets. We extensively (runs) compare the ID versus OOD performance of XGBoost, random forest, K-nearest-neighbors, support vector machine, and linear regression models, as well as AutoML models (Tree-based Pipeline Optimization Tool and AutoKeras). In addition, to tackle this challenge, we propose to integrate a symbolic regression (SR) as a feature engineering method model with an ML or DL model to improve its performance for OOD samples. Our results show that the incorporation of SR-derived features significantly enhances the predictive capabilities of both ML and DL models with 3.70% and 10.20%, on average, of the OOD samples, respectively, without reducing ID performance and in fact improving it to a slightly lower extent. As such, this method can help produce more generalized and robust data-driven models.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/Shmuel_2024_Mach._Learn.__Sci._Technol._5_045078.pdf"},
					  {"info": "cite", "type": 3, "link": "A. Shmuel, O. Glickman, T. Lazebnik, Machine and deep learning performance in out-of-distribution regressions. Machine Learning: Science and Technology. 2025."}],
		 "authors": "Assaf Shmuel, Oren Glickman, Teddy Lazebnik",
         "year": 2025,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Machine Learning: Science and Technology",
         "publicationStatus":"Published"
      }, 
	{
         "name":"Automated landmark-based cat facial analysis and its applications",
         "description":"Facial landmarks, widely studied in human affective computing, are beginning to gain interest in the animal domain. Specifically, landmark-based geometric morphometric methods have been used to objectively assess facial expressions in cats, focusing on pain recognition and the impact of breed-specific morphology on facial signaling. These methods employed a 48-landmark scheme grounded in cat facial anatomy. Manually annotating these landmarks, however, is a labor-intensive process, deeming it impractical for generating sufficiently large amounts of data for machine learning purposes and for use in applied real-time contexts with cats. Our previous work introduced an AI pipeline for automated landmark detection, which showed good performance in standard machine learning metrics. Nonetheless, the effectiveness of fully automated, end-to-end landmark-based systems for practical cat facial analysis tasks remained underexplored. In this paper we develop AI pipelines for three benchmark tasks using two previously collected datasets of cat faces. The tasks include automated cat breed recognition, cephalic type recognition and pain recognition. Our fully automated end-to-end pipelines reached accuracy of 75% and 66% in cephalic type and pain recognition respectively, suggesting that landmark-based approaches hold promise for automated pain assessment and morphological explorations.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/cat_landmark.pdf"},
					  {"info": "cite", "type": 3, "link": "G. Martvel, T. Lazebnik, M. eighelstein, S. Meller, I. Shimshoni, L. Finka, S. P. L. Luna, D. M. Mills, H. A. Volk, A. Zamansky, Automated landmark-based cat facial analysis and its applications. Frontiers in Veterinary Science. 2025."}],
		 "authors": "George Martvel, Teddy Lazebnik, Marcelo Feighelstein, Sebastian Meller, Ilan Shimshoni, Lauren Finka, Stelio P. L. Luna, Daniel S. Mills, Holger A. Volk, Anna Zamansky",
         "year": 2024,
         "topic":"AI",
         "type":"Paper",
         "publisher":"Frontiers in Veterinary Science",
         "publicationStatus":"Published"
      }, 
	{
         "name":"AI for Feline Faces: A Computational Investigation of the Social Function of Domestic Cat Facial Signals",
         "description":"There is growing interest in the facial signals of domestic cats. Domestication may have shifted feline social dynamics towards a greater emphasis on facial signals that promote affiliative bonding. Most studies have focused on cat facial signals during human interactions or in response to pain. Research on intraspecific facial communication in cats has predominantly examined non-affiliative social interactions. A recent study by Scott and Florkiewicz1 demonstrated significant differences between cats’ facial signals during affiliative and non-affiliative intraspecific interactions. This follow-up study applies computational approaches to make two main contributions. First, we develop a machine learning classifier for affiliative/non-affiliative interactions based on manual CatFACS codings and automatically detected facial landmarks, reaching above 77% in CatFACS codings and 68% in landmarks by integrating a temporal dimension. Secondly, we introduce novel measures for rapid facial mimicry based on CatFACS coding. Our analysis suggests that domestic cats exhibit more rapid facial mimicry in affiliative contexts than non-affiliative ones, which is consistent with the proposed function of mimicry. Moreover, we found that ear movements (such as EAD103 and EAD104) are highly prone to rapid facial mimicry. Our research introduces new possibilities for analyzing cat facial signals and exploring shared moods with innovative AI-based approaches.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/cats_mimicry.pdf"},
					  {"info": "cite", "type": 3, "link": "G. Martvel, L. Scott, B. Florkiewicz, A. Zamansky, I. Shimshoni, T. Lazebnik, AI for Feline Faces: A Computational Investigation of the Social Function of Domestic Cat Facial Signals. Scientific Reports. 2024."}],
		 "authors": "George Martvel, Lauren Scott, Brittany Florkiewicz, Anna Zamansky, Ilan Shimshoni, Teddy Lazebnik ",
         "year": 2024,
         "topic":"AI",
         "type":"Paper",
         "publisher":"Scientific Reports",
         "publicationStatus":"Published"
      }, 
	{
         "name":"Individual Variation Affects Outbreak Magnitude and Predictability in Multi-Pathogen Model of Pigeons Vising Dairy Farms",
         "description":"Zoonotic disease transmission between animals and humans is a growing risk, and the agricultural context acts as a likely point of transition, with an important role of individual heterogeneity. Livestock often occurs at high local densities, facilitating spread within sites (e.g. among cows in a dairy farm), while wildlife is often more mobile, potentially connecting spatially isolated sites. Thus, understanding the dynamics of disease spread in the wildlife-livestock interface is crucial for mitigating these risks of transmission. Specifically, the interactions between pigeons (Columba livia, also known as ‘rock doves’) and in-door cows at dairy farms can lead to significant disease transmission and economic losses for farmers; putting livestock, adjacent human populations, and other wildlife species at risk. In this paper, we propose a novel spatio-temporal multi-pathogen model with continuous spatial movement. The model expands on the SEIRD framework and accounts for both within-species and cross-species transmission of pathogens, as well as the exploration–exploitation movement dynamics of pigeons, which play a critical role in the spread of infectious agents. In addition to model formulation, we also implement it as an agent-based simulation approach and use empirical field data to investigate different biologically realistic scenarios, evaluating the effect of various parameters on the epidemic spread. Namely, in agreement with theoretical expectations, the model predicts that the heterogeneity of the movement dynamics of pigeons (on top and beyond the obvious effect of an increase of mean level movement itself) can drastically affect both the magnitude and stability of outbreaks. In addition, joint infection by multiple pathogens can have an interactive effect, reflecting a non-intuitive inhibition of the outbreak compared to predictions from single-pathogen SIR models. Our findings highlight the impact of heterogeneity in host behavior on their pathogens and allow realistic predictions of outbreak dynamics in the multi-pathogen wildlife-livestock interface with consequences to zoonotic diseases in various systems.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/cows.pdf"},
					  {"info": "cite", "type": 3, "link": "L. Lazebnik, O. Speigel, Individual Variation Affects Outbreak Magnitude and Predictability in Multi-Pathogen Model of Pigeons Vising Dairy Farms. Ecological modeling. 2024."}],
		 "authors": "Teddy Lazebnik, Orr Spigel",
         "year": 2024,
         "topic":"AI",
         "type":"Paper",
         "publisher":"Ecological modeling",
         "publicationStatus":"Published"
      }, 
	{
         "name":"Automated Video-Based Pain Recognition in Cats using Facial Landmarks",
         "description":"Affective states are reflected in the facial expressions of all mammals. Facial behaviors linked to pain have attracted most of the attention so far in non-human animals, leading to the development of numerous instruments for evaluating pain through facial expressions for various animal species. Nevertheless, manual facial expression analysis is susceptible to subjectivity and bias, is labor-intensive and often necessitates specialized expertise and training. This challenge has spurred a growing body of research into automated pain recognition, which has been explored for multiple species, including cats. In our previous studies, we have presented and studied artificial intelligence (AI) pipelines for automated pain recognition in cats using 48 facial landmarks grounded in cats’ facial musculature, as well as an automated detector of these landmarks. However, so far automated recognition of pain in cats used solely static information obtained from hand-picked single images of good quality. This study takes a significant step forward in fully automated pain detection applications by presenting an end-to-end AI pipeline that requires no manual efforts in the selection of suitable images or their landmark annotation. By working with video rather than still images, this new pipeline approach also optimises the temporal dimension of visual information capture in a way that is not practical to preform manually. The presented pipeline reaches over 70% and 66% accuracy respectively in two different cat pain datasets, outperforming previous automated landmark-based approaches using single frames under similar conditions, indicating that dynamics matter in cat pain recognition. We further define metrics for measuring different dimensions of deficiencies in datasets with animal pain faces, and investigate their impact on the performance of the presented pain recognition AI pipeline.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/cats_pain.pdf"},
					  {"info": "cite", "type": 3, "link": "G. Martvel, T. Lazebnik, M. Feighelstein, L. Henze, S. Meller, I. Shimshoni, F. Twele, A. Sch¨utter, N. Dorn, S. Kastner, L. Finka, S. P. L. Luna, D. S. Mills, H. A. Volk, A. Zamansky, A, Automated Video-Based Pain Recognition in Cats using Facial Landmarks. Scientific Reports. 2024."}],
		 "authors": "George Martvel, Teddy Lazebnik, Marcelo Feighelstein, Lea Henze, Sebastian Meller, Ilan Shimshoni, Friederike Twele, Alexandra Schütter, Nora Foraita, Sabine Kästner, Lauren Finka, Stelio P. L. Luna, Daniel S. Mills, Holger A. Volk, Anna Zamansky",
         "year": 2024,
         "topic":"AI",
         "type":"Paper",
         "publisher":"Scientific Reports",
         "publicationStatus":"Published"
      }, 
	{
         "name":"Economical–epidemiological analysis of the coffee trees rust pandemic",
         "description":"Coffee leaf rust is a prevalent botanical disease that causes a worldwide reduction in coffee supply and its quality, leading to immense economic losses. While several pandemic intervention policies (PIPs) for tackling this rust pandemic are commercially available, they seem to provide only partial epidemiological relief for farmers. In this work, we develop a high-resolution spatiotemporal economical–epidemiological model, extending the Susceptible-Infected-Removed model, that captures the rust pandemic’s spread in coffee tree farms and its associated economic impact. Through extensive simulations for the case of Colombia, a country that consists mostly of small-size coffee farms and is the second-largest coffee producer in the world, our results show that it is economically impractical to sustain any profit without directly tackling the rust pandemic. Furthermore, even in the hypothetical case where farmers perfectly know their farm’s epidemiological state and the weather in advance, any rust pandemic-related efforts can only amount to a limited profit of roughly 4% on investment. In the more realistic case, any rust pandemic-related efforts are expected to result in economic losses, indicating that major disturbances in the coffee market are anticipated.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/coffee_eco_paper.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Rosenfeld, A., Labib, S., Economical–epidemiological analysis of the coffee trees rust pandemic. Chaos. 2024."}],
		 "authors": "Teddy Lazebnik",
         "year": 2024,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Choas",
         "publicationStatus":"Published"
      }, 
	{
         "name":"Mathematical model of dating apps’ influence on sexually transmitted diseases spread",
         "description":"Sexually transmitted diseases (STDs) are a group of pathogens infecting new hosts through sexual interactions. Due to its social and economic burden, multiple models have been proposed to study the spreading of pathogens. In parallel, in the ever-evolving landscape of digital social interactions, the pervasive utilization of dating apps has become a prominent facet of modern society. Despite the surge in popularity and the profound impact on relationship formation, a crucial gap in the literature persists regarding the potential ramifications of dating apps usage on the dynamics of STDs. In this paper, we address this gap by presenting a novel mathematical framework - an extended Susceptible-Infected-Susceptible (SIS) epidemiological model to elucidate the intricate interplay between dating apps engagement and the propagation of STDs. Namely, as dating apps are designed to make users revisit them and have mainly casual sexual interactions with other users, they increase the number of causal partners, which increases the overall spread of STDS. Using extensive simulation, based on real-world data, explore the effect of dating apps adoption and control on the STD spread. We show that an increased adoption of dating apps can result in an STD outbreak if not handled appropriately.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/std_pandemic_model.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Mathematical model of dating apps’ influence on sexually transmitted diseases spread. Social Network Analysis and Mining. 2024."}],
		 "authors": "Teddy Lazebnik",
         "year": 2024,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Social Network Analysis and Mining",
         "publicationStatus":"Published"
      }, 
	{
         "name":"Temporal graphs anomaly emergence detection: benchmarking for social media interactions",
         "description":"Temporal graphs have become an essential tool for analyzing complex dynamic systems with multiple agents. Detecting anomalies in temporal graphs is crucial for various applications, including identifying emerging trends, monitoring network security, understanding social dynamics, tracking disease outbreaks, and understanding financial dynamics. In this paper, we present a comprehensive benchmarking study that compares 12 data-driven methods for anomaly detection in temporal graphs. We conduct experiments on two temporal graphs extracted from Twitter and Facebook, aiming to identify anomalies in group interactions. Surprisingly, our study reveals an unclear pattern regarding the best method for such tasks, highlighting the complexity and challenges involved in anomaly emergence detection in large and dynamic systems. The results underscore the need for further research and innovative approaches to effectively detect emerging anomalies in dynamic systems represented as temporal graphs.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/spatiotemporal_graphs.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Iny, O., Temporal graphs anomaly emergence detection: benchmarking for social media interactions. Applied Intelligence. 2024."}],
		 "authors": "Teddy Lazebnik, Or Iny",
         "year": 2024,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Applied Intelligence",
         "publicationStatus":"Published"
      },
	{
         "name":"Machine learning computational model to predict lung cancer using electronic medical records",
         "description":"Background: Lung cancer (LC) screening using low-dose computed tomography (CT) is recommended according to standard risk criteria or personalized risk calculators. Machine learning (ML) models that can predict disease risk are an emerging method in medicine for identifying hidden associations that are personally unique. Materials and methods: Using the tree-based pipeline optimization tool (TPOT), we developed an ML-based model, which is an ensemble of the Random Forest and XGboost models, based on known risk factors for LC, as part of a larger trial for ML prediction using electronic medical records and chest CT. We used data from patients with LC vs. controls (1:2) of patients aged ≥ 35 years. We developed a model for all LC patients as well as for patients with and without a smoking background. We included age, gender, body mass index (BMI), smoking history, socioeconomic status (SES), history of chronic obstructive pulmonary disease (COPD)/emphysema/chronic bronchitis (CB), interstitial lung disease (ILD)/pulmonary fibrosis (PF), and family history of LC. Results: Of the 4076 patients, 1428 (35 %) were in the LC group and 2648 (65 %) were in the control group. For the entire study population, our model achieved an accuracy of 71.2 %, with a sensitivity of 69 % and a positive predictive value (PPV) of 74 %. Higher accuracy was achieved for the two subgroups. An accuracy of 74.8 % (sensitivity 72 %, PPV 76 %) and 73.0 % (sensitivity 76 %, PPV 72 %) was achieved for the smoking and never-smoking cohorts, respectively. For the entire population and smoker cohort, COPD/emphysema/CB were the most important contributors, followed by BMI and age, while in the never-smoking cohort, BMI, age and SES were the most important contributors. Conclusion: Known risk factors for LC could be used in ML models to modestly predict LC. Further studies are needed to confirm these results in new patients and to improve them.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/lung_ml_1.pdf"},
					  {"info": "cite", "type": 3, "link": "Levi, M., Lazebnik, T., Kushnir, S., Yosef, N., Shlomi, D., Machine learning computational model to predict lung cancer using electronic medical records. Cancer Epidemiology. 2024."}],
		 "authors": "Matanel Levi, Teddy Lazebnik, Shiri Kushnir, Noga Yosef, Dekel Shlomi",
         "year": 2024,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Cancer Epidemiology",
         "publicationStatus":"Published"
      },
	{
         "name":"Exploration-Exploitation Model of Moth-Inspired Olfactory Navigation",
         "description":"Navigation of male moths toward females during the mating search offers a unique perspective on the exploration-exploitation (EE) model in decision-making. This study uses the EE model to explain male moth pheromone-driven flight paths. Wind tunnel measurements and 3D tracking using infrared cameras have been leveraged to gain insights into male moth behavior. During the experiments in the wind tunnel, disturbance to the airflow has been added and the effect of increased fluctuations on moth flights has been analyzed, in the context of the proposed EE model. The exploration and exploitation phases are separated using a genetic algorithm to the experimentally-obtained dataset of moth 3D trajectories. First, the exploration-to-exploitation rate (EER) increases with distance from the source of the female pheromone is demonstrated, which can be explained in the context of the EE model. Furthermore, our findings reveal a compelling relationship between EER and increased flow fluctuations near the pheromone source. Using an olfactory navigation simulation and our moth-inspired navigation model, the phenomenon where male moths exhibit an enhanced EER as turbulence levels increase is explained. This research extends our understanding of optimal navigation strategies based on general biological EE models and supports the development of bio-inspired navigation algorithms.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/mooth.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Golov, Y., Gurka, R., Harari, A., Liberzon, A., Exploration-Exploitation Model of Moth-Inspired Olfactory Navigation. Royal Society Interface. 2024."}],
		 "authors": "Teddy Lazebnik, Yiftach Golov, Roi Gurka, Ally Harari, Alex Liberzon",
         "year": 2024,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Royal Society Interface",
         "publicationStatus":"Published"
      },
	{
         "name":"Detecting LLM-assisted writing in scientific communication: Are we there yet?",
         "description":"Large Language Models (LLMs), exemplified by ChatGPT, have significantly reshaped text generation, particularly in the realm of writing assistance. While ethical considerations underscore the importance of transparently acknowledging LLM use, especially in scientific communication, genuine acknowledgment remains infrequent. A potential avenue to encourage accurate acknowledging of LLM-assisted writing involves employing automated detectors. Our evaluation of four cutting-edge LLM-generated text detectors reveals their suboptimal performance compared to a simple ad-hoc detector designed to identify abrupt writing style changes around the time of LLM proliferation. We contend that the development of specialized detectors exclusively dedicated to LLM-assisted writing detection is necessary. Such detectors could play a crucial role in fostering more authentic recognition of LLM involvement in scientific communication, addressing the current challenges in acknowledgment practices.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/llm_1.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Rosenfeld, A., Detecting LLM-assisted writing in scientific communication: Are we there yet?. Journal of Data and Information Science. 2024."}],
		 "authors": "Teddy Lazebnik, Ariel Rosenfeld",
         "year": 2024,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Journal of Data and Information Science",
         "publicationStatus":"Published"
      },
	{
         "name":"Predicting lung cancer's metastats' locations using bioclinical model",
         "description":"Background: Lung cancer is a global leading cause of cancer-related deaths, and metastasis profoundly influences treatment outcomes. The limitations of conventional imaging in detecting small metastases highlight the crucial need for advanced diagnostic approaches. Methods: This study developed a bioclinical model using three-dimensional CT scans to predict the spatial spread of lung cancer metastasis. Utilizing a three-layer biological model, we identified regions with a high probability of metastasis colonization and validated the model on real-world data from 10 patients. Findings: The validated bioclinical model demonstrated a promising 74% accuracy in predicting metastasis locations, showcasing the potential of integrating biophysical and machine learning models. These findings underscore the significance of a more comprehensive approach to lung cancer diagnosis and treatment. Interpretation: This study's integration of biophysical and machine learning models contributes to advancing lung cancer diagnosis and treatment, providing nuanced insights for informed decision-making.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/lung_cancer_location.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bunimovich-Mendrazitsky, S., Predicting lung cancer's metastats' locations using bioclinical model. Frontiers in Medicine. 2024."}],
		 "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky",
         "year": 2024,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Frontiers in Medicine",
         "publicationStatus":"Published"
      },
	{
         "name":"Symbolic regression as a feature engineering method for machine and deep learning regression tasks",
         "description":"In the realm of machine and deep learning (DL) regression tasks, the role of effective feature engineering (FE) is pivotal in enhancing model performance. Traditional approaches of FE often rely on domain expertise to manually design features for machine learning (ML) models. In the context of DL models, the FE is embedded in the neural network's architecture, making it hard for interpretation. In this study, we propose to integrate symbolic regression (SR) as an FE process before a ML model to improve its performance. We show, through extensive experimentation on synthetic and 21 real-world datasets, that the incorporation of SR-derived features significantly enhances the predictive capabilities of both machine and DL regression models with 34%–86% root mean square error (RMSE) improvement in synthetic datasets and 4%–11.5% improvement in real-world datasets. In an additional realistic use case, we show the proposed method improves the ML performance in predicting superconducting critical temperatures based on Eliashberg theory by more than 20% in terms of RMSE. These results outline the potential of SR as an FE component in data-driven models, improving them in terms of performance and interpretability.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/autoencoder.pdf"},
					  {"info": "cite", "type": 3, "link": "Shmuel, A., Glickman, O., Lazebnik, T., Symbolic regression as a feature engineering method for machine and deep learning regression tasks. Machine Learning: Science and Technology. 2024."}],
		 "authors": "Assaf Shmuel, Oren Glickman, Teddy Lazebnik",
         "year": 2024,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Machine Learning: Science and Technology",
         "publicationStatus":"Published"
      },
	{
         "name":"Knowledge-integrated autoencoder model",
         "description":"Data encoding is a common and central operation in most data analysis tasks. The performance of other models downstream in the computational process highly depends on the quality of data encoding. One of the most powerful ways to encode data is using the neural network AutoEncoder (AE) architecture. However, the developers of AE cannot easily influence the produced embedding space, as it is usually treated as a black box technique. This means the embedding space is uncontrollable and does not necessarily possess the properties desired for downstream tasks. This paper introduces a novel approach for developing AE models that can integrate external knowledge sources into the learning process, possibly leading to more accurate results. The proposed Knowledge-integrated AutoEncoder (KiAE) model can leverage domain-specific information to make sure the desired distance and neighborhood properties between samples are preservative in the embedding space. The proposed model is evaluated on three large-scale datasets from three scientific fields and is compared to nine existing encoding models. The results demonstrate that the KiAE model effectively captures the underlying structures and relationships between the input data and external knowledge, meaning it generates a more useful representation. This leads to outperforming the rest of the models in terms of reconstruction accuracy.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/autoencoder.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Simon-Keren, L. Knowledge-integrated autoencoder model. Expert Systems with Applications. 2024."}],
		 "authors": "Teddy Lazebnik, Liron Simon-Keren",
         "year": 2024,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Expert Systems with Applications",
         "publicationStatus":"Published"
      },
	{
         "name":"The scientometrics and reciprocality underlying co-authorship panels in Google Scholar profiles",
         "description":"Online academic profiles are used by scholars to reflect a desired image to their online audience. In Google Scholar, scholars can select a subset of co-authors for presentation in a central location on their profile using a social feature called the “co-authroship panel”. In this work, we examine whether scientometrics and reciprocality can explain the observed selections. To this end, we scrape and thoroughly analyze a novel set of 120,000 Google Scholar profiles, ranging across four dieffectsciplines and various academic institutions. Our results seem to suggest that scholars tend to favor co-authors with higher scientometrics over others for inclusion in their co-authorship panels. Interestingly, as one’s own scientometrics are higher, the tendency to include co-authors with high scientometrics is diminishing. Furthermore, we find that reciprocality is central in explaining scholars’ selections.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/coauthors_panel.pdf"},
					  {"info": "cite", "type": 3, "link": "Alexi, A., Lazebnik, T., Rosenfeld, A. The scientometrics and reciprocality underlying co-authorship panels in Google Scholar profiles. Scientometrics. 2024."}],
		 "authors": "Ariel Alexi, Teddy Lazebnik, Ariel Rosenfeld",
         "year": 2024,
         "topic":"Social",
         "type":"Paper",
         "publisher":"Scientometrics",
         "publicationStatus":"Published"
      },
	{
         "name":"Going a Step Deeper Down the Rabbit Hole: Deep Learning Model to Measure the Size of the Unregistered Economy",
         "description":"Accurately estimating the size of unregistered economies is crucial for informed policymaking and economic analysis. However, many studies seem to overfit partial data as these use simple linear regression models. Recent studies adopted a more advanced approach, using non-linear models obtained using machine learning techniques. In this study, we take a step forward on the road of data-driven models for the unregistered economy activity’s (UEA) size prediction using a novel deep-learning approach. The proposed two-phase deep learning model combines an AutoEncoder for feature representation and a Long Short-Term Memory (LSTM) for time-series prediction. We show it outperforms traditional linear regression models and current state-of-the-art machine learning-based models, offering a more accurate and reliable estimation. Moreover, we show that the proposed model is better in generalizing UEA’s dynamics across countries and timeframes, providing policymakers with a more profound group to design socio-economic policies to tackle UEA.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/black_economy_dl.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Going a Step Deeper Down the Rabbit Hole: Deep Learning Model to Measure the Size of the Unregistered Economy. Computational Economics. 2024."}],
		 "authors": "Teddy Lazebnik",
         "year": 2024,
         "topic":"Economic",
         "type":"Paper",
         "publisher":"Computational Economics",
         "publicationStatus":"Published"
      },
	{
         "name":"More Numerically Accurate Algorithm for Stiff Matrix Exponential",
         "description":"In this paper, we propose a novel, highly accurate numerical algorithm for matrix exponentials (MEs). The algorithm is based on approximating Putzer’s algorithm by analytically solving the ordinary differential equation (ODE)-based coefficients and approximating them. We show that the algorithm outperforms other ME algorithms for stiff matrices for several matrix sizes while keeping the computation and memory consumption asymptotically similar to these algorithms. In addition, we propose a numerical-error- and complexity-optimized decision tree model for efficient ME computation based on machine learning and genetic programming methods. We show that, while there is not one ME algorithm that outperforms the others, one can find a good algorithm for any given matrix according to its properties.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/matrix.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bunimovich-Mendrazitsky, S., More Numerically Accurate Algorithm for Stiff Matrix Exponential. Mathematics. 2024."}],
		 "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky",
         "year": 2024,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Mathematics",
         "publicationStatus":"Published"
      },
	{
         "name":"Cost-optimal Seeding Strategy During a Botanical Pandemic in Domesticated Fields",
         "description":"Botanical pandemics cause enormous economic damage and food shortages around the globe. However, since botanical pandemics are here to stay in the short-medium term, domesticated field owners can strategically seed their fields to optimize each session’s economic profit. In this work, we propose a novel epidemiological-economic mathematical model that describes the economic profit from a field of plants during a botanical pandemic. We describe the epidemiological dynamics using a spatiotemporal extended susceptible-infected-recovered epidemiological model with a non-linear output economic model. We provide an algorithm to obtain an optimal grid-formed seeding strategy to maximize economic profit, given field and pathogen properties. We show that the recovery and basic infection rates have a similar economic influence. Unintuitively, we show that a larger farm does not promise higher economic profit. Our results demonstrate a significant benefit of using the proposed seeding strategy and shed more light on the dynamics of the botanical pandemic.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/eco_pandemic_in_the_field.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Cost-optimal Seeding Strategy During a Botanical Pandemic in Domesticated Fields. Chaos. 2024."}],
		 "authors": "Teddy Lazebnik",
         "year": 2024,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Chaos",
         "publicationStatus":"Published"
      },
	{
         "name":"A new definition for feature selection stability analysis",
         "description":"Feature selection (FS) stability is an important topic of recent interest. Finding stable features is important for creating reliable, non-overfitted feature sets, which in turn can be used to generate machine learning models with better accuracy and explanations and are less prone to adversarial attacks. There are currently several definitions of FS stability that are widely used. In this paper, we demonstrate that existing stability metrics fail to quantify certain key elements of many datasets such as resilience to data drift or non-uniformly distributed missing values. To address this shortcoming, we propose a new definition for FS stability inspired by Lyapunov stability in dynamic systems. We show the proposed definition is statistically different from the classical record-stability on (n=90) datasets. We present the advantages and disadvantages of using Lyapunov and other stability definitions and demonstrate three scenarios in which each one of the three proposed stability metrics is best suited.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/xai_2.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Rosenfeld, A., A new definition for feature selection stability analysis.  Annals of Mathematics and Artificial Intelligence. 2024."}],
		 "authors": "Teddy Lazebnik, Avi Rosenfeld",
         "year": 2024,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Annals of Mathematics and Artificial Intelligence",
         "publicationStatus":"Published"
      },
	{
         "name":"Environmental enrichments and data-driven welfare indicators for sheltered dogs using telemetric physiological measures and signal processing",
         "description":"Shelters are stressful environments for domestic dogs which are known to negatively impact their welfare. The introduction of outside stimuli for dogs in this environment can improve their welfare and life conditions. However, our current understanding of the influence of different stimuli on shelter dogs’ welfare is limited and the data is still insufficient to draw conclusions. In this study, we collected 28 days (four weeks) of telemetry data from eight male dogs housed in an Italian shelter for a long period of time. During this period, three types of enrichment were introduced into the dogs’ pens for one week each: entertaining objects, intraspecific, and interspecific social enrichment, by means of the presence of female conspecifics and the presence of a human. To quantify their impact, we introduce novel metrics as indicators of sheltered dogs’ welfare based on telemetry data: the variation of heart rate, muscle activity, and body temperature from an average baseline day, quality of sleep, and the regularity for cyclicity of the aforementioned parameters, based on the day-night cycle. Using these metrics, we show that while all three stimuli statistically improve the dogs’ welfare, the variance between individual dogs is large. Moreover, our findings indicate that the presence of female conspecific is the best stimulus among the three explored options which improves both the quality of sleep and the parameters’ cyclicity. Our results are consistent with previous research findings while providing novel data-driven welfare indicators that promote objectivity. Thus, this research provides some useful guidelines for managing shelters and improving dogs’ welfare.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/italian_dogs.pdf"},
					  {"info": "cite", "type": 3, "link": "Travain, T., Lazebnik, T., Zamansky, A., Cafazzo, S., Valsecchi, P., Natoli, E., Environmental enrichments and data-driven welfare indicators for sheltered dogs using telemetric physiological measures and signal processing. Scientific Reports. 2024."}],
		 "authors": "Tiziano Travain, Teddy Lazebnik, Anna Zamansky, Simona Cafazzo, Paola Valsecchi & Eugenia Natoli",
         "year": 2024,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Scientific Reports",
         "publicationStatus":"Published"
      },
	{
         "name":"BovineTalk: machine learning for vocalization analysis of dairy cattle under the negative affective state of isolation",
         "description":"There is a critical need to develop and validate non-invasive animal-based indicators of affective states in livestock species, in order to integrate them into on-farm assessment protocols, potentially via the use of precision livestock farming (PLF) tools. One such promising approach is the use of vocal indicators. The acoustic structure of vocalizations and their functions were extensively studied in important livestock species, such as pigs, horses, poultry, and goats, yet cattle remain understudied in this context to date. Cows were shown to produce two types of vocalizations: low-frequency calls (LF), produced with the mouth closed, or partially closed, for close distance contacts, and open mouth emitted high-frequency calls (HF), produced for long-distance communication, with the latter considered to be largely associated with negative affective states. Moreover, cattle vocalizations were shown to contain information on individuality across a wide range of contexts, both negative and positive. Nowadays, dairy cows are facing a series of negative challenges and stressors in a typical production cycle, making vocalizations during negative affective states of special interest for research. One contribution of this study is providing the largest to date pre-processed (clean from noises) dataset of lactating adult multiparous dairy cows during negative affective states induced by visual isolation challenges. Here, we present two computational frameworks—deep learning based and explainable machine learning based, to classify high and low-frequency cattle calls and individual cow voice recognition. Our models in these two frameworks reached 87.2 and 89.4% accuracy for LF and HF classification, with 68.9 and 72.5% accuracy rates for the cow individual identification, respectively.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/BovineTalk.pdf"},
					  {"info": "cite", "type": 3, "link": "Gavojdian, D., Mincu1, M., Lazebnik, T., Oren, A., Nicolae, I., Zamansky, A., BovineTalk: machine learning for vocalization analysis of dairy cattle under the negative affective state of isolation. Frontiers in Veterinary Science. 2024."}],
		 "authors": "Dinu Gavojdian, Madalina Mincu1, Teddy Lazebnik, Ariel Oren, Ioana Nicolae, Anna Zamansky",
         "year": 2024,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Frontiers in Veterinary Science",
         "publicationStatus":"Published"
      },
	{
         "name":"Improved prediction of settling behavior of solid particles through machine learning analysis of experimental retention time data",
         "description":"The motion of particles through density-stratified interfaces is a common phenomenon in environmental and engineering applications. However, the mechanics of particle-stratification interactions in various combinations of particle and fluid properties are not well understood. This study presents a novel machine-learning (ML) approach to experimental data of inertial particles crossing a density-stratified interface. A simplified particle settling experiment was conducted to obtain a large number of particles and expand the parameter range. Using ML, the study explores new correlations that collapse the data gathered in this and in previous work by Verso et al. (2019). The “delay time”, which is the time between the particle exiting the interfacial layer and reaching a steady-state velocity, is found to strongly depend on six dimensionless parameters formulated by ML feature selection. The data shows a correlation between the Reynolds and Froude numbers within the range of the experiments, and the best symbolic regression is based on the Froude number only. This experiment provides valuable insights into the behavior of inertial particles in stratified layers and highlights opportunities for future improvement in predicting their motion.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/liron_alex_physics.pdf"},
					  {"info": "cite", "type": 3, "link": "Simon-Keren, L., Lazebnik, T., Liberzon, A., Improved prediction of settling behavior of solid particles through machine learning analysis of experimental retention time data. International Journal of Multiphase Flow. 2024."}],
		 "authors": "Liron Simon-Keren, Teddy Lazebnik, Alex Liberzon",
         "year": 2024,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"International Journal of Multiphase Flow",
         "publicationStatus":"Published"
      },
	{
         "name":"An algorithm to optimize explainability using feature ensembles",
         "description":"Feature Ensembles are a robust and effective method for finding the feature set that yields the best predictive accuracy for learning agents. However, current feature ensemble algorithms do not consider explainability as a key factor in their construction. To address this limitation, we present an algorithm that optimizes for the explainability and performance of a model – the Optimizing Feature Ensembles for Explainability (OFEE) algorithm. OFEE uses intersections of feature sets to produce a feature ensemble that optimally balances explainability and performance. Furthermore, OFEE is parameter-free and as such optimizes itself to a given dataset and explainability requirements. To evaluated OFEE, we considered two explainability measures, one based on ensemble size and the other based on ensemble stability. We found that OFEE was overall extremely effective within the nine canonical datasets we considered. It outperformed other feature selection algorithms by an average of over 8% and 7% respectively when considering the size and stability explainability measures.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/xai_1.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bunimovich-Mendrazitsky, S., Rosenfeld, A., An algorithm to optimize explainability using feature ensembles. Applied Intelligence. 2024."}],
		 "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky, Avi Rosenfeld",
         "year": 2024,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Applied Intelligence",
         "publicationStatus":"Published"
      },
	{
         "name":"A Hybrid Mathematical Model for Optimal Border Closure Policy during Pandemic",
         "description":"During a global health crisis, a country’s borders are a weak point through which carriers from countries with high morbidity rates can enter, endangering the health of the local community and undermining the authorities efforts to prevent the spread of the pathogen. Therefore, most countries have adopted some level of border closure policies as one of the first steps in handling pandemics. However, this step involves a significant economic loss, especially for countries that rely on tourism as a source of income. We developed a pioneering model to help decision-makers determine the optimal border closure policies during a health crisis that minimize the magnitude of the outbreak and maximize the revenue of the tourism industry. This approach is based on a hybrid mathematical model that consists of an epidemiological sub-model with tourism and a pandemic-focused economic sub-model, which relies on elements from the field of artificial intelligence to provide policymakers with a data-driven model for a border closure strategy for tourism during a global pandemic.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/pandemic_tourisem.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Shami, L., Bunimovich-Mendrazitsky, S., A Hybrid Mathematical Model for Optimal Border Closure Policy during Pandemic. International Journal of Applied Mathematics and Computer Science. 2023."}],
		 "authors": "Teddy Lazebnik, Labib Shami, Svetlana Bunimovich-Mendrazitsky",
         "year": 2023,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"International Journal of Applied Mathematics and Computer Science",
         "publicationStatus":"Published"
      },
	{
         "name":"Digitally-enhanced dog behavioral testing",
         "description":"Behavioral traits in dogs are assessed for a wide range of purposes such as determining selection for breeding, chance of being adopted or prediction of working aptitude. Most methods for assessing behavioral traits are questionnaire or observation-based, requiring significant amounts of time, effort and expertise. In addition, these methods might be also susceptible to subjectivity and bias, negatively impacting their reliability. In this study, we proposed an automated computational approach that may provide a more objective, robust and resource-efficient alternative to current solutions. Using part of a ‘Stranger Test’ protocol, we tested n = 53 dogs for their response to the presence and neutral actions of a stranger. Dog coping styles were scored by three dog behavior experts. Moreover, data were collected from their owners/trainers using the Canine Behavioral Assessment and Research Questionnaire (C-BARQ). An unsupervised clustering of the dogs’ trajectories revealed two main clusters showing a significant difference in the stranger-directed fear C-BARQ category, as well as a good separation between (sufficiently) relaxed dogs and dogs with excessive behaviors towards strangers based on expert scoring. Based on the clustering, we obtained a machine learning classifier for expert scoring of coping styles towards strangers, which reached an accuracy of 78%. We also obtained a regression model predicting C-BARQ scores with varying performance, the best being Owner-Directed Aggression (with a mean average error of 0.108) and Excitability (with a mean square error of 0.032). This case study demonstrates a novel paradigm of ‘machine-based’ dog behavioral assessment, highlighting the value and great promise of AI in this context.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/anna_2.pdf"},
					  {"info": "cite", "type": 3, "link": "Farhat, N., Lazebnik, T., Monteny, J., Moons, C. P. H., Wydooghe, E., van der Linden, D., Zamansky, A. Digitally-enhanced dog behavioral testing. Scientific Reports. 2023."}],
		 "authors": "Nareed Farhat, Teddy Lazebnik, Joke Monteny, Christel Palmyre Henri Moons, Eline Wydooghe, Dirk van der Linden, Anna Zamansky",
         "year": 2023,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Scientific Reports",
         "publicationStatus":"Published"
      },
	{
         "name":"Machine learning approaches to predict and detect early-onset of digital dermatitis in dairy cows using sensor data",
         "description":"The present study aimed to employ machine learning algorithms based on sensor behavior data for (1) early-onset detection of digital dermatitis (DD) and (2) DD prediction in dairy cows. Our machine learning model, which was based on the Tree-Based Pipeline Optimization Tool (TPOT) automatic machine learning method, for DD detection on day 0 of the appearance of the clinical signs has reached an accuracy of 79% on the test set, while the model for the prediction of DD 2 days prior to the appearance of the first clinical signs, which was a combination of K-means and TPOT, has reached an accuracy of 64%. The proposed machine learning models have the potential to help achieve a real-time automated tool for monitoring and diagnosing DD in lactating dairy cows based on sensor data in conventional dairy barn environments. Our results suggest that alterations in behavioral patterns can be used as inputs in an early warning system for herd management in order to detect variances in the health and wellbeing of individual cows.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/anna_1.pdf"},
					  {"info": "cite", "type": 3, "link": "Magana, J., Gavojdian, D., Menahem, Y., Lazebnik, T., Zamansky, A., Adams-Progar, A. Machine learning approaches to predict and detect early-onset of digital dermatitis in dairy cows using sensor data. Animal Behavior and Welfare. 2023."}],
		 "authors": "Jennifer Magana1, Dinu Gavojdian, Yakir Menahem, Teddy Lazebnik, Anna Zamansky, Amber Adams-Progar",
         "year": 2023,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Animal Behavior and Welfare",
         "publicationStatus":"Published"
      },
	{
         "name":"BrachySound: machine learning based assessment of respiratory sounds in dogs",
         "description":"The early and accurate diagnosis of brachycephalic obstructive airway syndrome (BOAS) in dogs is pivotal for effective treatment and enhanced canine well-being. Owners often do underestimate the severity of BOAS in their dogs. In addition, traditional diagnostic methods, which include pharyngolaryngeal auscultation, are often compromised by subjectivity, are time-intensive and depend on the veterinary surgeon’s experience. Hence, new fast, reliable assessment methods for BOAS are required. The aim of the current study was to use machine learning techniques to bridge this scientific gap. In this study, machine learning models were employed to objectively analyze 366 audio samples from 69 Pugs and 79 other brachycephalic breeds, recorded with an electronic stethoscope during a 15-min standardized exercise test. In classifying the BOAS test results as to whether the dog is affected or not, our models achieved a peak accuracy of 0.85, using subsets from the Pugs dataset. For predictions of the BOAS results from recordings at rest in Pugs and various brachycephalic breeds, accuracies of 0.68 and 0.65 were observed, respectively. Notably, the detection of laryngeal sounds achieved an F1 score of 0.80. These results highlight the potential of machine learning models to significantly streamline the examination process, offering a more objective assessment than traditional methods. This research indicates a turning point towards a data-driven, objective, and efficient approach in canine health assessment, fostering standardized and objective BOAS diagnostics.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/BrachySound.pdf"},
					  {"info": "cite", "type": 3, "link": "Oren, A., Turkcu, J. D., Meller, S., Lazebnik, T., Wiegel, P., Mach, R., Volk, H. A., Zamansky, A. BrachySound: machine learning based assessment of respiratory sounds in dogs. Scientific Reports. 2023."}],
		 "authors": "Ariel Oren, Jana D. Türkcü, Sebastian Meller, Teddy Lazebnik, Pia Wiegel, Rebekka Mach, Holger A. Volk & Anna Zamansky",
         "year": 2023,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Scientific Reports",
         "publicationStatus":"Published"
      },
	{
         "name":"Can We Mathematically Spot the Possible Manipulation of Results in Research Manuscripts Using Benford’s Law?",
         "description":"The reproducibility of academic research has long been a persistent issue, contradicting one of the fundamental principles of science. Recently, there has been an increasing number of false claims found in academic manuscripts, casting doubt on the validity of reported results. In this paper, we utilize an adapted version of Benford’s law, a statistical phenomenon that describes the distribution of leading digits in naturally occurring datasets, to identify the potential manipulation of results in research manuscripts, solely using the aggregated data presented in those manuscripts rather than the commonly unavailable raw datasets. Our methodology applies the principles of Benford’s law to commonly employed analyses in academic manuscripts, thus reducing the need for the raw data itself. To validate our approach, we employed 100 open-source datasets and successfully predicted 79% of them accurately using our rules. Moreover, we tested the proposed method on known retracted manuscripts, showing that around half (48.6%) can be detected using the proposed method. Additionally, we analyzed 100 manuscripts published in the last two years across ten prominent economic journals, with 10 manuscripts randomly sampled from each journal. Our analysis predicted a 3% occurrence of results manipulation with a 96% confidence level. Our findings show that Benford’s law adapted for aggregated data, can be an initial tool for identifying data manipulation; however, it is not a silver bullet, requiring further investigation for each flagged manuscript due to the relatively low prediction accuracy.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/academic_data_fruad.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Gorlitsky, D. Can We Mathematically Spot the Possible Manipulation of Results in Research Manuscripts Using Benford’s Law?. Data. 2023."}],
		 "authors": "Teddy Lazebnik, Gorlitsky Dan",
         "year": 2023,
         "topic":"Social",
         "type":"Paper",
         "publisher":"Scientometrics",
         "publicationStatus":"Published"
      },
	{
         "name":"Academic co-authorship is a risky game",
         "description":"Trust has proven to be a predictor of organizational outcomes. In some cases, such as law enforcement, achieving organizational goals requires workers to be willing to risk their lives. Is there a link between street-level bureaucrats’ (SLBs) willingness to endanger their own lives for the public and their trust in their peers, managers, and the institution to which they belong? Using a national survey of 2,733 police officers in Brazil and machine-learning-based methods, we found that there is a significant link between their willingness to risk their lives for others and their trust in their peers, managers, and the institution to which they belong. Our findings indicate that while these SLBs were very willing to risk their lives for certain groups, their willingness declined sharply for others such as lesbian, gay, bisexual, transgender, and questioning (LGBTQ)+ people and the homeless. In addition, police officers’ perceptions about discrimination, police professionalism, and organizational commitment and support are linearly linked to their willingness to risk their lives. Our findings demonstrate the important role of trust in understanding public servants’ practices in the extreme context of risking their lives for others.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/risky_game.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Beck, S., Shami, L. Academic co-authorship is a risky game. Scientometrics. 2023."}],
		 "authors": "Teddy Lazebnik, Stephan Beck, Labib Shami",
         "year": 2023,
         "topic":"Social",
         "type":"Paper",
         "publisher":"Scientometrics",
         "publicationStatus":"Published"
      },
	{
         "name":"Trust and Street-Level Bureaucrats’ Willingness to Risk Their Lives for Others: The Case of Brazilian Law Enforcement",
         "description":"Trust has proven to be a predictor of organizational outcomes. In some cases, such as law enforcement, achieving organizational goals requires workers to be willing to risk their lives. Is there a link between street-level bureaucrats’ (SLBs) willingness to endanger their own lives for the public and their trust in their peers, managers, and the institution to which they belong? Using a national survey of 2,733 police officers in Brazil and machine-learning-based methods, we found that there is a significant link between their willingness to risk their lives for others and their trust in their peers, managers, and the institution to which they belong. Our findings indicate that while these SLBs were very willing to risk their lives for certain groups, their willingness declined sharply for others such as lesbian, gay, bisexual, transgender, and questioning (LGBTQ)+ people and the homeless. In addition, police officers’ perceptions about discrimination, police professionalism, and organizational commitment and support are linearly linked to their willingness to risk their lives. Our findings demonstrate the important role of trust in understanding public servants’ practices in the extreme context of risking their lives for others.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/nissim_1.pdf"},
					  {"info": "cite", "type": 3, "link": "Cohen, N., Lotta, G., Alcadipani, R., Lazebnik, T. Trust and Street-Level Bureaucrats’ Willingness to Risk Their Lives for Others: The Case of Brazilian Law Enforcement. The American Review of Public Administration. 2023."}],
		 "authors": "Nissim Cohen, Gabriela Lotta, Rafael Alcadipani, Teddy Lazebnik",
         "year": 2023,
         "topic":"Social",
         "type":"Paper",
         "publisher":"The American Review of Public Administration",
         "publicationStatus":"Published"
      },
	{
         "name":"Multi-species prey–predator dynamics during a multi-strain pandemic ",
         "description":"Small and large scale pandemics are a natural phenomenon repeatably appearing throughout history, causing ecological and biological shifts in ecosystems and a wide range of their habitats. These pandemics usually start with a single strain but shortly become multi-strain due to a mutation process of the pathogen causing the epidemic. In this study, we propose a novel eco-epidemiological model that captures multi-species prey–predator dynamics with a multi-strain pandemic. The proposed model extends and combines the Lotka–Volterra prey–predator model and the Susceptible–Infectious–Recovered epidemiological model. We investigate the ecosystem’s sensitivity and stability during such a multi-strain pandemic through extensive simulation relying on both synthetic cases as well as two real-world configurations. Our results are aligned with known ecological and epidemiological findings, thus supporting the adequacy of the proposed model in realistically capturing the complex eco-epidemiological properties of the multi-species multi-strain pandemic dynamics.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/msms.pdf"},
					  {"info": "cite", "type": 3, "link": "Alexi, A., Rosenfeld, A., Lazebnik, T. Multi-species prey–predator dynamics during a multi-strain pandemic. Chaos. 2023."}],
		 "authors": "Ariel Alexi, Ariel Rosenfeld, Teddy Lazebnik",
         "year": 2023,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Chaos",
         "publicationStatus":"Published"
      },
	{
         "name":"Collective evolution learning model for vision-based collective motion with collision avoidance",
         "description":"Collective motion (CM) takes many forms in nature; schools of fish, flocks of birds, and swarms of locusts to name a few. Commonly, during CM the individuals of the group avoid collisions. These CM and collision avoidance (CA) behaviors are based on input from the environment such as smell, air pressure, and vision, all of which are processed by the individual and defined action. In this work, a novel vision-based CM with CA model (i.e., VCMCA) simulating the collective evolution learning process is proposed. In this setting, a learning agent obtains a visual signal about its environment, and throughout trial-and-error over multiple attempts, the individual learns to perform a local CM with CA which emerges into a global CM with CA dynamics. The proposed algorithm was evaluated in the case of locusts’ swarms, showing the evolution of these behaviors in a swarm from the learning process of the individual in the swarm. Thus, this work proposes a biologically-inspired learning process to obtain multi-agent multi-objective dynamics.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/hagabubim.pdf"},
					  {"info": "cite", "type": 3, "link": "Krongauz, D. L., Lazebnik, T. Collective evolution learning model for vision-based collective motion with collision avoidance. Plos One. 2023."}],
		 "authors": "Teddy Lazebnik, Ariel Alexi",
         "year": 2023,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Plos One",
         "publicationStatus":"Published"
      },
	{
         "name":"Microfounded tax revenue forecast model with heterogeneous population and genetic algorithm approach",
         "description":"The ability of governments to accurately forecast tax revenues is essential for the successful implementation of fiscal programs. However, forecasting state government tax revenues using only aggregate economic variables is subject to Lucas’s critique, which is left not fully answered as classical methods do not consider the complex feedback dynamics between heterogeneous consumers, businesses, and the government. In this study we present an agent-based model with a heterogeneous population and genetic algorithm-based decision-making to model and simulate an economy with taxation policy dynamics. The model focuses on assessing state tax revenues obtained from regions or cities within countries while introducing consumers and businesses, each with unique attributes and a decision-making mechanism driven by an adaptive genetic algorithm. We demonstrate the efficacy of the proposed method on a small village, resulting in a mean relative error of 5.44 +- 2.34 percent from the recorded taxes over 4 years and 4.08 +- 1.21 percent for the following year’s assessment. Moreover, we demonstrate the model’s ability to evaluate the effect of different taxation policies on economic activity and tax revenues.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/economy_model.pdf"},
					  {"info": "cite", "type": 3, "link": "Alexi, A., Lazebnik, T., Shami, L. Microfounded Tax Revenue Forecast Model with Heterogeneous Population and Genetic Algorithm Approach. Computational Economics. 2023."}],
		 "authors": "Ariel Alexi, Teddy Lazebnik, Labib Shami",
         "year": 2023,
         "topic":"Economic",
         "type":"Paper",
         "publisher":"Computational Economics",
         "publicationStatus":"Published"
      },
	{
         "name":"SubStrat: A Subset-Based Optimization Strategy for Faster AutoML",
         "description":"Automated machine learning (AutoML) frameworks have become important  tools in the data scientist arsenal, as they dramatically reduce the manual work devoted to the construction of ML pipelines. Such frameworks intelligently search among millions of possible ML pipelines - typically containing feature engineering, model selection, and hyper parameters tuning steps - and finally output an optimal pipeline in terms of predictive accuracy. However, when the dataset is large, each individual configuration takes longer to execute, therefore the overall AutoML running times become increasingly high. To this end, we present SubStrat, an AutoML optimization strategy that tackles the data size, rather than configuration space. It wraps existing AutoML tools, and instead of executing them directly on the entire dataset, SubStrat uses a genetic-based algorithm to find a small yet representative data subset that preserves a particular characteristic of the full data. It then employs the AutoML tool on the small subset, and finally, it refines the resulting pipeline by executing a restricted, much shorter, AutoML process on the large dataset. ",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/substrat.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik et al., SubStrat: A Subset-Based Optimization Strategy for Faster AutoML. VLDP. 2023."}],
		 "authors": "Teddy Lazebnik, Amit Somech, Abraham Itzhak Weinberg",
         "year": 2023,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"VLDP",
         "publicationStatus":"Published"
      },
	{
         "name":"SynthEye: Investigating the Impact of Synthetic Data on Artificial Intelligence assisted Gene Diagnosis of Inherited Retinal Disease",
         "description":"Synthetic generation of realistic IRD FAF images is feasible. Synthetic data augmentation does not deliver improvements in classification performance. However, synthetic data alone deliver a similar performance as real data, and hence may be useful as a proxy to real data.Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/syntheye.pdf"},
					  {"info": "cite", "type": 3, "link": "Veturi et al., SynthEye: Investigating the Impact of Synthetic Data on Artificial Intelligence assisted Gene Diagnosis of Inherited Retinal Disease. Ophthalmology Science. 2023."}],
		 "authors": "Yoga Advaith Veturi, William Woof, Teddy Lazebnik, Ismail Moghul, Peter Woodward-Court, Siegfried K. Wagner, Thales Antonio Cabral de Guimarães, Malena Daich Varela, Bart Liefers, Praveen J. Patel, Stephan Beck, Andrew R. Webster, Omar Mahroo, Pearse A. Keane, Michel Michaelides, Konstantinos Balaskas, Nikolas Pontikos",
         "year": 2023,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Ophthalmology Science",
         "publicationStatus":"Published"
      },
	{
         "name":"Cancer-inspired genomics mapper model for the generation of synthetic DNA sequences with desired genomics signatures",
         "description":"Genome data are crucial in modern medicine, offering significant potential for diagnosis and treatment. Thanks to technological advancements, many millions of healthy and diseased genomes have already been sequenced; however, obtaining the most suitable data for a specific study, and specifically for validation studies, remains challenging with respect to scale and access. Therefore, in silico genomics sequence generators have been proposed as a possible solution. However, the current generators produce inferior data using mostly shallow (stochastic) connections, detected with limited computational complexity in the training data. This means they do not take the appropriate biological relations and constraints, that originally caused the observed connections, into consideration. To address this issue, we propose cancer-inspired genomics mapper model (CGMM), that combines genetic algorithm (GA) and deep learning (DL) methods to tackle this challenge. CGMM mimics processes that generate genetic variations and mutations to transform readily available control genomes into genomes with the desired phenotypes. We demonstrate that CGMM can generate synthetic genomes of selected phenotypes such as ancestry and cancer that are indistinguishable from real genomes of such phenotypes, based on unsupervised clustering. Our results show that CGMM outperforms four current state-of-the-art genomics generators on two different tasks, suggesting that CGMM will be suitable for a wide range of purposes in genomic medicine, especially for much-needed validation studies.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/ucl_main.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Simon-Keren, L., Cancer-inspired genomics mapper model for the generation of synthetic DNA sequences with desired genomics signatures. Computers in Biology and Medicine. 2023."}],
		 "authors": "Teddy Lazebnik, Liron Simon-Keren",
         "year": 2023,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Computers in Biology and Medicine",
         "publicationStatus":"Published"
      },
	{
         "name":"Data-driven hospitals staff and resources allocation using agent-based simulation and deep reinforcement learning",
         "description":"Hospital staff and resources allocation (HSRA) is a critical challenge in healthcare systems, as it involves balancing the demands of patients, the availability of resources, and the need to provide high-quality health in resource-bounded settings. Traditional approaches to HSRA have relied on manual planning and ad-hoc adjustments, which can be time-consuming and usually lead to sub-optimal outcomes. Recent studies show that machine learning solutions are able to produce better HSRA results compared to manual planning. However, these outcomes usually focused on a single hospital and objective. In this paper, we solve the HSRA task using a novel agent-based simulation with a deep reinforcement learning agent. We used real-world data to generate a wide range of synthetic instances that were used to train the HSRA agent. Our results show that the proposed model is able to achieve better outcomes in terms of patient treatment success and cost-effectiveness compared to previous resource allocation algorithms. We show that different planning horizons obtain similar performance in handling anomalies. In addition, we show a second-order polynomial connection between the patient treatment success and both the hospital’s initial budget and funding over time. These results suggest that our approach has the potential to improve the efficiency and effectiveness of HSRA in healthcare systems.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/ai_hospitals.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Data-driven hospitals staff and resources allocation using agent-based simulation and deep reinforcement learning. Engineering Applications of Artificial Intelligence. 2023."}],
		 "authors": "Teddy Lazebnik",
         "year": 2023,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Engineering Applications of Artificial Intelligence",
         "publicationStatus":"Published"
      },{
         "name":"Benchmarking Biologically-Inspired Automatic Machine Learning for Economic Tasks",
         "description":"Data-driven economic tasks have gained significant attention in economics, allowing researchers and policymakers to make better decisions and design efficient policies. Recently, with the advancement of machine learning (ML) and other artificial intelligence (AI) methods, researchers can now solve complex economic tasks with previously unseen performance and ease. However, to use such methods, one is required to have a non-trivial level of expertise in ML or AI, which currently is not standard knowledge in economics. In order to bridge this gap, automatic machine learning (AutoML) models have been developed, allowing non-experts to efficiently use advanced ML models with their data. Nonetheless, not all AutoML models are created equal in general, particularly for the unique properties associated with economic data. In this paper, we present a benchmarking study of biologically inspired and other AutoML techniques for economic tasks. We evaluate four different AutoML models alongside two baseline methods using a set of 50 diverse economic tasks. Our results show that biologically inspired AutoML models (slightly) outperformed non-biological AutoML in economic tasks, while all AutoML models outperformed the traditional methods. Based on our results, we conclude that biologically inspired AutoML has the potential to improve our economic understanding while shifting a large portion of the analysis burden from the economist to a computer.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/bio_automl.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Fleischer, T., Yaniv-Rosenfeld, A., Benchmarking Biologically-Inspired Automatic Machine Learning for Economic Tasks. Sustainability. 2023."}],
		 "authors": "Teddy Lazebnik, Tzach Fleischer, Amit Yaniv-Rosenfeld",
         "year": 2023,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Sustainability",
         "publicationStatus":"Published"
      },
	{
         "name":"Mathematical Model for the BCG-based Treatment Of Type 1 Diabetes",
         "description":"This work introduces the first model of immunotherapy treatment, namely the Bacillus Calmette-Guerin (BCG) vaccine, for Type 1 Diabetes (T1D). The model takes into consideration the interaction network between multiple immune cell types and compartments. A set of ordinary differential equations (ODEs) is introduced to capture the connectivity between these variables and the clinical presentation of the disease. Four subsets of the T1D mice and healthy controls that exhibit normal and high-level glucose consumption are evaluated using the proposed model. Numerical results obtained for mice suggest that BCG treatment of the T1D patients that follow healthy eating habits normalizes glucose to levels observed in non-diabetic controls. Furthermore, glucose consumption profoundly influences disease progression. This outcome suggests that immunotherapy may modulate molecular and cellular manifestations of the disease but it does not eliminate T1D. Of note, our data, obtained from numerical simulations, indicate that the BCG immunotherapy treatment may benefit healthy controls on a high-glucose diet and can be used as a tool for further clinical investigation of BCG usage to control T1D.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/bcg_t1d.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik. T., Bunimovich-Mendrazitsky, S., Kiselyov, A., Mathematical model for BCG-based treatment of type 1 diabetes. Physica A: Statistical Mechanics and its Applications. 2023."}],
		 "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky, Alex Kiselyov",
         "year": 2023,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Physica A: Statistical Mechanics and its Applications",
         "publicationStatus":"Published"
      },
	{
         "name":"Computational Applications of Extended SIR Models: A Review Focused on Airborne Pandemics",
         "description":"Epidemiological-Mathematical models are powerful tools for estimating the course of a pandemic and exploring different scenarios through pandemic intervention policies (PIPs). These models are commonly developed to provide decision-support tools for policymakers who are forced to make difficult decisions in a timely manner. Done properly, these models are able to provide a safe, quick, and cheap solution for this challenge. There are numerous types of mathematical models for epidemiological disease spread and control. However, in order to become applicative tools for decision-making, the modelers of these models are required to overcome three computational challenges: efficiently define the model, develop it as computer software, and fit it into historical data. Performed efficiently, one can use the obtained tool to explore possible scenarios and PIPs. In this paper, we present a critical review of models that extend the Susceptible-Infected-Recovered (SIR) model and explore the efficiency of these models, their software characteristics, and model performance on real-world data. We further provide a guide for epidemiological-mathematical model development and implementation, exploring several modeling approaches and their respective implementation options. Lastly, we outline the current trends, limitations, and opportunities in this field. In particular, we find that the spatial properties of a model play a critical role in its accuracy and ability to explain historical pandemic spread, especially in the context of airborne diseases. Moreover, we show that agent-based simulations are preferable over partial/ordinary differential solvers when considering a highly-realistic pandemic model or focusing on a relatively small population size.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/sir_review.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik. T., Computational Applications of Extended SIR Models: A Review Focused on Airborne Pandemics. Ecological Modelling. 2023."}],
		 "authors": "Teddy Lazebnik",
         "year": 2023,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"Ecological Modelling",
         "publicationStatus":"Published"
      },
	{
         "name":"FSPL: A Meta-Learning Approach for a Filter and Embedded Feature Selection Pipeline",
         "description":"There are two main approaches to tackle the challenge of finding the best filter or embedded feature selection (FS) algorithm: searching for the one best FS algorithm and creating an ensemble of all available FS algorithms. However, in practice, these two processes usually occur as part of a larger machine learning pipeline and not separately. We posit that, due to the influence of the filter FS on the embedded FS, one should aim to optimize both of them as a single FS pipeline rather than separately. We propose a meta-learning approach that automatically finds the best filter and embedded FS pipeline for a given dataset called FSPL. We demonstrate the performance of FSPL on n = 90 datasets, obtaining 0.496 accuracy for the optimal FS pipeline, revealing an improvement of up to 5.98 percent in the model’s accuracy compared to the second-best meta-learning method.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/AMCS_2023_33_1_9.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik. T., Rosenfeld, A., FSPL: A Meta-Learning Approach for a Filter and Embedded Feature Selection Pipeline. International Journal of Applied Mathematics and Computer Science. 2023."}],
		 "authors": "Teddy Lazebnik, Avi Rosenfeld",
         "year": 2023,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"International Journal of Applied Mathematics and Computer Science",
         "publicationStatus":"Published"
      },
	{
         "name":"Scheduling BCG and IL-2 Injections for Bladder Cancer Immunotherapy Treatment",
         "description":"Cancer is one of the most common families of diseases today with millions of new patients every year around the world. Bladder cancer (BC) is one of the most prevalent types of cancer affecting both genders, and it is not known to be associated with a specific group in the population. The current treatment standard for BC follows a standard weekly Bacillus Calmette–Guérin (BCG) immunotherapy-based therapy protocol which includes BCG and IL-2 injections. Unfortunately, due to the biological and clinical complexity of the interactions between the immune system, treatment, and cancer cells, clinical outcomes vary significantly among patients. Unfortunately, existing models are commonly developed for a non-existing average patient or pose strict, unrealistic, expectations on the treatment process. In this work, we propose the most extensive ordinary differential equation-based biological model of BCG treatment to date and a deep learning-based scheduling approach to obtain a personalized treatment schedule. Our results show that resulting treatment schedules favorably compare with the current standard practices and the current state-of-the-art scheduling approach.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/liza_2.pdf"},
					  {"info": "cite", "type": 3, "link": "Yaniv-Rosenfeld, A., Savchenko, E., Rosenfeld, A., Lazebnik, T., Scheduling BCG and IL-2 Injections for Bladder Cancer Immunotherapy Treatment. Mathematics. 2023."}],
		 "authors": "Amit Yaniv-Rosenfeld, Elizaveta Savchenko, Ariel Rosenfeld, Teddy Lazebnik",
         "year": 2023,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Mathematics",
         "publicationStatus":"Published"
      },
	{
         "name":"Decision tree post-pruning without loss of accuracy using the SAT-PP algorithm with an empirical evaluation on clinical data",
         "description":"A decision tree (DT) is one of the most popular and efficient techniques in data mining. Specifically, in the clinical domain, DTs have been widely used thanks to their relatively easy explainable nature, efficient computation time, and relatively accurate predictions. However, some DT constriction algorithms may produce a large tree size structure which is difficult to understand and often leads to misclassification of data in the testing process due to poor generalization. Post pruning (PP) algorithms have been introduced to reduce the size of the tree structure with a minor (or not at all) decrease in the accuracy of classification while trying to improve the model’s generalization. In this paper, we propose a new Boolean satisfiability (SAT) based PP algorithm called SAT-PP. Our algorithm reduces the tree size while preserving the accuracy of the unpruned tree. We implemented our algorithm on a medical-related classification data sets since in medical-related tasks we emphatically try to avoid decreasing the model’s performance when better training is not an option. Namely, in the case of medical-related tasks, one may prefer an unpruned DT model to a pruned DT model with worse performance. Indeed, we empirically obtained that the SAT-PP algorithm produce the same accuracy and F1 score as the DT model without PP while statistically significantly reducing the model size and as a result computation time (6.8%). In addition, we compared the proposed algorithm with other PP algorithms and found similar generalization capabilities.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/sat_pp.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bunimovich-Mendrazitsky, S., Decision tree post-pruning without loss of accuracy using the SAT-PP algorithm with an empirical evaluation on clinical data. Data & Knowledge Engineering. 2023."}],
		 "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky",
         "year": 2023,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Data & Knowledge Engineering",
         "publicationStatus":"Published"
      },
	{
         "name":"Intervention Policy Influence on the Effect of Epidemiological Crisis on Industry-Level Production Through Input-Output Networks",
         "description":"During a global epidemiological crisis, lockdowns and border closures substantially disrupt international supply chains, underscoring the importance of choosing an intervention policy that accounts for the unique structure of input-output linkages among domestic industries. This study develops a pioneering mathematical model to quantify the role of pandemic-related intervention policies in the economic impact of a pandemic outbreak in an economy where sectors are complements throughout input-output networks. Our approach is based on three pillars - epidemiological, social, and economic sub-models. Moreover, we present in silico computer simulations to examine the influence of work capsules, work-from-home, vaccination, and industry closure on the damage a pandemic could inflict on output at the industry level. A comparison between work capsules and work-from-home policies shows that the latter decreases economic loss much more than the former. Compared to a state without interventions, a work-from-home policy affecting 12% of the workforce will decrease output loss by 1.4 percentage points during an epidemiological crisis following a COVID-19-like outbreak. Under the constraint of choosing one intervention policy, vaccination significantly reduces the loss of output, particularly in industries that require close customer-seller contacts. In the analysis of scenarios of integrating intervention policies, it is found that, using direct marginal contribution as the measure, the vaccination intervention is approximately 4.5 times more effective in reducing output loss than the work-from-home intervention.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/covid_eco_networks.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Shami, L., Bunimovich-Mendrazitsky, S., Intervention Policy Influence on the Effect of Epidemiological Crisis on Industry-Level Production Through Input-Output Networks. Socio-Economic Planning Sciences. 2023."}],
		 "authors": "Teddy Lazebnik, Labib Shami, Svetlana Bunimovich-Mendrazitsky",
         "year": 2023,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"Socio-Economic Planning Sciences",
         "publicationStatus":"Published"
      },
	{
         "name":"Implementing Machine Learning Methods in Estimating the Size of the Non-observed Economy",
         "description":"Even though the literature on unregistered economic activity is growing at an increasing rate, we commonly encounter simple ordinary least squares methods and panel regressions, largely ignoring the recent rapid developments in machine learning methods. This study provides a new approach to more accurately estimate the size of the non-observed economy using machine learning methods. Compared to two currency demand-based models used to estimate the size of the non-observed economy, we show that a Random Forest algorithm can more accurately estimate the demand for currency, which is known to provide a fair estimation of the unregistered economic activity. The proposed approach shows superior forecasting capabilities compared to the current state-of-the-art linear regression-based methods dedicated to estimating non-observed economic activity.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/ml_black_economy.pdf"},
					  {"info": "cite", "type": 3, "link": "Shami, L., Lazebnik, T., Implementing Machine Learning Methods in Estimating the Size of the Non-observed Economy. Computational Economics. 2023."}],
		 "authors": "Labib Shami, Teddy Lazebnik",
         "year": 2023,
         "topic":"Economic",
         "type":"Paper",
         "publisher":"Computational Economics",
         "publicationStatus":"Published"
      },
	{
         "name":"Financing and managing epidemiological-economic crises: Are we ready for another outbreak?",
         "description":"An epidemiological-economic crisis presents countries with two significant challenges, in addition to the health challenge - a growing deficit due to fiscal policy measures, and a shortage of essential workers needed to manage the crisis successfully. In this study, we propose an outline for economic readiness in case of a future crisis in general, and a pandemic outbreak in particular. Through the establishment of a dedicated income-based tax-financed budget aimed at funding government excess expenditure during a crisis, and by adopting a reserve program in the essential sector of the economy, social and economic costs can be reduced.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/economy_for_pandemic.pdf"},
					  {"info": "cite", "type": 3, "link": "Shami, L., Lazebnik, T., Financing and managing epidemiological-economic crises: Are we ready for another outbreak?. Journal of Policy Modeling. 2023."}],
		 "authors": "Labib Shami, Teddy Lazebnik",
         "year": 2023,
         "topic":"Economic",
         "type":"Paper",
         "publisher":"Journal of Policy Modeling",
         "publicationStatus":"Published"
      },
	{
         "name":"The Causal Role of Lockdowns in COVID-19: Conclusions From Daily Epidemiological, Psychological, and Sociological Data",
         "description":"Much has been written about the COVID-19 pandemic’s epidemiological, psychological, and sociological consequences. Yet, the question about the role of the lockdown policy from psychological and sociological points of view has not been sufficiently addressed. Using epidemiological, psychological, and sociological daily data, we examined the causal role of lockdown and variation in morbidity referring to emotional and behavioral aspects. Dynamics of support requests to the Sahar organization concerning loneliness, depression, anxiety, family difficulties, and sexual trauma were investigated alongside processes of emergency and domestic violence reports to the Ministry of Welfare and Social Affairs. By exploring the signals and predictive modeling for a situation with no lockdown implementation, the lockdown was found as a critical factor in distress rising among the general population, which could affect long after the improvement in pandemic case counts. Applications and implications are discussed in the context of decision-making in dealing with crises as well as the need to allocate resources for adaptive coping.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/psycho.pdf"},
					  {"info": "cite", "type": 3, "link": "Vardi, N., Lazebnik, T. The Causal Role of Lockdowns in COVID-19: Conclusions From Daily Epidemiological, Psychological, and Sociological Data. Psychiatric Quarterly. 2023."}],
		 "authors": "Vardi Noa, Teddy Lazebnik",
         "year": 2023,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Psychiatric Quarterly",
         "publicationStatus":"Published"
      },
	{
         "name":"A computational framework for physics-informed symbolic regression with straightforward integration of domain knowledge",
         "description":"Discovering a meaningful symbolic expression that explains experimental data is a fundamental challenge in many scientific fields. We present a novel, open-source computational framework called Scientist-Machine Equation Detector (SciMED), which integrates scientific discipline wisdom in a scientist-in-the-loop approach, with state-of-the-art symbolic regression (SR) methods. SciMED combines a wrapper selection method, that is based on a genetic algorithm, with automatic machine learning and two levels of SR methods. We test SciMED on five configurations of a settling sphere, with and without aerodynamic non-linear drag force, and with excessive noise in the measurements. We show that SciMED is sufficiently robust to discover the correct physically meaningful symbolic expressions from the data, and demonstrate how the integration of domain knowledge enhances its performance. Our results indicate better performance on these tasks than the state-of-the-art SR software packages , even in cases where no knowledge is integrated. Moreover, we demonstrate how SciMED can alert the user about possible missing features, unlike the majority of current SR systems.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/liron_simon.pdf"},
					  {"info": "cite", "type": 3, "link": "Simon-Keren, L., Liberzon, A., Lazebnik, T., A computational framework for physics-informed symbolic regression with straightforward integration of domain knowledge. Scientific Reports. 2023."}],
		 "authors": "Liron Simon-Keren, Alex Liberzon, Teddy Lazebnik",
         "year": 2022,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Scientific Reports",
         "publicationStatus":"Published"
      },
	{
         "name":"High Resolution Spatio-Temporal Model for Room-Level Airborne Pandemic Spread",
         "description":"Airborne pandemics have caused millions of deaths worldwide, large-scale economic losses, and catastrophic sociological shifts in human history. Researchers have developed multiple mathematical models and computational frameworks to investigate and predict pandemic spread on various levels and scales such as countries, cities, large social events, and even buildings. However, attempts of modeling airborne pandemic dynamics on the smallest scale, a single room, have been mostly neglected. As time indoors increases due to global urbanization processes, more infections occur in shared rooms. In this study, a high-resolution spatio-temporal epidemiological model with airflow dynamics to evaluate airborne pandemic spread is proposed. The model is implemented, using Python, with high-resolution 3D data obtained from a light detection and ranging (LiDAR) device and computing model based on the Computational Fluid Dynamics (CFD) model for the airflow and the Susceptible–Exposed–Infected (SEI) model for the epidemiological dynamics. The pandemic spread is evaluated in four types of rooms, showing significant differences even for a short exposure duration. We show that the room’s topology and individual distribution in the room define the ability of air ventilation to reduce pandemic spread throughout breathing zone infection.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/aura_1.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Alexi, A., High Resolution Spatio-Temporal Model for Room-Level Airborne Pandemic Spread. Mathematics. 2023."}],
		 "authors": "Teddy Lazebnik, Ariel Alexi",
         "year": 2023,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"Mathematics",
         "publicationStatus":"Published"
      },
	{
         "name":"Bounding Pandemic Spread By Heat Spread",
         "description":"The beginning of a pandemic is a crucial stage for policymakers. Proper management at this stage can reduce overall health and economical damage. However, knowledge about the pandemic is insufficient. Thus, the use of complex and sophisticated models is challenging. In this study, we propose analytical and stochastic heat spread-based boundaries for the pandemic spread as indicated by the SusceptibleInfected-Recovered (SIR) model. We study the spread of a pandemic on aninteraction (social) graph as a diffusion and compared it with the stochastic SIR model. The proposed boundaries are not requiring accurate biological knowledge such as the SIR model does.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/sir_heat_spread.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Itai, U., Bounding Pandemic Spread By Heat Spread. Journal of Engineering Mathematics. 2023."}],
		 "authors": "Teddy Lazebnik, Uri Itai",
         "year": 2023,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"Journal of Engineering Mathematics  ",
         "publicationStatus":"Published"
      },
	{
         "name":"Mathematical model of coffee tree’s rust control using snails as biological agents",
         "description":"Coffee rust is one of the main diseases that affect coffee plantations worldwide, causing large-scale ecological and economic damage. While multiple methods have been proposed to tackle this challenge, using snails as biological agents have shown to be the most consistent and promising approach. However, snails are an invasive species, and overusing them can cause devastating outcomes. In this paper, we develop and explore an ecological–epidemiological mathematical model for the coffee tree rust pandemic control using snails as biological agents. We analyze the equilibria of the proposed system with their stability properties. In addition, we perform numerical analysis to obtain the sensitivity of the system to different changes and manipulation of the snails pandemic control, under specific conditions. Finally, we propose an in silico mechanism to obtain an analytical connection between the system’s initial condition and the number of snails needed to optimally control the rust pandemic spread while preventing the snail population to grow unmanageably. Our model can be used to optimize the usage of snails as biological agents to control the rust pandemic in spatially-small areas, by predicting the number of snails one needs to introduce to the ecosystem in order to obtain a desired outcome.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/coffee_first.pdf"},
					  {"info": "cite", "type": 3, "link": "Herskowitzת Y., Bunimovich-Mendrazitsky, S., Lazebnik, T., Mathematical model of coffee tree’s rust control using snails as biological agents. Biosystems. 2023."}],
		 "authors": "Yonatan Herskowitz, Svetlana Bunimovich-Mendrazitsky, Teddy Lazebnik",
         "year": 2023,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"Biosystems",
         "publicationStatus":"Published"
      },
	{
         "name":"Early Detection and Control of the Next Epidemic Wave Using Health Communications: Development of an Artificial Intelligence-Based Tool and Its Validation on COVID-19 Data from the US",
         "description":"Social media networks highly influence on a broad range of global social life, especially in the context of a pandemic. We developed a mathematical model with a computational tool, called EMIT (Epidemic and Media Impact Tool), to detect and control pandemic waves, using mainly topics of relevance on social media networks and pandemic spread. Using EMIT, we analyzed health-related communications on social media networks for early prediction, detection, and control of an outbreak. EMIT is an artificial intelligence-based tool supporting health communication and policy makers decisions. Thus, EMIT, based on historical data, social media trends and disease spread, offers an predictive estimation of the influence of public health interventions such as social media-based communication campaigns. We have validated the EMIT mathematical model on real world data combining COVID-19 pandemic data in the US and social media data from Twitter. EMIT demonstrated a high level of performance in predicting the next epidemiological wave (AUC = 0.909, F1 = 0.899).",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/ijerph.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bunimovich-Mendrazitsky, S., Ashkenazi, S., Levner, E., Benis. A., Early Detection and Control of the Next Epidemic Wave Using Health Communications: Development of an Artificial Intelligence-Based Tool and Its Validation on COVID-19 Data from the US. International Journal of Environmental Research and Public Health. 2022."}],
		 "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky, Shai Ashkenazi, Eugene Levner, Arriel Benis",
         "year": 2022,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"International Journal of Environmental Research and Public Health",
         "publicationStatus":"Published"
      },
	{
         "name":"A Security Games Inspired Approach for Distributed Control of Pandemic Spread",
         "description":"Pandemics are a source of extensive mortality, economic impairment, and dramatic social fluctuation. Once a pandemic occurs, policymakers are faced with the highly challenging task of controlling it over time and space. In this article, a novel pandemic intervention policy that relies on the strategic deployment of inspection units (IUs) is proposed. These IUs are allocated in the environment, represented as a graph, and sample individuals who pass through the same node. If a sampled individual is identified as infected, she is extracted from the environment until she recovers (or dies). A realistic simulation‐based evaluation of the Influenza A pathogen using both synthetic and real‐world data is provided. The results demonstrate potential significant benefits of the proposed PIP in mitigating a pandemic spread which can complement other standard policies such as social distancing and mask-wearing.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/iu_pandemic.pdf"},
					  {"info": "cite", "type": 3, "link": "Alexi, A., Rosenfeld, A., Lazebnik, T., A Security Games Inspired Approach for Distributed Control of Pandemic Spread. Advanced Theory and Simulations. 2022."}],
		 "authors": "Ariel Alexi, Ariel Rosenfeld, Teddy Lazebnik",
         "year": 2022,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"Advanced Theory and Simulations",
         "publicationStatus":"Published"
      },
	{
         "name":"The Trade-Off between Airborne Pandemic Control and Energy Consumption Using Air Ventilation Solutions",
         "description":"A single paragraph of about 200 words maximum. For research articles, abstracts should give a pertinent overview of the work. We strongly encourage authors to use the following style of structured abstracts, but without headings: (1) Background: place the question addressed in a broad context and highlight the purpose of the study; (2) Methods: describe briefly the main methods or treatments applied; (3) Results: summarize the article’s main findings; (4) Conclusions: indicate the main conclusions or interpretations. The abstract should be an objective representation of the article, it must not contain results which are not presented and substantiated in the main text and should not exaggerate the main conclusions. Airborne diseases cause high mortality and adverse socioeconomic consequences. Due to urbanization, more people spend more time indoors. According to recent research, air ventilation reduces long-range airborne transmission in indoor settings. However, air ventilation solutions often incur significant energy costs and ecological footprints. The trade-offs between energy consumption and pandemic control indoors have not yet been thoroughly analyzed. In this work, we use advanced sensors to monitor the energy consumption and pandemic control capabilities of an air-conditioning system, a pedestal fan, and an open window in hospital rooms, classrooms, and conference rooms. A simulation of an indoor airborne pandemic spread of Coronavirus (COVID-19) is used to analyze the Pareto front. For the three examined room types, the Pareto front consists of all three air ventilation solutions, with some ventilation configurations demonstrating significant inefficiencies. Specifically, air-conditioning is found to be efficient only at a very high energy cost and fans seem to pose a reasonable alternative. To conclude, a more informed ventilation policy can bring about a more desirable compromise between energy consumption and pandemic spread control.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/sensors_alexi.pdf"},
					  {"info": "cite", "type": 3, "link": "Alexi, A., Rosenfeld, A., Lazebnik, T., The Trade-Off between Airborne Pandemic Control and Energy Consumption Using Air Ventilation Solutions. Sensors. 2022."}],
		 "authors": "Ariel Alexi, Ariel Rosenfeld, Teddy Lazebnik",
         "year": 2022,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"Sensors",
         "publicationStatus":"Published"
      },
	{
         "name":"Economic aspects of the detection of new strains in a multi-strain epidemiological–mathematical model",
         "description":"Mankind has struggled with pathogens throughout history. In this context, the contribution of vaccines to the continued economic and social prosperity of humanity is enormous, but it is constantly threatened by the development of vaccine-resistant strains of the pathogen. In this study, we investigate the usage of genomic sequencing tests to detect new strains of a pathogen in a multi-strain pandemic scenario using a mathematical–epidemiological–genomic–economic model. Our model provides a theoretical framework to explore the influence of an extensive number of pharmaceutical interventions in a dynamic multi-strain pandemic. Specifically, we show that while a genomic sequence testing policy can be both economically and epidemiologically efficient, a random sample of the population provides sub-optimal results. Moreover, we demonstrate that the optimal policy is sensitive to the social and economic settings of the population, and provide a machine learning based model that offers a solution to these challenges.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/chaos.pdf"},
					  {"info": "cite", "type": 3, "link": "Shami, L., Lazebnik, T., Economic aspects of the detection of new strains in a multi-strain epidemiological–mathematical model. Chaos, Solitons & Fractals. 2022."}],
		 "authors": "Labib Shami, Teddy Lazebnik",
         "year": 2022,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Chaos, Solitons & Fractals",
         "publicationStatus":"Published"
      },
	{
         "name":"Cell-level Spatio-Temporal Model for Bacillus Calmette--Guerin Based Immunotherapy Treatment Protocol of Superficial Bladder Cancer",
         "description":"Bladder cancer is one of the most widespread types of cancer. Multiple treatments for non-invasive, superficial bladder cancer have been proposed over the last several decades with a weekly Bacillus Calmette–Guérin immunotherapy-based therapy protocol, which is considered the gold standard today. Nonetheless, due to the complexity of the interactions between the immune system, healthy cells, and cancer cells in the bladder’s microenvironment, clinical outcomes vary significantly among patients. Mathematical models are shown to be effective in predicting the treatment outcome based on the patient’s clinical condition at the beginning of the treatment. Even so, these models still have large errors for long-term treatments and patients that they do not fit. In this work, we utilize modern mathematical tools and propose a novel cell-level spatio-temporal mathematical model that takes into consideration the cell–cell and cell–environment interactions occurring in a realistic bladder’s geometric configuration in order to reduce these errors. We implement the model using the agent-based simulation approach, showing the impacts of different cancer tumor sizes and locations at the beginning of the treatment on the clinical outcomes for today’s gold-standard treatment protocol. In addition, we propose a genetic-algorithm-based approach to finding a successful and time-optimal treatment protocol for a given patient’s initial condition. Our results show that the current standard treatment protocol can be modified to produce cancer-free equilibrium for deeper cancer cells in the urothelium if the cancer cells’ spatial distribution is known, resulting in a greater success rate.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/cells-11-02372.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Cell-Level Spatio-Temporal Model for a Bacillus Calmette–Guérin-Based Immunotherapy Treatment Protocol of Superficial Bladder Cancer. Cells. 2022."}],
		 "authors": "Teddy Lazebnik",
         "year": 2022,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Cells",
         "publicationStatus":"Published"
      },
	{
         "name":"Providing Safe Space for Honest Mistakes in the Public Sector Is the Most Important Predictor for Work Engagement after Strategic Clarity",
         "description":"Multiple studies highlight the link between engagement at work and performance, influencing organizations to put more effort into improving employee engagement levels. In this study, we begin to examine the influence of multiple psychological parameters on employees’ work engagement (WE) within the public sector. The idea is to break the concept of WE down into eight individually measurable parameters that will allow for a better understanding and development of stronger interventions. Based on this analysis, we reproduce the outcome that strategic clarity is the most connected property to WE. More importantly, we introduce a new concept, honest mistakes, and show that having a safe space for making mistakes and learning from it is the second most important property of WE. This result is of interest, as allowing mistakes, even if they were made innocently, is considered taboo in the public sector. These outcomes are based on the reports of n=7682 public sector employees from Brazil. In particular, the analysis shows that these outcomes hold for both professional and management positions across the health, administrative, justice, police, social work, and education offices. ",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/sustainability-14-07051.pdf"},
					  {"info": "cite", "type": 3, "link": "Gargantini, T., Daly, M., Sherlock, J., Lazebnik, T., Providing Safe Space for Honest Mistakes in the Public Sector Is the Most Important Predictor for Work Engagement after Strategic Clarity. Sustainability. 2022."}],
		 "authors": "Thais Gargantini, Michael Daly, Joseph Sherlock, Teddy Lazebnik",
         "year": 2022,
         "topic":"Social",
         "type":"Paper",
         "publisher":"Sustainability",
         "publicationStatus":"Published"
      },
	{
         "name":"Predicting acute kidney injury following open partial nephrectomy treatment using SAT-pruned explainable machine learning model",
         "description":"Background: One of the most prevalent complications of Partial Nephrectomy (PN) is Acute Kidney Injury (AKI), which could have a negative impact on subsequent renal function and occurs in up to 24.3% of patients undergoing PN. The aim of this study was to predict the occurrence of AKI following PN using preoperative parameters by applying machine learning algorithms. Methods We included all adult patients (n = 723) who underwent open PN in our department since 1995 and on whom we have data on the pre-operative renal function. We developed a random forest (RF) model with Boolean satisfaction-based pruned decision trees for binary classification (AKI or non-AKI). Hyper-parameter grid search was performed to optimize the model's performance. Fivefold cross-validation was applied to evaluate the model. We implemented a RF model with greedy feature selection to binary classify AKI and non-AKI cases based on pre-operative data. Results The best model obtained a 0.69 precision and 0.69 recall in classifying the AKI and non-AKI groups on average (k = 5). In addition, the model's probability to correctly classify a new prediction is 0.75. The proposed model is available as an online calculator. Conclusions Our model predicts the occurrence of AKI following open PN with (75%) accuracy. We plan to externally validate this model and modify it to minimally-invasive PN.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/aki_paper.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bahouth, Z., Bunimovich-Mendrazitsky, S., Halachmi, S., Predicting acute kidney injury following open partial nephrectomy treatment using SAT-pruned explainable machine learning model. BMC Medical Informatics and Decision Making. 2022."}],
		 "authors": "Teddy Lazebnik, Zaher Bahouth, Svetlana Bunimovich-Mendrazitsky, Sarel Halachmi",
         "year": 2022,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"BMC Medical Informatics and Decision Making",
         "publicationStatus":"Published"
      },
	{
         "name":"Generic approach for mathematical model of multi-strain pandemics",
         "description":"Multi-strain pandemics have emerged as a major concern. We introduce a new model for assessing the connection between multi-strain pandemics and mortality rate, basic reproduction number, and maximum infected individuals. The proposed model provides a general mathematical approach for representing multi-strain pandemics, generalizing for an arbitrary number of strains. We show that the proposed model fits well with epidemiological historical world health data over a long time period. From a theoretical point of view, we show that the increasing number of strains increases logarithmically the maximum number of infected individuals and the mean mortality rate. Moreover, the mean basic reproduction number is statistically identical to the single, most aggressive pandemic strain for multi-strain pandemics.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/multi_strain_model.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bunimovich-Mendrazitsky, S., Generic approach for mathematical model of multi-strain pandemics. Plos One. 2022."}],
		 "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky",
         "year": 2022,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"PLOS ONE",
         "publicationStatus":"Published"
      },
	  {
         "name":"A distinction of three online learning pedagogic paradigms",
         "description":"Online (web-based) courses emerged at the beginning of the twenty-first century. While this new pedagogic paradigm (PP) holds a promise of better learning and training, it comes with challenges as traditional PPs are not suited to the new settings which highly differ from the physical classroom methods. We studied three online PPs (Synchronous, Asynchronous, and Asynchronous with an audience) and their influence on the students learning process and achievements during an academic mathematics course that was conducted online. 168 students took an exam and answered a questionnaire regarding their learning preferences, experience, and habits after experiencing one of these PPs. We found that students who studied according to the asynchronous with an audience PP achieved a higher score in the exam, regardless of their initial level than students who learned by either the synchronous or asynchronous PPs. In addition, we developed a personalized model based on machine learning methods that match an online PP for each student to maximize the student’s score in the exam. In the case of an academic mathematical course, the online PP had a major influence on the students’ scores in the exam. We found that students with high grades in previous courses preferred synchronous learning, which indicates the importance of picking the right online PP for each student. Our model provides a novel tool for the pedagogic community to personalize online learning by recommending the PP that could be most suitable for each student.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/remote_learning_paper.pdf"},
					  {"info": "cite", "type": 3, "link": "Natan, S., Lazebnik, T., Lerner, E., A distinction of three online learning pedagogic paradigms. SN Social Science. 2022."}],
		 "authors": "Sarit Natan, Teddy Lazebnik, Elisa Lerner",
         "year": 2022,
         "topic":"Social",
         "type":"Paper",
         "publisher":"SN Social Science",
         "publicationStatus":"Published"
      },
      {
         "name":"A Systematic Review of the Behavioural Changes and Physiological Adjustments of Elasmobranchs and Teleost’s to Ocean Acidification with a Focus on Sharks",
         "description":"In recent years, much attention has been focused on the impact of climate change, particularly via ocean acidification (OA), on marine organisms. Studying the impact of OA on long-living organisms, such as sharks, is especially challenging. When the ocean waters absorb anthropogenic carbon dioxide (CO2), slow-growing shark species with long generation times may be subjected to stress, leading to a decrease in functionality. Our goal was to examine the behavioral and physiological responses of sharks to OA and the possible impacts on their fitness and resilience. We conducted a systematic review in line with PRISMA-Analyses, of previously reported scientific experiments. We found that most studies used CO2 partial pressures (pCO2) that reflect representative concentration pathways for the year 2100 (e.g., pH ~7.8, pCO2 ~1000 μatm). Since there is a considerable knowledge gap on the effect of OA on sharks, we utilized existing data on bony fish to synthesize the available knowledge. Given the similarities between the behaviors and physiology of these two superclasses’ to changes in CO2 and pH levels, there is merit in including the available information on bony fish as well. Several studies indicated a decrease in shark fitness in relation to increased OA and CO2 levels. However, the decrease was species-specific and influenced by the intensity of the change in atmospheric CO2 concentration and other anthropogenic and environmental factors (e.g., fishing, temperature). Most studies involved only limited exposure to future environmental conditions and were conducted on benthic shark species studied in the laboratory rather than on apex predator species. While knowledge gaps exist, and more research is required, we conclude that anthropogenic factors are likely contributing to shark species’ vulnerability worldwide. However, the impact of OA on the long-term stability of shark populations is not unequivocal.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/fish.pdf"},
					  {"info": "cite", "type": 3, "link": "Zemah-Shamir et al. A Systematic Review of the Behavioural Changes and Physiological Adjustments of Elasmobranchs and Teleost’s to Ocean Acidification with a Focus on Sharks. Fishes. 2022."}],
		 "authors": "Ziv Zemah-Shamir, Shiri Zemah-Shamir, Aviad Scheinin, Dan Tchernov, Teddy Lazebnik, and Gideon Gal",
         "year": 2022,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Fishes",
         "publicationStatus":"Published"
      },
      {
         "name":"Advanced Muti-Mutation with Intervention Policies Pandemic Model",
         "description":"A pandemic is a threat to humanity with potentially millions of deaths worldwide. Epidemiological models can be used to better understand pandemic dynamics and assist policymakers in optimizing their Intervention Policies (IPs). Most existing epidemiological models assume, sometimes incorrectly, that a pandemic is caused by a single pathogen, ignoring pathogen mutations over time that result in different pathogen variants with different characteristics. In addition, the existing models do not incorporate the effect of IPs like vaccinations and lockdowns during the fitting phase. In this work, we introduce a new multi-mutation model called Suspected-Infected-Vaccinated-Recovered-reInfected (SIVRI). This model extends the SIRS model with adaptation to incorporate available knowledge related to the different pathogen mutations together with multiple IPs. In order to find the model parameters we propose a new fitting procedure that supports the complex social, epidemiological, and clinical dynamics that occur during a pandemic. We examine the suggested SIVRI model in comparison to the SIRS and XGboost models on the COVID-19 pandemic in Israel that includes four COVID-19 mutations, and the vaccination and lockdown IPs. We show that the proposed model can fit accurately to the historical data and outperform the existing models in predictions of basic reproduction number, mortality rate, and severely infected individuals rate.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/ieee_paper.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Blumrosen, G. Advanced Muti-Mutation with Intervention Policies Pandemic Model. IEEE Access. 2022."}],
		 "authors": "Teddy Lazebnik, Gaddi Blumrosen",
         "year": 2022,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"IEEE Access",
         "publicationStatus":"Published"
      },
      {
         "name":"Computer aided functional style identifcation and correction in modern Russian texts",
         "description":"Functional style (FS) identification is a classification task in linguistics that categorizes unrestricted texts into several categories of linguistic norms. FS is widely used to attain a satisfying outcome in style processing. As such, we train a deep learning attention neural network model on modern-Russian texts, divide them into four FS categories. The model obtained an accuracy of 0.72. In particular, 81.08% and 85.71% accuracy in classifying the artistic and academic FS. The proposed model is able to automate the FS identification process and aids both domain experts and non-domain experts to perform FS correction by highlighting style anomalies concerning a desired style for the text. In particular, we show a 34% and 31% average improvement in the duration of performing the style correction task. Moreover, domain experts and non-domain experts obtain 3% and 9% more accurate results, respectively.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/liza_paper.pdf"},
					  {"info": "cite", "type": 3, "link": "Savchenko, E., Lazebnik, T., Computer aided functional style identifcation and correction in modern russian texts. Journal of Data, Information and Management. 2022."}],
		 "authors": "Elizaveta Savchenko, Teddy Lazebnik",
         "year": 2022,
         "topic":"Machine Learning",
         "type":"Paper",
         "publisher":"Journal of Data, Information and Management",
         "publicationStatus":"Published"
      },
      {
         "name":"Comparison of pandemic intervention policies in several building types using heterogeneous population model",
         "description":"In a world where pandemics are a matter of time and increasing urbanization of the world’s population, governments should be prepared with pandemic intervention policies (IPs) to minimize the crisis direct and indirect adverse effects while keeping normal life as much as possible. Successful pandemic IPs have to take into consideration the heterogeneous behavior of individuals in different types of buildings and social contexts. In this study, we propose a spatio-temporal, heterogeneous population model and in silico simulation to evaluate pandemic IPs in four types of buildings - home, office, school, and mall. We show that indeed each building type has a unique pandemic spread and therefore a different optimal IP. Moreover, we show that temporal-based IPs (such as mask wearing) have a similar influence on the pandemic spread in all four building types while spatial-based IPs (such as social distance) highly differ.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/indoor_pandemic.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Alexi, A., Comparison of pandemic intervention policies in several building types using heterogeneous population model. Communications in Nonlinear Science and Numerical Simulation. 2021."}],
		 "authors": "Teddy Lazebnik, Ariel Alexi",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"Communications in Nonlinear Science and Numerical Simulation",
         "publicationStatus":"Published"
      },
      {
         "name":"Improved Geometric Configuration for the Bladder Cancer BCG-Based Immunotherapy Treatment Model",
         "description":"We present an extension to the model proposed by Lazebnik et al. (2021) by improving the approximation of the bladder’s geometry from sphere-ring to ellipsoid-ring [2]. We show the differences between the models on the clinical results and their influence on the optimal treatment protocol.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/ISMCO_2021.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bunimovich-Mendrazitsky, S., Improved Geometric Configuration for the Bladder Cancer BCG-Based Immunotherapy Treatment Model. International Symposium on Mathematical and Computational Oncology. 2021, pp. 63-67."}],
		 "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Conference",
         "publisher":"International Symposium on Mathematical and Computational Oncology",
         "publicationStatus":"Published"
      },
      {
         "name":"Pandemic Management by a Spatio-temporal Mathematical Model",
         "description":"Many researchers have tried to predict the impact of the COVID-19 outbreak on morbidity, in order to help policy-makers find optimal isolation policies. However, despite the development and use of many models and sophisticated tools, these forecasting attempts have largely failed. We present a model that considers the severity of the disease and the heterogeneity of contacts between the population in complex space-time dynamics. Using mathematical and computational methods, the applied tool was developed to analyze and manage the COVID-19 pandemic (from an epidemiological point of view), with a particular focus on population heterogeneity in terms of age, susceptibility, and symptom severity. We show improved strategies to prevent an epidemic outbreak. We evaluated the model in three countries, obtaining an average mean square error of 0.067 over a full month of the basic reproduction number (R0). The goal of this study is to create a theoretical framework for crisis management that integrates accumulated epidemiological considerations. An applied result is an open-source program for predicting the outcome of an isolation strategy for future researchers and developers who can use and extend our model.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/Pandemic_Management.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Shami, L., Bunimovich-Mendrazitsky, S., Pandemic Management by a Spatio-temporal Mathematical Model. International Journal of Nonlinear Sciences and Numerical Simulation. 2021."}],
		 "authors": "Teddy Lazebnik, Labib Shami, Svetlana Bunimovich-Mendrazitsky",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"IJNSNS",
         "publicationStatus":"Published"
      },
      {
         "name":"PDE based geometry model for BCG immunotherapy of bladder cancer",
         "description":"Optimal BCG-based immunotherapy treatment protocol for bladder cancer mathematical model that taking into considuration approximation of the geometrical configuration of the human bladder using PDE modeling Optimal BCG-based immunotherapy treatment protocol for bladder cancer mathematical model that taking into considuration approximation of the geometrical configuration of the human bladder using PDE modeling",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/pde_biosystem_paper.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Aaroni, N., Bunimovich-Mendrazitsky, S., PDE based geometry model for BCG immunotherapy of bladder cancer. BioSystems. 2020."}],
		 "authors": "Teddy Lazebnik, Niva Aaroni, and Svetlana Bunimovich-Mendrazitsky",
         "year": 2020,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"biosystems",
         "publicationStatus":"Published"
      },
      {
         "name":"Treatment of Bladder Cancer Using BCG Immunotherapy: PDE Modeling",
         "description":"Optimal BCG-based immunotherapy treatment protocol for bladder cancer mathematical model that taking into considuration approximation of the geometrical configuration of the human bladder using PDE modelingOptimal BCG-based immunotherapy treatment protocol for bladder cancer mathematical model that taking into considuration approximation of the geometrical configuration of the human bladder using PDE modeling.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/Treatment_of_Bladder_Cancer_Using_BCG_Immunotherapy.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Yanetz, S., Bunimovich-Mendrazitsky, S., Aaroni, N., Treatment of Bladder Cancer Using BCG Immunotherapy: PDE Modeling. Functional Differential Equations. 2019."}],
		 "authors": "Teddy Lazebnik, Shlomo Yanetz, Svetlana Bunimovich-Mendrazitsky, and Niva Aaroni",
         "year": 2019,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Functional Differential Equations",
         "publicationStatus":"Published"
      },
      {
         "name":"PDE Modeling of Bladder Cancer Treatment Using BCG Immunotherapy",
         "description":"Optimal BCG-based immunotherapy treatment protocol for bladder cancer mathematical model that taking into considuration approximation of the geometrical configuration of the human bladder using PDE modelingOptimal BCG-based immunotherapy treatment protocol for bladder cancer mathematical model that taking into considuration approximation of the geometrical configuration of the human bladder using PDE modeling.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/Treatment_of_Bladder_Cancer_Using_BCG_Immunotherapy.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Yanetz, S., Bunimovich-Mendrazitsky, S., Treatment of Bladder Cancer Using BCG Immunotherapy: PDE Modeling. Functional Differential Equations. 2019."}],
		 "authors": "Teddy Lazebnik, Shlomo Yanetz, and Svetlana Bunimovich-Mendrazitsky",
         "year": 2020,
         "topic":"Biomathematics",
         "type":"Conference",
         "publisher":"Functional Differential Equations conference",
         "publicationStatus":"Published"
      },
      {
         "name":"Mathematical Model for the BCG-based Treatment of Type 1 Diabetes",
         "description":"We introduces a model of immunotherapy treatment, namely the Bacillus Calmette-Guerin (BCG) vac-cine, of type 1  diabetes (T1D).",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/abstract_for_DSABNS_2022_conference.pdf"},
					  {"info": "cite", "type": 3, "link": ""}],
		 "authors": "Teddy Lazebnik and Svetlana Bunimovich-Mendrazitsky",
         "year": 2022,
         "topic":"Biomathematics",
         "type":"Abstract",
         "publisher":"Dynamical Systems Applied To Biology And Natural Science",
         "publicationStatus":"Published"
      },
      {
         "name":"Epidemiological-Economical Pandemic Management By A Spatio-Temporal Mathematical Model",
         "description":"We present a model that considers the severity of the disease and the heterogeneity of contacts between the population in complex space-time dynamics.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/abstract_for_DSABNS_2021_conference.pdf"},
					  {"info": "cite", "type": 3, "link": ""}],
		 "authors": "Teddy Lazebnik, Labib Shami, and Svetlana Bunimovich-Mendrazitsky",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Abstract",
         "publisher":"Dynamical Systems Applied To Biology And Natural Science",
         "publicationStatus":"Published"
      },
      {
         "name":"Spatio-Temporal influence of Non-Pharmaceutical interventions policies on pandemic dynamics and the economy: the case of COVID-19",
         "description":"We have developed an extended mathematical graph-based spatial-temporal SIR model, allowing a multidimensional analysis of the impact of non-pharmaceutical interventions on the pandemic spread, while assessing the economic losses caused by it. By incorporating into the model dynamics that are a consequence of the interrelationship between the pandemic and the economic crisis, such as job separation not as a result of workers’ morbidity, analysis were enriched. Controlling the spread of the pandemic and preventing outbreaks have been investigated using two NPIs: the duration of working and school days and lockdown to varying degrees among the adult and children populations. Based on the proposed model and data from the Israeli economy, allowing 7.5 working hours alongside 4.5 school hours would maximise output and prevent an outbreak, while minimising the death toll (0.48% of the population). Alternatively, an 89% lockdown among children and a 63% lockdown among adults will minimise the death toll (0.21%) while maximising output and preventing outbreaks.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/covid_second_paper.pdf"},
					  {"info": "cite", "type": 3, "link": ""}],
		 "authors": "Teddy Lazebnik, Labib Shami, and Svetlana Bunimovich-Mendrazitsky",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"Economic Research",
         "publicationStatus":"Published"
      },
      {
         "name":"Optimal Intervention Policies for the COVID-19 Pandemic Emerge from Socioeconomic-Heterogeneous Dynamics",
         "description":"The COVID-19 pandemic is a rolling crisis that required policymakers around the world to take action to manage the pandemic spread. During the period where vaccination was not available, the pandemic spread management lied in Non-Pharmaceutical Interventions (NPIs). A large number of mathematical models have been proposed to predict the pandemic spread and analyze the influence of various NPIs on multiple scenarios, getting more accurate and sophisticated over time. In this work, we review the latest mathematical models for pandemic spread NPIs and their main shortages. Specifically, the usage of modeling a homogeneous population rather than a heterogeneous one.",
         "fileLinks":[{"info": "download", "type": 1, "link": "https://www.hilarispublisher.com/open-access/optimal-intervention-policies-for-the-covid19-pandemic-emerge-from-socioeconomicheterogeneous-dynamics.pdf"},
					  {"info": "cite", "type": 3, "link": ""}],
		 "authors": "Teddy Lazebnik",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Abstract",
         "publisher":"Journal of Physical Mathematics",
         "publicationStatus":"Published"
      },
      {
         "name":"The signature features of COVID-19 pandemic in a hybrid mathematical model - implications for optimal work-school lockdown policy",
         "description":"The new COVID-19 pandemic has challenged policymakers on key issues. Most countries have adopted “lockdown” policies to reduce the spatial spread of COVID-19, but they have damaged the economic and moral fabric of society. Mathematical modeling in non-pharmaceutical intervention policy management has proven to be a major weapon in this fight due to the lack of an effective COVID-19 vaccine. We present a new \textit{hybrid} model for COVID-19 dynamics using both an age-structured mathematical model based on the SIRD model and spatio-temporal model in silico, analyzing the data of COVID-19 in Israel. Using the \textit{hybrid} model, we have introduced a method for estimating the reproduction number of an epidemic in real-time from the data of daily notification of cases. The results of the proposed model are confirmed by the Israeli Lockdown experience with a mean square error of 0.205 over two weeks. The use of mathematical models promises to reduce the uncertainty in the choice of “Lockdown” policies. Our unique use of contact details from 2 classes (children and adults), the interaction of populations depending on the time of day, and several physical locations, allowed a new look at the differential dynamics of the spread and control of infection.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/covid_first.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bunimovich-Mendrazitsky, S., The signature features of COVID-19 pandemic in a hybrid mathematical model - implications for optimal work-school lockdown policy. Advanced Theory and Simulations. 2021"}],
		 "authors": "Teddy Lazebnik and Svetlana Bunimovich-Mendrazitsky",
         "year": 2021,
         "topic":"Epidemiology",
         "type":"Paper",
         "publisher":"Advanced Theory and Simulations",
         "publicationStatus":"Published"
      },
      {
         "name":"Novel Method to Analytically Obtain the Asymptotic Stable Equilibria States of Extended SIR-Type Epidemiological Models",
         "description":"We present a new analytical method to find the asymptotic stable equilibria states based on the Markov chain technique. We reveal this method on the Susceptible-Infectious-Recovered (SIR)-type epidemiological model that we developed for viral diseases with long-term immunity memory. This is a large-scale model containing 15 nonlinear ordinary differential equations (ODEs), and classical methods have failed to analytically obtain its equilibria. The proposed method is used to conduct a comprehensive analysis by a stochastic representation of the dynamics of the model, followed by finding all asymptotic stable equilibrium states of the model for any values of parameters and initial conditions thanks to the symmetry of the population size over time.",
         "fileLinks":[{"info": "download", "type": 1, "link": "/files/symmetry_sir_paper.pdf"},
					  {"info": "cite", "type": 3, "link": "Lazebnik, T., Bunimovich-Mendrazitsky, S., Shaikhet, L., Novel Method to Analytically Obtain the Asymptotic Stable Equilibria States of Extended SIR-Type Epidemiological Models. Symmetry. 2021."}],
		 "authors": "Teddy Lazebnik, Svetlana Bunimovich-Mendrazitsky, and Leonid Shaikhet",
         "year": 2021,
         "topic":"Biomathematics",
         "type":"Paper",
         "publisher":"Symmetry",
         "publicationStatus":"Published"
      }
	  ]
}
