{
   "posts":[
      {
         "title":"The History of NLP with the Hebrew Language",
         "description":"In the post, I provide a quick review of the development of NLP technologies alongside the Hebrew language and the problems we have while using NLP in Hebrew.",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "1"}],
		 "year": 2018,
		 "month": 3,
		 "day": 1,
		 "order": 5
      },
      {
         "title":"Daily Issues and Solutions of a Nano-bioinformatic Research",
         "description":"Nano-bioinformatic research is hard. But did you know what are the real daily issues such researchers have? and more importantly, how they solve them and how this effects you?",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "2"}],
		 "year": 2019,
		 "month": 3,
		 "day": 1,
		 "order": 6
      },
      {
         "title":"3 techniques for a better quality of tagged data for ML tasks.",
         "description":"Current machine learning models require huge amount of data. How can you make assure the quality of your tagged data? Here are three techniques to do so...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "3"}],
		 "year": 2020,
		 "month": 4,
		 "day": 1,
		 "order": 7
      },
      {
         "title":"3 steps to the medicine of the future.",
         "description":"What are the next three steps that should happen when we are talking about nanomedicine in general and medical nanorobotics in particular",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "4"}],
		 "year": 2018,
		 "month": 2,
		 "day": 1,
		 "order": 4
      },
      {
         "title":"4 Things To Consider When You User-Testing Your Service",
         "description":"Large or small - few use cases from Facebook user-fitting in 3rd wolrd users from start-up prospective",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "5"}],
		 "year": 2020,
		 "month": 8,
		 "day": 1,
		 "order": 10
      },
      {
         "title":"The math behind the Coronavirus spread",
         "description":"Covid-19 pandemic hit the wolrd at the beginning of 2020 and lead to hundrieds of mathematical models predicting the spread of the pandemic wolrdwide. Here I offer a basic review of some of these methods",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "6"}],
		 "year": 2020,
		 "month": 5,
		 "day": 1,
		 "order": 9
      },
      {
         "title":"Why should you use dotnet core for your next AI project production?",
         "description":"Python, maybe JavaScript are considrued as the leading ML and AI language to go. But, in production you should considr dotnet core... In this post, we explain why",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "7"}],
		 "year": 2020,
		 "month": 5,
		 "day": 1,
		 "order": 8
      },
      {
         "title":"Most interesting people in history knew this fact",
         "description":"Can you pin point the propertise of what making a person interesting? well, we can",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "8"}],
		 "year": 2016,
		 "month": 7,
		 "day": 1,
		 "order": 1
      },
      {
         "title":"Medical Nanorobotics - Science or Science Fiction?",
         "description":"Nanorobotics is a new kind of robotics with can be defined as 'The technology of creating machines or robots close to the scale of a nanometre'...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "9"}],
		 "year": 2017,
		 "month": 4,
		 "day": 1,
		 "order": 3
      },
      {
         "title":"The Connection Between Archery And Programming",
         "description":"This may sound strange but there is actully really intresting connection, you should check it out",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "10"}],
		 "year": 2017,
		 "month": 2,
		 "day": 1,
		 "order": 2
      },
      {
         "title":"Distributed Computing Based Drugs",
         "description":"How a lot of small and without any computational power particles can make our drugs better? check out and find out",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "11"}],
		 "year": 2021,
		 "month": 1,
		 "day": 1,
		 "order": 11
      },
      {
         "title":"Birds Flocking And Drugs Are Basically The Same",
         "description":"Imagine you are an world-class zoologist studying the flight of a new species of excotic birds your recently descovered...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "12"}],
		 "year": 2021,
		 "month": 2,
		 "day": 1,
		 "order": 12
      },
      {
         "title":"A Few Lessons From Adversarial, Multi-agent Reinforcement Learning Project",
         "description":"Do you have a RL project? does it in an Adversarial settings and with multi-agents? you should do the following...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "13"}],
		 "year": 2021,
		 "month": 2,
		 "day": 15,
		 "order": 13
      },
      {
         "title":"Do You Need Portfolio Project As A Junior Developer? Make Online Game!",
         "description":"Are you a jounier developer? If so, you probabliy need a protfolio projects to show off your skills. You do not need to look further, pick a lovable game. This is way...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "14"}],
		 "year": 2021,
		 "month": 3,
		 "day": 1,
		 "order": 14
      },
      {
         "title":"[Coding Post] The graphs every AI developer must know and their python implementation",
         "description":"If you an AI / Machine Learning / Data Science and doing a project, you probabliy should print one or more of these graphs to really understand what is going on...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "15"}],
		 "year": 2021,
		 "month": 3,
		 "day": 15,
		 "order": 15
      },
      {
         "title":"[Technical Post] Novel Method For Using Unsupervised Deep Learning for PDE-based Problems",
         "description":"A summery of an academic paper propoing a neural network-based algorithm for solving forward and inverse problems for partial differential equations (PDE) in unsupervised fashion with mash free and for arbitrary regular domain...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "16"}],
		 "year": 2021,
		 "month": 4,
		 "day": 1,
		 "order": 16
      },
      {
         "title":"[Technical Post] Running Python as fast as C code",
         "description":"Introduction to the just-in-time compilation PyPy compiler for Python...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "17"}],
		 "year": 2021,
		 "month": 5,
		 "day": 8,
		 "order": 17
      },
      {
         "title":"[Technical Post] Fast Start Your ML Project Using Auto-ML Libraries in Python",
         "description":"4 Auto-ML Libraries to Automate Machine Learning Pipeline...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "18"}],
		 "year": 2021,
		 "month": 5,
		 "day": 13,
		 "order": 18
      },
      {
         "title":"A Step Towards Explainable AI - The Explainable Boosting Machine",
         "description":"Machine learning models are concering new hilltops everyday now and sprading into more fields of life such as medicine, miletary, life-supporting systems and other which require individuals to put their faite in these models. How one can do so without understanding the model? Explainable Boosting Machine (EBM) is one step torwards a more interpretabe machine learning models...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "19"}],
		 "year": 2021,
		 "month": 6,
		 "day": 8,
		 "order": 19
      },
      {
         "title":"AI Agent For The OCTI Board Game",
         "description":"We developed a digital version of the OCTI board with three artificial intelligence (AI) players. The first two AI players are based on deterministic algorithms (greedy and MinMax) while the third is based on reinforcement learning (RL) algorithm. We train the RL player based on historical games (offline) and then personalize it using online learning against specific player. An experiment conducted with five levels of human players show that the RL is able to win 44% of the time (greedy and MinMax win 14% and 32%, respectively) making it a valid AI player.",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "20"}],
		 "year": 2021,
		 "month": 6,
		 "day": 14,
		 "order": 20
      },
      {
         "title":"Meta Reinforcement Learning - What Are You?",
         "description":"Meta Reinforcement Learning sounds cool, isn't it? Many ignore this subject due to the complicated mathematics involved in any paper or blog post that talks about this subject. But, no more! Meta reinforcement learning in 3 minutes or less.",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "21"}],
		 "year": 2021,
		 "month": 7,
		 "day": 16,
		 "order": 21
      },
      {
         "title":"Black Market Size Estimation Methods Are Stuck In The 90s",
         "description":"The accurate estimation of the black market is an urgent issue for governments as it has a direct influence on the taxation policy, crime, and other activities managed and controlled by the government. However, the current approach for estimating the size of the black market is based on an idea that not holds anymore due to technological shifts. We propose a new approach to perform this task...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "22"}],
		 "year": 2021,
		 "month": 8,
		 "day": 1,
		 "order": 22
      },
      {
         "title":"Optimal Intervention Policies For the COVID-19 Pandemic Emerge from Socioeconomic-Heterogeneous Dynamics",
         "description":"The COVID-19 pandemic is a rolling crisis that required policymakers around the world to take action to manage the pandemic spread. During the period where vaccination was not available, the pandemic spread management lied in non-pharmaceutical interventions (NPIs). A large number of mathematical models have been proposed to predict the pandemic spread and analyze the influence of various NPIs on multiple scenarios, getting more accurate and sophisticated over time. In this post, we review the latest mathematical models for pandemic spread NPIs and their main limitations. Specifically, the usage of modeling a homogeneous population rather than a heterogeneous one. ",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "23"}],
		 "year": 2021,
		 "month": 8,
		 "day": 21,
		 "order": 23
      },
      {
         "title":"Give Me a One-Handed Economist: The Ongoing Struggle Between Social and Exact Science In Economy",
         "description":"Classicial and modern economic research is suffer froma dissonance between social sciences which are mostly empirical-based with minor to no rigorousness theories and the exact science rooted in theories increasingly being built from simple rules. We suggest to overcome this gap using computer science methods...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "24"}],
		 "year": 2021,
		 "month": 8,
		 "day": 27,
		 "order": 24
      },
      {
         "title":"Targeted Drug Delivery using Nanoparticles Can Revolutionize Cancer Therapy",
         "description":"Surgery, chemotherapy, radiotherapy, and hormone therapy are the main common anti-tumor therapeutic approaches...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "25"}],
		 "year": 2021,
		 "month": 11,
		 "day": 25,
		 "order": 25
      },
      {
         "title":"Computing the Distance Between DNA Sequences - Not As Simple As You Might Think",
         "description":"Bioinformatics in general and in the context of medical genomics is a promising field of study which allows us to develop better and more personalized treatments and provide more accurate diagnostics. Computing the distance between DNA sequences is a central task in multiple bioinformation tasks. From a quick glance, it may seem straightforward to compare the similarity between two vectors. However, it is not as simple as you might think... ",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "26"}],
		 "year": 2021,
		 "month": 12,
		 "day": 5,
		 "order": 26
      },
      {
         "title":"The Promise and Limitations of Cell-Cell Mathematical Models in Cancer Treatment",
         "description":"Cell-cell interaction models can fairly represent the biological and clinical processes in general and for oncological patients in particular. The current model is starting to take into consideration the spatial effect of cells and organs but much more research should be conducted so we fully understand and be able to model these dynamics. ",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "27"}],
		 "year": 2022,
		 "month": 3,
		 "day": 15,
		 "order": 27
      },
      {
         "title":"Automatic Distribution Fitting of Tabular Data using the Simulated Annealing Algorithm",
         "description":"Allocating a parametric distribution to features in tabular data is a well-known problem for all data analysis as this provides a wide range of abilities such as better explainability, generation of new samples, and better picking of classification and regressions models using meta-learning. In this study, we propose a simulated annealing approach to allocate a parametric distribution for features, obtaining the optimal distribution and its parameters. We show that the proposed approach performs on average similar to the commonly used brute force with maximum likelihood approach even for simple distributions such as uniform and normal distributions. ",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "28"}],
		 "year": 2022,
		 "month": 4,
		 "day": 1,
		 "order": 28
      },
      {
         "title":"3 Things I learned about Conflicts in Academia",
         "description":"In this blog-post, I present from a personal point of view an analysis of common sources of conflicts in academic settings and practical strategies for managing them effectively. Through personal experiences and reflections, I identify three main key lessons: the importance of communication, understanding power dynamics, and understand differences in objectives of the team members. ",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "29"}],
		 "year": 2023,
		 "month": 2,
		 "day": 26,
		 "order": 29
      },
      {
         "title":"We are Ready to Unleash the Power of Data Science and Mathematics in Medicine",
         "description":"In this blog-post, we discuss the significant impact that data science and mathematics have had on healthcare research, from precision and personalized medicine to healthcare operations. The use of predictive analytics, data-driven experiment design, and artificial intelligence is providing clinicians and researchers with unique insights that were once unimaginable. We explore several specific examples, such as the use of spatial data about cells to improve treatment protocols, the development of personalized medicine using socio-demographic data, and the usage of pandemic models to predict future outbreaks.",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "30"}],
		 "year": 2023,
		 "month": 4,
		 "day": 11,
		 "order": 30
      },
      {
         "title":"Sustainable Urban Planning: Using Data to Create Greener Cities",
         "description":"In a rapidly urbanizing world, the pressing challenges of reconciling growth and sustainability are being addressed through data-driven urban planning. This blog post explores how data science is reshaping urban development to create environmentally resilient cities, citing examples such as predictive water demand modeling, IoT-enabled waste collection optimization, and dynamic traffic pattern analysis, while emphasizing future research opportunities for students and researchers in the interdisciplinary field.",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "31"}],
		 "year": 2023,
		 "month": 8,
		 "day": 23,
		 "order": 31
      },
      {
         "title":"Go Ahead and Ask for a Nickle on the Dime: The Systematic Issue of Academic Collaboration and How to Negotiate It Gracefully ",
         "description":"Academic collaboration is pivotal for groundbreaking research but comes with unspoken complexities. Negotiating credit, resource distribution, and dynamics is akin to solving a puzzle. Addressing these challenges is crucial for fruitful teamwork. Research indicates early conflicts in authorship credit, highlighting a systemic issue in academia. Strategies include understanding co-authors on a personal level, agreeing on authors' list order, task delegation, and mediation mechanisms. An exit strategy is essential for irreconcilable differences. While effective, these strategies might challenge traditional norms, requiring a balance between pragmatic navigation and academic goodwill. Acknowledging the impact of collaborators, this blog post advocates for constructive collaboration.",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "32"}],
		 "year": 2023,
		 "month": 9,
		 "day": 1,
		 "order": 32
      },
      {
         "title":"5 AI Tools That Makes The Academics Life Easier",
         "description":"It is not a secret Artificial Intelligence (AI) revolutioning the wolrd for some time now. However, the release of chatGPT was a game changer, brining Large Language Models (LLMs) in a productize and free way to the masses. This amazing tool has been also adopted by academics, if they admit it or not.  In this context, using AI tools in academia is still debated for multiple moral, legal, and operational reasons.  Nonetheless, the end is clear - we will use AI as we use computers, the internet, and grammer correction models. This is a question of when the old academics will understand they can not hold the gate close much longer. Until this happens, in this blog post I quickly present five AI tools you should try out...",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "33"}],
		 "year": 2024,
		 "month": 1,
		 "day": 1,
		 "order": 33
      },
      {
         "title":"The Revolution Has Begun: How Large Language Models are Set to Transform Academia",
         "description":"In this blog post, we explore the transformative potential of Large Language Models (LLMs) in academia, shedding light on their impact across three key domains: writing assistance, literature navigation, and global collaboration. From alleviating writer's block to breaking down language barriers, LLMs are revolutionizing the scholarly landscape by enhancing productivity, facilitating knowledge dissemination, and fostering interdisciplinary collaboration. Join us on a journey into the future of academia, where the power of LLMs promises to reshape the way we think, write, and collaborate in the pursuit of knowledge.",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "34"}],
		 "year": 2024,
		 "month": 3,
		 "day": 3,
		 "order": 34
      },
      {
         "title":"My Five Tips for PhD Students That I Wished I Knew When I Started",
         "description":"Discover five essential tips for navigating your PhD journey smoothly! In this blog post, I share my five top tips for new PhD students and share my personal experiences of how and when I learned these lessons.",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "36"}],
		 "year": 2024,
		 "month": 6,
		 "day": 23,
		 "order": 35
      },
      {
         "title":"Find Your Perfect PhD Research Topic In 4 Not-Very-Easy Steps",
         "description":"Stuck choosing a PhD topic? Feeling lost in a sea of possibilities? This blog post ignites your passion and equips you with a 4-step guide to find the perfect research question that fuels your PhD journey and leads to groundbreaking results.",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "38"}],
		 "year": 2024,
		 "month": 7,
		 "day": 16,
		 "order": 36
      },
      {
         "title":"The Biology of Music - Are these fields are that different from the AI perspective? ",
         "description":"This article explores the surprising connection between music and biology, revealed through the lens of AI. Discover how AI unlocks the mathematical secrets of music, and how it's used to create virtual musicians and personalize your listening experience.",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "35"}],
		 "year": 2024,
		 "month": 7,
		 "day": 18,
		 "order": 37
      },
      {
         "title":"[Code post] Crafting RL solutions - from simple to hard, a beginners guide",
         "description":"This blog post offers a comprehensive guide to Reinforcement Learning (RL), bridging the gap between theoretical understanding and practical implementation. We shortly discuss the foundational concepts of RL, providing a mathematical basis for the applicative part. Subsequently, we explore core algorithms, practical considerations, and real-world applications. By combining theoretical depth with practical insights, this guide empowers readers to build robust and effective RL agents.",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "39"}],
		 "year": 2024,
		 "month": 8,
		 "day": 17,
		 "order": 38
      },
      {
         "title":"Supercharge Your Research: The Best AI Tools Every Scholar Needs",
         "description":"Discover how cutting-edge tools like Research Kik, Syspace, and ChatGPT are revolutionizing the way scholars generate questions, promote their work, and analyze data. From streamlining literature reviews to enhancing data visualizations, these AI innovations are designed to boost productivity and impact. ",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "40"}],
		 "year": 2024,
		 "month": 8,
		 "day": 29,
		 "order": 39
      },
      {
         "title":"[Code post] Building a Snake AI with Deep Reinforcement Learning: A Step-by-Step Guide Using Keras",
         "description":"In this blog post, we have step-by-step guide to train a neural network to navigate a grid, eat apples, and avoid collisions - yes, the Snake game! Discover how to implement experience replay, visualize gameplay with Pygame, and fine-tune your AI's performance. Whether you are a seasoned developer or new to AI, this hands-on guide offers practical insights and techniques to elevate your projects. Ready to see how AI can master the classic Snake game?",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "41"}],
		 "year": 2024,
		 "month": 9,
		 "day": 15,
		 "order": 40
      },
      {
         "title":"Introducing - Tracademic!",
         "description":"Navigating academic submissions can feel like a maze. Researchers juggle multiple deadlines, revisions, and journals, often losing track in the chaos. Tracademic steps in quietly, offering a platform that could be your lifeline—tracking your submissions and deadlines in one neat dashboard. For those who are unfunded or overwhelmed, Tracademic offers a free plan. It's not flashy, but it does what you need: keeps you on top of submission statuses and provides gentle reminders when your papers need attention. Maybe it will not solve all your problems, but it might just help you manage your lab a litter better.",
         "fileLinks":[{"info": "Read More", "type": 2, "link": "42"}],
		 "year": 2024,
		 "month": 9,
		 "day": 27,
		 "order": 41
      }
	]
}
