[
   {
      "title":"Lightweight JS pathfinding genetic programming",
      "description":"The idea is to present light weight (Java Script written) genetic programming. There are graphs (using Google's API) for monitoring the optimization process and game-link controlers to control the parameters of the evaluations.",
      "pageLink":"https://bitbucket.org/teddy_lazebnik/js-path-finding-genetic-programming/src/master/",
      "tags":["js", "Genetic Programing"]
   },
   {
      "title":"Hebrew associative word distance calculator",
      "description":"A SaaS solution with Front-end, Back-end and algorithms in a single project. Allowing to train W2V and then Random-Forest model on a data of associative words and than querying the model with new words. The training and evaluation can be done with an easy to use GUI. In addition, some BI tools and basic user management is integrated into the project.",
      "pageLink":"https://teddylazebnik.info/js-path-finding-genetic-programming.html",
      "tags":["Python", "NLP", "W2V", "RF"]
   },
   {
      "title":"A python class generator",
      "description":"Allowing to build a class file using code for on-run class generation and meta-class analysis.",
      "pageLink":"https://bitbucket.org/teddy_lazebnik/python-class-generator/src/master/",
      "tags":["Python", "meta-classes"]
   },
   {
      "title":"Infinite run game",
      "description":"An Indie game made in Unity (C#) of 3d infinity runer taking place in space. A smart memory management by creating and destraction of objects according to the potentional pathes of the user is included.",
      "pageLink":"https://github.com/ArielA147/Space-temple-run",
      "tags":["C#", "Unity", "Game"]
   },
   {
      "title":"Tower collapse game",
      "description":"A simple 3d game allowing to build a tower from blocks with enemies trying to hit and destroy your tower.",
      "pageLink":"https://bitbucket.org/teddy_lazebnik/babylonian-revenge-mobile-game/src/master/",
      "tags":["C#", "Unity", "Game"]
   },
   {
      "title":"Pubmed and arXiv paper downloader",
      "description":"The project written in Java allowing a user to download full papers from both PubMed and arXiv.",
      "pageLink":"https://bitbucket.org/galk-opensource/pubmed-arxiv-paper-downloader/src/master/",
      "tags":["Java", "Academic Search Engine"]
   },
   {
      "title":"K-means great again",
      "description":"This project provides three different extensions for the K-means and Knn algorithm provided in the \"sklearn\" module. First, X-means which finds the best 'k' hyper-parameter in K-means automatically for given possible set of K's. Second, n-regression convert the classic Knn classification problem to a regression predictor. Third, Knn over time allowing to find casters using the Knn algorithm with a strong time component. This technique inherently using changing of clusters over time and not just another dimension in the feature-space.",
      "pageLink":"https://bitbucket.org/teddy_lazebnik/knn_over_time/src/master/",
      "tags":["Python", "ML"]
   },
   {
      "title":"Academic PDF to TXT",
      "description":"The project written in Java allowing a user to convert academic papers in a PDF format to a TXT extracting the text of the paper using several techniques. Currently, it support the following geometrical format elements popular in academic papers: 1. 2 coloum texts - by spliting the page into 2 pages, one per coloum. 2. Graphs, tables and images - finding the boundery of each one of them in a page and removing it by overriding with white rectangle. 3. Equeations - the OCR providing short and non-words from equeations which is mostly cleared in the post-processing stage.",
      "pageLink":"https://bitbucket.org/galk-opensource/paper-pdf-text-extractor/src/master/",
      "tags":["Java", "OCR"]
   },
   {
      "title":"Home Darts ScoreBoard",
      "description":"A darts scoreboard for home use",
      "pageLink":"https://bitbucket.org/teddy_lazebnik/darts_score_board/src",
      "tags":["Python", "JS", "Game"]
   },
   {
      "title":"Simple (yet effective) General Semantic Analysis",
      "description":"General Semantic Analysis demo fully develped in Vanila JS. Checkout the whatsapp chat analysis - a lot of fun",
      "pageLink":"https://teddylazebnik.info/sementic_analysis_sample.html",
      "tags":["JS", "NLP"]
   },
   {
      "title":"Game of Life CoronaSpread analysis",
      "description":"An implementation of the \"game of life\" simulating corona spread in the population.",
      "pageLink":"https://teddylazebnik.info/game_of_life/index.html",
      "tags":["JS", "P5.JS"]
   },
   {
      "title":"Associative Words Grouper",
      "description":"A  GUI allowing to load lists of source and target words (from associative experiments) and build similarity groups.",
      "pageLink":"https://teddylazebnik.info/assosiative_words_grouper.html",
      "tags":["JS"]
   }
]