[
   {
      "title":"Daily Issues and Solutions of a Nano-bioinformatic Research",
      "description":"One may ask how does computer science integrate with biological research. The answer lays in the field of nano-bioinformatics.",
      "pageLink":"https://www.linkedin.com/pulse/daily-issues-solutions-nano-bioinformatic-research-teddy-lazebnik/"
   },
   {
      "title":"The History of NLP with the Hebrew Language",
      "description":"The story of the Natural language processing (NLP) begins in the 1950s, although previous work can be found. In 1950, Alan Turing published a famous article entitled \"Computing Machinery and Intelligence\" which proposes what is now called the Turing test as an intelligence criterion.",
      "pageLink":"https://www.linkedin.com/pulse/history-nlp-hebrew-language-teddy-lazebnik/"
   },
   {
      "title":"3 techniques for a better quality of tagged data for ML tasks",
      "description":"At the age of data-driven algorithms, business, personal life, and much more we are seeing each day how machines \"learn\" to perform more complex which were out of reach with traditional algorithms. We see businesses optimize their sales, customer loyalty, and employee happiness by investing in analyzing the data we are able to collect in a cheap and fast way nowadays.",
      "pageLink":"https://www.linkedin.com/pulse/3-technics-better-quality-tagged-data-ml-tasks-teddy-lazebnik/"
   },
   {
      "title":"3 steps to the medicine of the future",
      "description":"From the beginning of mankind, we try to defeat death and make our lifestyle better by being healthy. This is a very understandable wish for anybody who was sick even once (For the readers who weren't ill even once in their life, please send me an email with your contact details - I would like to check this phenomena).",
      "pageLink":"https://www.linkedin.com/pulse/3-steps-medicine-future-teddy-lazebnik/"
   },
   {
      "title":"Medical Nanorobotics - Science or Science Fiction?",
      "description":"Robots always caught our imagination. Books who had been written century before the first robot already described the complex relationship between humans and robots. Actually, people thought of metal devices with \"life\" already at the area of classic greek...",
      "pageLink":"https://www.linkedin.com/pulse/medical-nanorobotics-science-fiction-teddy-lazebnik/"
   },
   {
      "title":"Why should you use dotnet core for your next AI project production?",
      "description":"Artificial intelligence (AI) is one of the hottest topics in the last few years. The fourth industrial revolution some might say, the big promise for the next years others predict. Yet, some see this as an unreachable fantasy over the following decade. Some groups even claim that we as humans should not go through this slippery road.",
      "pageLink":"https://www.linkedin.com/pulse/why-should-you-use-dotnet-core-your-next-ai-project-teddy-lazebnik/"
   },
   {
      "title":"4 Things To Consider When You User-Testing Your Service.",
      "description":"Websites, mobile applications, professional software, operation systems, and basically each and every software that has been developed for the world to use as a component of the interaction with the user. This can be as basic as a command line or very complex like a screen with hundreds of buttons and options.",
      "pageLink":"https://www.linkedin.com/pulse/4-things-consider-when-you-user-testing-your-service-teddy-lazebnik/"
   }
]